[
  {
    "Actor Name": "Andreas Katsulas",
    "Star Trek Roles": "1989 - Commander Tomalak - STTNG S3:E7 (The Enemy)\n1990 - Commander Tomalak - STTNG S3:E10 (The Defector)\n1990 - Commander Tomalak - STTNG S4:E8 (Future Imperfect)\n1994 - Commander Tomalak - STTNG S7:E25 (All Good Things...)\n2003 - Vissian Captain Drennik - ST:ENT S2:E22 (Cogenitor)",
    "Mini Bio": "Missouri-born actor Andreas Katsulas (18 May 1946 – 13 February 2006; age 59) is best known to Star Trek fans for playing the recurring character of Romulan Commander Tomalak on Star Trek: The Next Generation. He also played Vissian Captain Drennik in the Star Trek: Enterprise second season episode \"Cogenitor\".\nOut of his four appearances as Tomalak, he appeared on a viewscreen in three of them. He once commented: \"I felt much more comfortable when he was an incredible giant on a screen, just a face. Suddenly when I had to account for everything else, I didn't feel support and nothing was supporting what I was doing. I was happy not to recur unless it would have gone back to a screen character\". (Captains' Logs: The Unauthorized Complete Trek Voyages)\n\nKatsulas is best known for his role as Ambassador G'Kar on J. Michael Straczynski's Babylon 5. Claudia Christian, Bill Mumy, Patricia Tallman, Caitlin Brown, and Mary Kay Adams also starred in the series, which ran from 1994 through 1998. Walter Koenig had a recurring role on the series.\n\nKatsulas' most recognized film role is that of the murderous one-armed man in the 1993 thriller The Fugitive, based on the classic series of the same name. Fellow Next Generation guest star Daniel Roebuck also had a role in the film, as did Richard Riehle and Danny Goldring.\n\nOne of his earliest film appearances came in Ragtime (1981, featuring Brad Dourif, Robert Joy, and Ethan Phillips. The following year, he appeared in the made-for-TV movies A Midsummer Night's Dream, based on William Shakespeare's play and co-starring Steve Vinovich, and A Very Delicate Matter, with Zach Galligan. Katsulas would again appear with Galligan (as well as Erick Avari and Lawrence Tierney) in Nothing Lasts Forever (1984). This was followed with roles in such films as Someone to Watch Over Me (1987, with Daniel Hugh Kelly, Mark Moses, and John Rubinstein), Sunset (1988, starring Malcolm McDowell), Next of Kin (1989, with Michael J. Pollard), True Identity (1991, co-starring Frank Langella and Michael McKean), and Hot Shots! Part Deux (1993, with Miguel Ferrer and Gregory Sierra). He also played the villain in Stuart Baird's Executive Decision (1996, featuring Brad Blaisdell, Tim Kelleher, Warren Munson, Richard Riehle, and Dey Young).\n\nOutside of his appearances on Trek, Katsulas guest-starred on numerous other TV series. One of his earliest was a 1982 episode of General Hospital, along with Deborah May. He followed this with two appearances on Max Headroom along with series regulars Matt Frewer, W. Morgan Sheppard, and Concetta Tomei and fellow guest-star Charles Rocket. He also appeared in episodes of The Equalizer (with Daniel Davis, Robert Lansing, and Keith Szarabajka), Alien Nation (starring Gary Graham, Eric Pierpoint, Michele Scarabelli and Ron Fassler and guest starring Sam Anderson, Joel Swetow and Craig Richard Nelson), Murder, She Wrote (with Bruce Gray, Stephen Macht, David Soul, and William Windom), Millennium (starring Terry O'Quinn), and NYPD Blue (with Daniel Benzali, Gordon Clapp, William Dennis Hunt, and Don Stark). Among the made-for-TV movies in which he appeared include The Neon Empire (1989, with Natalia Nogulich) and The Death of the Incredible Hulk (1990, with Barbara J. Tarbuck).\n\nKatsulas, a heavy smoker, was diagnosed with inoperable lung cancer in early 2005. He lost his battle with the disease on February 13, 2006, at the age of 59. His appearance on Enterprise was among his last television appearances.",
    "Image": "https://www.andreaskatsulas.com/gallery/pics/andr34..jpg"
  },
  {
    "Actor Name": "Ann Gillespie",
    "Star Trek Roles": "1989 - Ensign Hildebrant - STTNG S2:E15 (Pen Pals)\n1993 - Nurse Jabara - ST:DS9 S1:E4 (Babel)\n1994 - Nurse Jabara - ST:DS9 S2:E22 (The Wire)\n1995 - Nurse Jabara - ST:DS9 S3:E13 (Life Support)\n1995 - Nurse Jabara - ST:DS9 S3:E18 (Distant Voices)",
    "Mini Bio": "Ann H. Gillespie (born 8 August 1957; age 67) is an actress who played two Star Trek roles, with her largest being the recurring character of Nurse Jabara, whom she played four times in the first three seasons of Star Trek: Deep Space Nine. Gillespie had earlier portrayed Ensign Hildebrant in the Star Trek: The Next Generation second season episode \"Pen Pals\". In 1984, Gillespie married the future fellow Next Generation and Star Trek: Voyager guest actor Jeff Allin. \n\nShe is probably best known for her recurring role as Jackie Taylor in Beverly Hills, 90210, whom Gillespie played throughout the series' ten year run. Her career on 90210 had her working alongside Michael Durrell, Stanley Kamel, Kerrie Keane, Dina Meyer and Noley Thornton. From 2008 to 2009, Gillespie reprised her role as Jackie Taylor in six episodes of its successor 90210.\n\nGillespie also guest starred in Happy Days, Matlock (with Corbin Bernsen and Granville Van Dusen), Hunter (with Leslie Bevis) and 7th Heaven (starring Stephen Collins and Catherine Hicks).\n\nGillespie received a BA degree from Goddard College in 2003. She is also an Episcopal priest, and uses the names Mother Ann Gillespie and Rev. Ann Gillespie.",
    "Image": "https://img.seriebox.com/people/47/47458/ann-gillespie_min225.jpg"
  },
  {
    "Actor Name": "Anne Haney",
    "Star Trek Roles": "1989 - Rishon Uxbridge - STTNG S3:E3 (The Survivors)\n1993 - Renora - ST:DS9 S1:E7 (Dax)",
    "Mini Bio": "Anne Haney (4 March 1934 – 26 May 2001; age 67) was the actress who played Rishon Uxbridge in the Star Trek: The Next Generation third season episode \"The Survivors\" and Els Renora in the Star Trek: Deep Space Nine first season episode \"Dax\".\n\nHaney was a regular on Mama's Family from 1986 through 1989, and had a recurring role as Judge Marilyn Travelini on L.A. Law from 1986 through 1994. She also appeared in two episodes of Quantum Leap, starring Scott Bakula from Star Trek: Enterprise, the former starring Parley Baer and the latter with Hal Landon, Jr. and Patrick Massett. She also appeared with Andrew Robinson in the 1981 failed television pilot, Big Bend Country which was directed by Ralph Senensky.\n\nHer feature film credits include K-9000 (1991; with Judson Scott, David Renan, Ted Barba, James H. Burk, Kenny Endoso, Jeff Imada, Dave Perna, and Nicholas Shaffer, and with stunts by Greg Barnett and Lane Leavitt), Mrs. Doubtfire (1993, with William Newman), The American President (1995), and Liar Liar (1997), which also featured Mitchell Ryan, Ernest Perry, Jr., and Eric Pierpoint. She co-starred in Roses Are for the Rich (1987, featuring Star Trek: Voyager stars Kate Mulgrew and Robert Picardo).\n\nShe appeared in Psycho (1998, featuring Ken Jenkins and Roy Brocksmith). Her \"Survivors\" co-star John Anderson played the car salesman in the original version.\n\nShe also guest-starred in an episode of The Golden Girls with Robert Picardo and Bill Quinn.\n\nAt the age of 67, Haney died of congestive heart failure at her home in Studio City, Los Angeles, California.",
    "Image": "https://imgcdn.stablediffusionweb.com/2024/4/19/b291b32e-c0c6-4ad4-b18b-15fc2f6ae8de.jpg"
  },
  {
    "Actor Name": "Annette Helde",
    "Star Trek Roles": "1995 - Karina - STTNG S3:E17 (Visionary)\n1996 - Guard - Star Trek: First Contact\n1997 - Takar - ST:VOY S4:E7 (Scientific Method)\n1998 - Lt. Nadia Larkin - ST:DS9 S7:E8 (The Siege of AR-558)",
    "Mini Bio": "Annette Helde (born 14 November 1956; age 67) is an actress who appeared in two Star Trek spin-off series and in Star Trek: First Contact. In addition she portrayed a character in the 1996 video game Star Trek: Klingon.\nFor the Star Trek: Voyager fourth season episode \"Scientific Method\", Helde filmed her scene on Thursday 31 July 1997 on Paramount Stage 8. Her costume from this episode was later sold off on the It's A Wrap! sale and auction on eBay. (X)\n\nHelde is primarily a stage actress and has appeared in many plays such as MacBeth in 1988 and A Few Good Men between 1989 and 1991, in which she played Lt. Cmdr. Joanne Galloway, a character which was played by Demi Moore in the film version of 1992. She is frequently involved in the Denver Center for Performing Arts in Denver, Colorado.\n\nOn-screen she has appeared in films such as Nixon (1995, with Paul Sorvino, Robert Beltran, Tony Plana, David Paymer, Saul Rubinek, and Wilson Cruz), Freeway (1996, with Lorna Raver), Bean (1997, with Harris Yulin, Larry Drake, and April Grace), Magnolia (1999, with Henry Gibson, Jim Beaver, and April Grace), and The Expendables (2000, with Brett Cullen, Eileen Weisinger, Caron Colvett, Tim Rigby, and Spice Williams).\n\nShe has also appeared in several television series such as Chicago Hope (1995, with Erick Avari), Providence (1999, alongside Cristine Rose and Charles S. Chun), and Family Law (starring Christopher McDonald, Julie Warner, and Salli Elise Richardson).",
    "Image": "https://fwcdn.pl/ppo/19/46/91946/222753.1.jpg"
  },
  {
    "Actor Name": "Armin Shimerman",
    "Star Trek Roles": "1987 - Letek - STTNG S1:E4 (The Last Outpost)\n1987 - Gift-Box Face - STTNG S1:E10 (Haven)\n1989 - DaiMon Bractor - STTNG S2:E21 (Peak Performance)\n1993-1999 - Quark - ST:DS9\n1994 - Quark - STTNG S7:E21 (Firstborn)\n1995 - Quark - ST:VOY S1:E1 (Caretaker)\n1998 - Quark - Star Trek: Insurrection",
    "Mini Bio": "Armin Shimerman (born 5 November 1949; age 74) is the actor who is best known in the Star Trek universe for his portrayal of Quark on Star Trek: Deep Space Nine. He is one of only seven actors to appear in three different live action Star Trek series (Star Trek: The Next Generation, Deep Space Nine, and Star Trek: Voyager) as the same character. Prior to assuming the role of Quark, however, Shimerman earned the distinction of being among the first to ever portray a Ferengi in the Star Trek franchise when the race first appeared in the Next Generation episode \"The Last Outpost\". Shimerman went on to make two more appearances on The Next Generation (including a second time as a Ferengi in the episode \"Peak Performance\") and to star on Deep Space Nine for its entire seven-year run (1993 – 1999). He also co-wrote the Trek novel The 34th Rule.\n\nBorn to immigrant parents in Lakewood, New Jersey, Shimerman and his family moved to Los Angeles at the age of sixteen. There, his mother enrolled him into a drama group to help her son meet new people. After graduating from the University of California, Los Angeles (UCLA), Shimerman was one of eight people out of nine hundred applicants chosen to become an apprentice at the prestigious Old Globe Theater in San Diego, California. Shimerman participated in numerous regional theater productions before moving to New York and landing roles on the Broadway stage.\n\nShimerman's Broadway debut came when he played part of an ensemble and served as an understudy in the musical Threepenny Opera, which ran for 306 performances from 1 May, 1976 through 23 January, 1977. \"Peak Performance\" co-star Roy Brocksmith was also a part of that play's cast. Shimerman next performed in the play Saint Joan from December 1977 through February 1978 and played the role of Mr. Thorkelson in the musical I Remember Mama in 1979.\n\nShimerman ultimately moved back to Los Angeles, where he acquired guest spots on such television shows as Cagney & Lacey, Remington Steele, andThe Facts of Life. From 1987 through 1989, he was a recurring player on the TV series Beauty and the Beast, which starred Star Trek Nemesis actor Ron Perlman and Tony Jay. He went on to make appearances on L.A. Law (starring Corbin Bernsen and Larry Drake), Who's the Boss?, Alien Nation (starring Gary Graham, Eric Pierpoint, and Michele Scarabelli), and Married... with Children. Shimerman also became a regular on Brooklyn Bridge during that show's first season (1991-92), playing Uncle Bernie.\n\nBeyond Star Trek, however, he is perhaps best known for his recurring role as Principal Snyder on Buffy the Vampire Slayer, and Dr. Nefarious in Ratchet and Clank. His character on Buffy was killed by a transformed Mayor Wilkins, played by Trek guest star Harry Groener.",
    "Image": "https://workingactorsjourney.com/wp-content/uploads/2018/01/Armin-Shimerman.png"
  },
  {
    "Actor Name": "Aron Eisenberg",
    "Star Trek Roles": "1993-1999 - Nog - ST:DS9\n1995 - Young Kazon - ST:VOY S1:E10 (State of Flux)\n1995 - Kar - ST:VOY S2:E2 (Initiations)",
    "Mini Bio": "Aron Eisenberg (6 January 1969 – 21 September 2019; age 50) was the actor who is best known for portraying Nog on Star Trek: Deep Space Nine.\n\nEisenberg worked with Mark Paniccia on the Malibu celebrity comic book \"The Rules of Diplomacy\". Alongside fellow Deep Space Nine performers Max Grodénchik, Chase Masterson, and Cecily Adams he performed sketches as the \"Ferengi Family Hour\" on several Star Trek conventions.\n\nEisenberg reprised his role as Nog in Star Trek Online beginning in the Season 10 mission \"Time in a Bottle\", released June 18, 2015. He also appeared in subsequent episodes of \"Season 10: The Iconian War\", and in the expansion \"Victory Is Life\" in 2018.\n\nBorn in Hollywood, California, USA, Eisenberg underwent a kidney transplant when he was a teenager, which stunted his growth at 5 feet. Eisenberg's oldest son Nicholas Lawrence Eisenberg was born 25 April 1997. His other son is Christopher Eisenberg.\n\nEisenberg made his first acting appearance in Beverly Hills Brats (1989, with Whoopi Goldberg and Star Trek stunt coordinator Dennis Madalone). Also that year, he starred with Lawrence Tierney in The Horror Show. His last movie of that year was Amityville 4: The Evil Escapes also starring Warren Munson. He appeared in Playroom (1990, directed by future Star Trek: Enterprise writer Manny Coto). He also starred in Streets that year. In 1991 he starred in Prayer of the Rollerboys and Puppet Master III: Toulon's Revenge with future Deep Space Nine guest stars Ian Abercrombie and Matthew Faison. In 1993 he played alongside Wil Wheaton in The Liars' Club. A year later, he starred in Pterodactyl Woman from Beverly Hills and in Brave New World (1998, with Leonard Nimoy, Miguel Ferrer, and Daniel Dae Kim).\n\nEisenberg also appeared in a few television series, including Parker Lewis Can't Lose (1991, episode \"Jerry: Portrait of a Video Junkie\"), Tales from the Crypt (1991, episode \"Undertaking Palor\", with John Glover, Jason Marsden, John Kassir, and Graham Jarvis), The Secret World of Alex Mack (1994, episodes \"School Dance\" and \"The Feud\", with J.D. Hall and John Marzilli in the latter one), and Brotherly Love (1996, episode \"Motherly Love\", starring Melinda Culea and Liz Vassey, and guest-starring Lee Arenberg). Eisenberg also performed in several stage plays, received awards for these appearances, and directed a few stage plays.\n\nHe died from heart failure on 21 September 2019,  the same day as Star Trek: The Original Series actors Jack Donner and Sid Haig.",
    "Image": "https://ew.com/thmb/792MhJhlQkYzuL--tz9P2Rd5SFA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/aron-eisenberg-2000-06a180d9049d4929aa699dc304177144.jpg"
  },
  {
    "Actor Name": "Barbara Babcock",
    "Star Trek Roles": "1967 - Trelane's Mother - ST:TOS S1:E17 (The Squire of Gothos)\n1967 - Mea 3 - ST:TOS S1:E23 (A Taste of Armageddon)\n1968 - Beta 5 Computer - ST:TOS S2:E26 (Assignment: Earth)\n1968 - Commander Loskene - ST:TOS S3:E9 (The Tholian Web)\n1968 - Philana - ST:TOS S3:E10 (Plato's Stepchildren)\n1969 - Zetar - ST:TOS S3:E18 (The Lights of Zetar)",
    "Mini Bio": "Actress Barbara Babcock (born 27 February 1937; age 87) has enjoyed a long Hollywood career that includes roles in nearly thirty movies, regular roles in a half-dozen or so television series, about sixty guest appearances, a number of which were repeat appearances for her character, and a number of stage appearances. She filmed her scenes for the Star Trek: The Original Series first season episode \"A Taste of Armageddon\" between Wednesday 28 December 1966 and Wednesday 4 January 1967 at Desilu Stage 10, and her scenes for \"Plato's Stepchildren\" between Monday 9 September 1968 and Thursday 12 September 1968, and on Tuesday 17 September 1968, also at Stage 10.\n\nBabcock had a recurring role as Liz Craig on Dallas from 1978 through 1982. She won an Emmy Award for her role as Grace Gardner in Hill Street Blues. Babcock is also known to television viewers for Dr. Quinn, Medicine Woman, for which she also received an Emmy nomination. She also co-starred with Jerry Orbach, Earl Boen and Juliana Donald in the 1987-88 series The Law & Harry McGraw, a spin-off of Murder, She Wrote in which she made five guest appearances.\n\nHer feature film credits include Bang the Drum Slowly (1973), The Lords of Discipline (1983), Salem's Lot (1979, with Original Series guest stars Elisha Cook, David Soul, Julie Cobb, and Reggie Nalder), Far and Away (1992, with Colm Meaney), and Space Cowboys (2000, with James Cromwell).",
    "Image": "https://image.tmdb.org/t/p/original/wOB6OSPgFlyI3V1PtCTg7q8vrdW.jpg"
  },
  {
    "Actor Name": "Bari Hochwald",
    "Star Trek Roles": "1995 - Elizabeth Lense - ST:DS9 S3:E22 (Explorers)\n2001 - Brin - ST:VOY S7:E21 (Friendship One)\n2002 - E'lis - ST:ENT S2:E6 (Marauders)",
    "Mini Bio": "Bari Hochwald (born 12 March 1964; age 60) is an actress and director who appeared as Elizabeth Lense in the Star Trek: Deep Space Nine third season episode \"Explorers\", Brin in the Star Trek: Voyager seventh season episode \"Friendship One\", and E'Lis in the Star Trek: Enterprise second season episode \"Marauders\".\n\nOther television series on which she has made guest appearances include Dr. Quinn, Medicine Woman (with Chad Allen and Barbara Babcock), Walker, Texas Ranger (with Noble Willingham), The Drew Carey Show (with Diedrich Bader), The Guardian (with Raphael Sbarge), CSI: Crime Scene Investigation (starring Paul Guilfoyle), and Desperate Housewives (starring Teri Hatcher and Steven Culp). She also had recurring roles on Party of Five (1998) and The Practice (2003).",
    "Image": "https://iv1.lisimg.com/image/4714022/224full-bari-hochwald.jpg"
  },
  {
    "Actor Name": "Brent Spiner",
    "Star Trek Roles": "1987-1994 Lt. Commander Data - STTNG\n1990 - Dr. Noonien Soong - STTNG S4:E3 (Brothers)\n1990 - Lore - STTNG S4:E3 (Brothers)\n1993 - Dr. Noonien Soong - STTNG S6:E16 (Birthright: Part 1)\n1993 - Lore - STTNG S6:E26 (Descent: Part 1)\n1993 - Lore - STTNG S7:E1 (Descent: Part 2)\n1993 - Dr. Noonien Soong - STTNG S7:E10 (Inheritance)\n1994 - Data - Star Trek: Generations\n1996 - Data - Star Trek: First Contact\n1998 - Data - Star Trek: Insurrection\n2002 - Data - Star Trek: Nemesis\n2002 - B-4 - Star Trek: Nemesis\n2004 - Dr. Arik Soong - ST:ENT S4:E4 (Borderland)\n2004 - Dr. Arik Soong - ST:ENT S4:E5 (Cold Station 12)\n2004 - Dr. Arik Soong - ST:ENT S4:E6 (The Augments)\n2020 - Data - Star Trek: Picard (Season 1)\n2020 - Dr. Altan Inigo Soong - Star Trek: Picard (S1:E9-10)\n2022 - Dr. Adam Soong - Star Trek: Picard (Season 2)\n2023 - Lore, B-4, and Data (merged)  - Star Trek: Picard (Season 3)",
    "Mini Bio": "Brent Jay Spiner (born 2 February 1949; age 75) is an actor best known for playing the android Starfleet officer, Lieutenant Commander Data, on Star Trek: The Next Generation, in four Star Trek films, several episodes of Star Trek: Picard, and off-screen in \"These Are the Voyages...\", the final episode of Star Trek: Enterprise. He also played Data's \"brother\", Lore, and \"father\", Doctor Noonien Soong, in various episodes of Next Generation. In 2002, he played B-4 in Star Trek Nemesis. He appeared as Arik Soong in a three-episode arc on Enterprise and as Altan Soong and Adam Soong on Picard. He also co-wrote the story for Star Trek Nemesis with Rick Berman and John Logan.\nHis portrayal of Data, the android in search of Humanity, made him an invaluable member of the Next Generation cast. These skills were highlighted in the episode \"Brothers\", in which Spiner played all three main characters of the story, effectively turning the episode into a \"one-man show\".\n\nHe is one of only six actors to play seven or more different characters in the Star Trek franchise, the others being Jeffrey Combs, Randy Oglesby, Thomas Kopache,J.G. Hertzler, and Vaughn Armstrong.",
    "Image": "https://ew.com/thmb/l_LmUAHE14AAB_TwV0q4e_mi7H4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/independence-day-0ccebf55e0104d078a6e0c1aa5227250.jpg"
  },
  {
    "Actor Name": "Brian Cousins",
    "Star Trek Roles": "1992 - Parem - STTNG S5:E24 (The Next Phase)\n1993 - Crosis - STTNG S6:E26 (Descent: Part 1)\n1993 - Crosis - STTNG S7:E1 (Descent: Part 2)\n2002 - Alien Lieutenant - ST:ENT S2:E12 (The Catwalk)",
    "Mini Bio": "Brian J. Cousins (born 9 May 1959; age 65) is an actor who appeared in two episodes of Star Trek: The Next Generation and in an episode of Star Trek: Enterprise. For the Enterprise episode \"The Catwalk\", Cousins filmed his scenes in late October 2002 on Paramount Stage 18.\n\nBesides his first Star Trek role in 1992, Cousins' earliest acting credits include Longtime Companion (1989, with Bruce Davison, Freda Foh Shen, Kelly Connell, Dan Butler, and Robert Joy), Killer Instinct (1991, with Charles Napier), Mandroid (1993, with Robert Symonds), and guest roles in One Life to Live (1990) and L.A. Law (1993, with Corbin Bernsen, Larry Drake, Aaron Lustig, and Lawrence Pressman).\n\nMore recently, Cousins appeared in episodes of No Ordinary Family (2010, with Jimmy Bennett, Autumn Reeser, Tim Kelleher, and Reggie Lee), The Mentalist (2010, with John Billingsley and Connor Trinneer), and Desperate Housewives (2012, with Teri Hatcher, Vanessa Williams, Patrick Fabian, John Rubinstein, and Stephanie Erb).",
    "Image": "https://i.gawby.com/mjaymg/mdg/mdq/mdu/mzu/b/r/o/brian-cousins-8533499266.jpg"
  },
  {
    "Actor Name": "Brian Markinson",
    "Star Trek Roles": "1994 - Vorin - STTNG S7:E13 (Homeward)\n1995 - Lieutenant Peter Durst - ST:VOY S1:E12 (Cathexis)\n1995 - Lieutenant Peter Durst - ST:VOY S1:E13 (Faces)\n1995 - Sulan - ST:VOY S1:E13 (Faces)\n1997 - Giger - ST:DS9 S5:E25 (In the Cards)",
    "Mini Bio": "Brian Markinson (born 14 September 1961; age 63) is an actor who played Vorin in the Star Trek: The Next Generation seventh season episode \"Homeward\", Pete Durst in the Star Trek: Voyager first season episodes \"Cathexis\" and \"Faces\", and Sulan in the latter, and Elias Giger in the Star Trek: Deep Space Nine fifth season episode \"In the Cards\". He was cast as Sulan for \"Faces\" prior to portraying Pete Durst in \"Cathexis\". (Beyond the Final Frontier, p. 200) Markinson had previously auditioned for the roles of The Doctor  and Neelix. \nMarkinson has also guest-starred in The X-Files (with Dey Young), The Dead Zone (with Nicole de Boer, David Ogden Stiers and Bill Mondy), and Stargate SG-1.\n\nHe had a recurring role on the Canadian television series Da Vinci's Inquest, as did Gwynyth Walsh. He also appeared in the 1994 HBO movie White Mile with Robert Picardo, Jacqueline Kim, Dakin Matthews, Ken Jenkins, Dan Kern, Fionnula Flanagan, Dan Gilvezan, Gina Ravarra, Brett Porter, Ken Thorley, Don McManus, and Tom Lupo. In 2002 he played a supporting part in the mini-series Taken with Matt Frewer, Anton Yelchin, Gwynyth Walsh, and Rob LaBelle. Markinson made two separate appearances in Ronald D. Moore's Battlestar Galactica, in a recurrent role on the 2010 spin-off prequel series Caprica, and in another part on the subsequent 2012 sequel television movie Blood & Chrome.\n\nMarkinson and Voyager co-star Robert Duncan McNeill became friends years later when they were reunited on the TV series Girlfriend's Guide to Divorce, in which Markinson acted and McNeill directed.",
    "Image": "https://www.speakerbookingagency.com/storage/celebrities/1549050826_brian-markinson.jpg"
  },
  {
    "Actor Name": "Brian Thompson",
    "Star Trek Roles": "1989 - Second Officer Klag - STTNG S2:E8 (A Matter of Honor)\n1993 - Inglatu - ST:DS9 S2:E7 (Rules of Acquisition)\n1994 - Klingon Helm - Star Trek: Generations\n1996 - Toman'torax - ST:DS9 S4:E22 (To the Death)\n2005 - Admiral Valdore - ST:ENT S4:E12 (Babel One)\n2005 - Admiral Valdore - ST:ENT S4:E13 (United)\n2005 - Admiral Valdore - ST:ENT S4:E14 (The Aenar)",
    "Mini Bio": "Brian Thompson (born 28 August 1959; age 65) is an actor from Ellensburg, Washington who appeared in several episodes of Star Trek: The Next Generation, Star Trek: Deep Space Nine and Star Trek: Enterprise, as well as in Star Trek Generations. His costume from the episode \"Rules of Acquisition\" was sold off on the It's A Wrap! sale and auction on eBay. (X)\n\nHe made his big screen debut in 1984 with a small role in The Terminator (starring Linda Hamilton, with Dick Miller, Paul Winfield, and Earl Boen).\n\nHe is probably best known in his role as the alien bounty hunter on The X-Files. His other TV credits include guest spots on Falcon Crest, Charmed and Buffy the Vampire Slayer. He appeared as Eddie Fiore in Kindred: The Embraced along with Jeff Kober, and as an eccentric Florida sheriff on Key West, that also starred Denise Crosby, T.C. Carson, Geno Silva, Leland Crooke and Jennifer Barlow. He is also one of the many actors who have appeared in both the Star Trek and Babylon 5 franchises, guest-starring in an episode of Crusade with Gary Cole, Tracy Scoggins, Marjean Holden and Daniel Dae Kim. He has also had numerous roles in including Cobra (1986, with Andrew Robinson, Roger Aaron Brown, Laura Drake, Leslie Morris, and Kurt V. Hulett), Three Amigos (1986, with Tony Plana), Alien Nation (1988, with Earl Boen, Jeff Kober, Roger Aaron Brown, Leslie Bevis, Keone Young, Tom Morga, and Frank Collison), Moon 44 (1990, with Malcolm McDowell and Leon Rippy), Ted & Venus (1991, with Lily Mariye, Carol Kane, Tricia O'Neil, and Vincent Schiavelli), Dragonheart (1996, with Dina Meyer and Jason Isaacs), Doctor Mordrid (1992, with Jeffrey Combs), Mortal Kombat Annihilation (1997, with Musetta Vander), and Joe Dirt (2001).",
    "Image": "https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/9346_v9_ba.jpg"
  },
  {
    "Actor Name": "Brock Peters",
    "Star Trek Roles": "1986 - Admiral Cartwright - Star Trek IV: The Voyage Home\n1991 - Admiral Cartwright - Star Trek VI: The Undiscovered Country\n1996-1998 - Joseph Sisko - ST:DS9",
    "Mini Bio": "Brock Peters (2 July 1927 – 23 August 2005; age 78) was an accomplished veteran actor of stage, film, and television. He played Admiral Cartwright in Star Trek IV: The Voyage Home and Star Trek VI: The Undiscovered Country, and later portrayed Joseph Sisko on Star Trek: Deep Space Nine.\nIn addition to his canon Star Trek roles, Peters voiced the role of General Mi'Qogh (β) in the video game Star Trek: Starfleet Command III.\n\nPeters was born as George Fisher in New York City to African and West Indian parentage and began acting at the age of ten. He trained in his craft at Fiorello H. LaGuardia High School of Music & Art and Performing Arts in New York City. He studied physical education at the City College of New York, which he abandoned after landing a role in the opera Porgy and Bess in 1949.\n\nBeyond the realm of Star Trek, Peters is probably best known for his performance as Tom Robinson, the black man unjustly accused and convicted of raping a white girl, in To Kill a Mockingbird (1962). His co-stars in this film included Star Trek: The Original Series guest actors Frank Overton, Paul Fix, William Windom, John Megna, and Richard Hale. On the set of that film, he struck up a lifelong friendship with star Gregory Peck, and delivered the eulogy at Peck's funeral in 2003.\n\nPeters also became friends with actor Charlton Heston after working with him on several stage productions in the 1940s and 1950s. Peters later worked with Heston on three films: Major Dundee (1965), Soylent Green (1973), and Two-Minute Warning (1976).",
    "Image": "https://swatkats.info/wp-content/uploads/2018/07/brock-peters.jpg"
  },
  {
    "Actor Name": "Carel Struycken",
    "Star Trek Roles": "1987 - Mr. Homn - STTNG S1:E10 (Haven)\n1989 - Mr. Homn - STTNG S2:E19 (Manhunt)\n1990 - Mr. Homn - STTNG S3:E24 (Ménage à Troi)\n1991 - Mr. Homn - STTNG S4:E22 (Half a Life)\n1992 - Mr. Homn - STTNG S5:E20 (Cost of Living)\n1996 - Spectre - ST:VOY S2:E23 (The Thaw)",
    "Mini Bio": "Carel Struycken (born 30 July 1948; age 76) is a Dutch actor known to Star Trek fans for playing Lwaxana Troi's assistant and valet, Mr. Homn, in five episodes of Star Trek: The Next Generation. He also played The Spectre in the Star Trek: Voyager second season episode \"The Thaw\".\n\nA giant of a man at seven feet (2.13 meters) tall, due to a medical condition known as acromegaly (giantism), Struycken is probably most well-known for his role as Lurch in The Addams Family (1991) and Addams Family Values (1993), in which he co-starred with Christopher Lloyd, and Carol Kane in the latter.\n\nStruycken made his debut as Mr. Homn on Star Trek: The Next Generation in the first season episode \"Haven\", which aired the week of 28 November 1987. He also had his only line on the show in this episode, when he thanks Picard for \"the drinks.\"\n\nStruycken reprised the role of Homn for four more episodes, and as the personal assistant to Ambassador Lwaxana Troi, Struycken always shared the screen with the late Majel Barrett-Roddenberry in each of his appearances. He filmed his scenes for the fourth season episode \"Half a Life\" on Monday 4 March 1991 on Paramount Stage 8 and 9. For his final appearance as Homn in \"Cost of Living\", he filmed his scenes between Tuesday 4 February 1992 and Thursday 6 February 1992, on Monday 10 February 1992, and on second unit on Friday 14 February 1992 on Paramount Stage 8 and 9.\n\nIn 1988, between his first and second appearance on The Next Generation, Struycken appeared in an episode of St. Elsewhere, starring William Daniels Ed Begley, Jr., Christina Pickles, Ronny Cox, Bruce Greenwood, Norman Lloyd, France Nuyen, and Jennifer Savidge. Struycken's episode also featured fellow Next Generation guest star Robert Costanzo.\n\nStruycken had a recurring role as \"The Giant\" (AKA: The Fireman) throughout the second season of Twin Peaks in 1990 and 1991, appearing with Mädchen Amick, Richard Beymer, Ray Wise, Miguel Ferrer, Kenneth Welsh, and Catherine Coulson. He reprised the role in Twin Peaks: The Return in 2017, appearing again with Richard Beymer, Miguel Ferrer, Ray Wise, and Catherine Coulson. Also in 1990, Struycken appeared along with Joel Swetow in the HBO movie Framed. He then had a supporting role in the horror film Servants of Twilight, which starred Bruce Greenwood and Mimi Craven.\n\nWhile Struycken is famous for playing Lurch in the film version of The Addams Family, Original Series guest actor Ted Cassidy is famous for originating the role on the classic 1960s TV show.\n\nStruycken was the only actor from the first two Addams Family films (with the exception of Christopher Hart's hand playing the role of Thing) to reprise his role in the 1998 direct-to-video sequel Addams Family Reunion. Struycken's co-stars in this film included Ed Begley, Jr. as well as Ray Walston, Leigh Taylor-Young, and Clint Howard.",
    "Image": "https://images.prismic.io/star-trek-untold/ZTVmZWY3MDAtZmE0Yy00YzQzLTk0YTgtMjU1ODMzODJhYmQ2_2050e03ca119580f74cca14cc6e97462.jpg?auto=compress,format&rect=0,0,620,260&w=620&h=260"
  },
  {
    "Actor Name": "Casey Biggs",
    "Star Trek Roles": "1996-1999 - Damar - ST:DS9\n2004 - Illyrian Captain - ST:ENT S3:E19 (Damage)",
    "Mini Bio": "Casey Patrick Biggs (born 4 April 1955; age 69) is an actor best known for his portrayal of Damar on Star Trek: Deep Space Nine as well as several other roles. He is the ex-husband of Roxann Dawson.\n\nCasey Biggs was interviewed in the 2005-released docu-comedy Trekkies 2 and for the Deep Space Nine documentary What We Left Behind.\n\nHe is a member of the Enterprise Blues Band, which writes and performs songs about Star Trek. The other members are Vaughn Armstrong, Richard Herd, Steve Rankin, William Jones, and Ronald B. Moore. Biggs plays the rhythm guitar, and sings some of the back-up vocals.\n\nBiggs once guest-starred in Live Shot. Other Star Trek stars who were cast members include David Birney, Karen Austin, Ron Canada, Jeff Yagher, Bruce McGill, and Sam Anderson. Star Trek stars who also guest-starred include Chase Masterson, Dion Anderson, John Schuck, Lee Arenberg, Hal Landon, Jr., Cully Fredricksen, and Kenneth Tigar.\n\nBiggs also guest starred in The X-Files, Medium, The Good Wife, Elementary and Person of Interest. Biggs also appeared in The Pelican Brief (1993), Broken Arrow (1996), Shadow Conspiracy (1997), Auggie Rose (2001), and Dragonfly (2002).",
    "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS5bu8e5OjW7-waogwcR7lLcTE5PzNOO90zzAj188V9vyTrRXuNNpq1OvHiwBGblsRKaAQ&usqp=CAU"
  },
  {
    "Actor Name": "Charles Cooper",
    "Star Trek Roles": "1989 - Korrd - Star Trek V: The Final Frontier\n1990 - K'mpec - STTNG S4:E7 (Reunion)\n1990 - K'mpec - STTNG S4:E17 (Sins of the Father)",
    "Mini Bio": "Charles Darwin Cooper (11 August 1926 – 29 November 2013; age 87) was the actor who portrayed Korrd in Star Trek V: The Final Frontier. He also portrayed K'mpec in the Star Trek: The Next Generation third and fourth season episodes \"Sins of The Father\" and \"Reunion\".\n\nBorn in San Francisco, California, USA, Cooper made his first acting experiences at the age of fifteen in a San Francisco stage production of \"Hamlet\". Cooper enjoyed the recurring role of Judge Robert Boucher on the legal drama The Practice appearing in \"Part IV\" along with Miriam Flynn, Richard McGonagle, and Natalia Nogulich, \"Dog Bite\" with Nogulich as well as Willie Garson, \"Hide & Seek\" with Earl Billings, Jack Blessing, and Titus Welliver, and \"The Civil Right\" with Googy Gress and Mitchell Ryan, all in 1997.\n\nCooper passed away on 29 November 2013, at the age of 87.",
    "Image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjW_fQoe64YoKa3S7EQwU8EIsLL16CmkZ635yGxceanZ8mbLKVn00bguMSJgqa6QRxIrTbOlUDfyI65Wmv93F2qmlr5dr39GohM1oc6UZ1NF655WfZ7HT0uvSCBYnBS87yTHSWe/s1600/charles-cooper_korrd.jpg"
  },
  {
    "Actor Name": "Charles Lucia",
    "Star Trek Roles": "1992 - Ambassador Ves Alkar - STTNG S6:E3 (Man of the People)\n1996 - Mabus - ST:VOY S2:E14 (Alliances)\n2001 - Captain Keene - ST:ENT S1:E10 (Fortunate Son)",
    "Mini Bio": "Charles Lucia (born 3 January 1946; age 78), also credited as Chip Lucia and Charles O. Lucia, is an actor who appeared in episodes of Star Trek: The Next Generation, Star Trek: Voyager, and Star Trek: Enterprise.\nLucia's film credits include the 1992 biopic Her Final Fury: Betty Broderick, The Last Chapter with Stephen Collins, J. Downing, Clayton Landey, Richard McGonagle, Margot Rose, Stephen Root, and Jandi Swanson, and Tank Girl (1995, starring Lori Petty and Malcolm McDowell, with Reg E. Cathey, Iggy Pop, Ann Magnuson, Doug Jones, Ann Cusack, and Jeff Kober).\n\nFollowing his appearances in \"Fortunate Son\", an episode of The District (2001, with Roger Aaron Brown), and the short film Cinema/Vérité (2001, with Todd Babcock), Lucia retired from acting. Today, he lives in Youngsville, Pennsylvania.",
    "Image": "https://image.tmdb.org/t/p/w500/jwNxR4sVWzSkpQPRngXvW0CHJnv.jpg"
  },
  {
    "Actor Name": "Clint Howard",
    "Star Trek Roles": "1966 - Balok - ST:TOS S1:E10 (The Corbomite Maneuver)\n1995 - Grady - ST:DS9 S3:E12 (Past Tense: Part 2)\n2002 - Muk - ST:ENT S1:E19 (Acquisition)\n2002 - Muk - Star Trek: Enterprise S1:E19 (Acquisition)\n2018 - Orion - Star Trek: Discovery S1:E15 (Will You Take My Hand)\n2023 - Buckley - Star Trek: SNW S2:E8 (Under the Cloak of War)",
    "Mini Bio": "Clint Howard (born 20 April 1959; age 65) is an actor who played Balok in the Star Trek: The Original Series first season episode \"The Corbomite Maneuver\", Grady in the Star Trek: Deep Space Nine third season episode \"Past Tense, Part II\", Muk in the Star Trek: Enterprise first season episode \"Acquisition\", a Creepy Orion in the Star Trek: Discovery first season episode \"Will You Take My Hand?\" and Buck Martinez in Star Trek: Strange New Worlds second season episode \"Under the Cloak of War\".\n\nHe filmed his scenes as Balok for \"The Corbomite Maneuver\" on Wednesday 1 June 1966 at Desilu Stage 9. He also filmed a makeup test the previous day. \n\nAlong with Majel Barrett, Joseph Ruskin, Jack Donner and Vince Deadrick, he is one of only five actors to appear in both The Original Series and Enterprise. He, Barrett, and Ruskin also appeared in Deep Space Nine. He is the only performer to date who appeared in both The Original Series and Discovery or Strange New Worlds (excluding performers who appeared in archive footage).\n\nOn Comedy Central's 2006 roast of William Shatner, Howard reprised his role as Balok in an older, grown-up form addicted to tranya.\n\nHoward holds the record for longest period between first and most recent appearances on Star Trek, of 20713 days, or just under 57 years, reclaiming the record from Walter Koenig who played the voice only role of Anton Chekov in Star Trek:",
    "Image": "https://static1.cbrimages.com/wordpress/wp-content/uploads/2021/08/Clint-Howard-as-Grady-in-Star-Trek-Deep-Space-Nine.jpg"
  },
  {
    "Actor Name": "Cyia Batten",
    "Star Trek Roles": "1995 - Ziyal - ST:DS9 S4:E4 (Indiscretion)\n1996 - Ziyal - ST:DS9 S4:E13 (Return to Grace)\n2000 - Irina - ST:VOY S7:E3 (Drive)\n2005 - Navaar - ST:ENT S4:E17 (Bound)",
    "Mini Bio": "Cyia Batten (born 26 January 1972; age 52) is an actress and dancer who played Tora Ziyal in the Star Trek: Deep Space Nine fourth season episodes \"Indiscretion\" and \"Return to Grace\", Irina in the Star Trek: Voyager seventh season episode \"Drive\" and Navaar in the Star Trek: Enterprise fourth season episode \"Bound\".\nBatten made her acting debut in Red Shoe Diaries in the episode \"Tears\" (1995) with Carolyn Seymour. That year also found Batten in W.E.I.R.D. World with Scott Nimerfro, Gina Ravarra and Clayton Rohner. Batten was then in the telefilms Marshall Law (1996, with Geoffrey Blake) and Sins of the Mind (1997, with Louise Fletcher and Robert Pine). In 1998 she was featured in Senseless, with Jenette Goldstein, Richard McGonagle, Greg Grunberg, Alexander Enberg, Manu Intiraymi, Ivar Brogger, Brad Dourif, Jack Shearer, Len Costanza, John Wilkie, Janet Dey, Rubin Knight, Andray Johnson, and Bruce Dobos. Batten's next film was Black & White (1999, with Seymour Cassel, Kamala Lopez-Dawson, and Boris Krutonog).\n\nIn the 2000s, Batten appeared in Bubble Boy (2001, with Brian George and John Carroll Lynch), The Sweetest Thing (2002, with Loren Lester), American Crime (2004, with Wade Andrew Williams), The Texas Chainsaw Massacre: The Beginning (2006, with Tim de Zarn and John Larroquette), Charlie Wilson's War (2007, with Ron Fassler, Spencer Garrett, Pasha Lychnikoff, Brian Markinson and J. Patrick McCormack). Batten finished 2007 with the telefilm Suspect with Star Trek: Enterprise actor John Billingsley.\n\nBatten has made guest appearances on CSI: Crime Scene Investigation (2003, with Paul Guilfoyle and Wallace Langham) CSI: NY (2005 with Marco Sanchez, Irene Tsu as well as an uncredited Morgan H. Margolis), and CSI: Miami (2006, with Mark Rolston and Michael Buchman Silver).\n\nBatten is also an original member of the burlesque singing group the Pussycat Dolls.",
    "Image": "https://images.squarespace-cdn.com/content/v1/5cc3d1b051f4d40415789cc2/2e7bc54c-1d23-4336-ace2-408fa3ab527b/cyia-batten-tracy-middendorf-ziyal-navaar-irina.png"
  },
  {
    "Actor Name": "David Birkin",
    "Star Trek Roles": "1990 - René Picard - STTNG S4:E2 (Family)\n1992 - Young Jean-Luc Picard - STTNG S6:E7 (Rascals)",
    "Mini Bio": "David Tristan Birkin (born 21 November 1977; age 46) is a British actor and artist who portrayed René Picard in the Star Trek: The Next Generation fourth season episode \"Family\". Two years later he appeared as a younger version of Jean-Luc Picard in the sixth season episode \"Rascals\".\nWith the exception of his Star Trek appearances, he has appeared primarily in UK productions. In 1998, he played the role of Courfeyrac in the motion picture adaptation of Les Misérables. His other film credits include the 1989 adventure The Return of the Musketeers (with Kim Cattrall), the 1991 romantic comedy Impromptu, the 2001 war drama Charlotte Gray and the 2003 biopic Sylvia.\n\nHe was later featured in an episode of Identity (2010) and in the drama Men Don't Lie (2011).\n\nBirkin is the son of screenwriter Andrew Birkin (Omen III, The Name of the Rose) and nephew of actress and singer Jane Birkin.",
    "Image": "https://www.caricatures-ireland.com/blog/wp-content/uploads/2019/01/Jean-Luc_Picard-_age_12.jpg"
  },
  {
    "Actor Name": "David Graf",
    "Star Trek Roles": "1995 - Fred Noonan - ST:VOY S2:E1 (The 37's)\n1997 - Leskit - ST:DS9 S5:E21 (Soldiers of the Empire)",
    "Mini Bio": "David Graf (16 April 1950 – 7 April 2001; age 50) was an American actor who guest-starred as Fred Noonan in the Star Trek: Voyager second season episode \"The 37's\" and Leskit in the Star Trek: Deep Space Nine fifth season episode \"Soldiers of the Empire\". His widow, Kathryn Graf, guest-starred in the Deep Space Nine first season episode \"A Man Alone\". Prior to his appearance in Voyager, Graf guest-starred in a series called Voyagers! (VOY Season 2 DVD, \"The 37's\" text commentary)\nIn addition to his episodic appearances, Graf also did voice work on several Trek video games, including Star Trek: Voyager - Elite Force and Star Trek: Away Team.\n\nHe is best remembered for his role as Officer (and later Sergeant) Eugene Tackleberry in all seven of the Police Academy movies from 1984 through 1994. He also played the character on the short-lived 1997-98 series inspired by the films. One of these films, 1988's Police Academy 5: Assignment: Miami Beach, also featured his wife, Kathryn, as well as Deep Space Nine star René Auberjonois and Star Trek: The Next Generation guest star Matt McCoy. In fact, all the other Police Academy films featured fellow Trek alumni: the first film (1984) had Kim Cattrall, Steve Guttenberg, and Scott Thomson; Police Academy 2: Their First Assignment (1985) had Arthur Batanides, who also appeared in the fourth and sixth films; Scott Thomson, Steve Guttenberg, and Brian Tochi appeared in Police Academy 3: Back in Training (1986) and also appeared in Police Academy 4: Citizens on Patrol (1987); Police Academy 6: City Under Siege (1989) featured Gerrit Graham, Darryl Henriques, Kenneth Mars, Matt McCoy, Beans Morocco, and Angelo Tiffe; and Ron Perlman co-starred in Police Academy: Mission to Moscow (1994).",
    "Image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjlynkemp7Vvn36VTdcQ33WoS4QAcc-DLu5ELNR6RWxekx4TOdQ0kgIH0SieP6GphQV9nP26S1BvlHYiA0UkN9mKsPGD89pwH53mzgZj2InIT_GY8iy-wKhuUFxTqRKR3f5DYAedl7bkgM/s1600/DG01.jpg"
  },
  {
    "Actor Name": "David Warner",
    "Star Trek Roles": "1992 - Gul Madred - STTNG S6:E10 & 11 (Chain of Command)\n1991 - Chancellor Gorkon - Star Trek VI: The Undiscovered Country\n1989 - Ambassador St. John Talbot - Star Trek V: The Final Frontier",
    "Mini Bio": "David Warner (29 July 1941 – 24 July 2022; age 80) was an English actor who played St. John Talbot in Star Trek V: The Final Frontier, Gorkon in Star Trek VI: The Undiscovered Country, and Madred in the Star Trek: The Next Generation sixth season episodes \"Chain Of Command, Part I\" and \"Chain Of Command, Part II\". He reprised the role of Gorkon for the video game Star Trek: Klingon Academy.\nWarner took over the role of Madred on three days notice and, though he had previously appeared in Star Trek V: The Final Frontier and Star Trek VI: The Undiscovered Country, he knew nothing about the Cardassians from The Next Generation. As he recalled in a 2011 interview; \"I took over on three days' notice. It was another makeup job. It was with Pat Stewart, who's an old colleague. It was great to be a part of that. I thought, \"Oh, I've done two of the others, the old classic ones, and here I am in The Next Generation. I'll go for it.\" So I wasn't aware of it, of the Cardassians. I didn't know their history at all, except of course, that they weren't very nice.\" Due to the short time in which he had to prepare, Warner also did not have enough time to memorize his lines. As such, they were written down on cue cards. As he commented; \"There was too much technobabble and dialogue that doesn't come naturally to me. So they wrote everything up for me. I don't mind people knowing this. Every line I said, I actually was reading it over Patrick's shoulder or they put it down there for me to do it.\" \n\nWarner was also approached by the Star Trek: Deep Space Nine production staff for the role of Akorem Laan in \"Accession\". Ira Steven Behr commented, \"Personally, I wanted David Warner as Akorem. He wanted to do it, but his wife talked him out of it because he was on vacation and she didn't want him to work. To this day I still wish David Warner was in it.\" (Captains' Logs Supplemental - The Unauthorized Guide to the New Trek Voyages [page number? • edit])",
    "Image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2020/08/St-John-Talbot-Star-Trek-V.jpg"
  },
  {
    "Actor Name": "Dennis Christopher",
    "Star Trek Roles": "1994 - Borath - ST:DS9 S3:E2 (The Search: Part 2)\n2002 - Danik - ST:ENT S1:E21 (Detained)",
    "Mini Bio": "Dennis Christopher (born 2 December 1955; age 68) played Borath in the Star Trek: Deep Space Nine third season episode \"The Search, Part II\" and Danik in the Star Trek: Enterprise first season episode \"Detained\".\nChristopher rose to prominence with his starring role in the 1979 coming-of-age drama Breaking Away, for which he won a BAFTA Award for most promising newcomer and was nominated for a Golden Globe. Paul Dooley played his character's father in this film. He also appeared as Dooley's son in an episode of Law & Order: Criminal Intent. In 1981, Christopher played American athlete Charlie Paddock in Chariots of Fire, which starred Ben Cross and Alice Krige.\n\nOn television, he had recurring roles on Angel (as the evil wizard Cyvus Vail) and Profiler (as the \"Jack of All Trades\"), and guest appearances on series such as NYPD Blue, Six Feet Under, and Roswell.\n\nIn the Profiler series, his character's mother, Miriam Newquay, was played by Louise Fletcher. Furthermore, Dennis Christopher played Dr. Martin Ruper in the Sci-Fi Channel's The Lost Room in 2006. He also portrayed Eddie Kaspbrak in the 1990 adaptation of Stephen King's It.\n\nBetween 2000 and 2001, Christopher portrayed Vince Elsing in FreakyLinks where he worked with Ron Canada, Patrick Fabian, Daniel Roebuck, Ryan Bollman, John Billingsley, Connor Trinneer, Leslie Jordan, Brooke Benko, Dawn Stern, Art Chudabala, Steve Vinovich, Faran Tahir, Aaron Lustig, Scott Lincoln, Mirron E. Willis, and Tom McCleister.\n\nIn the 1980s, he guest-starred on The Equalizer as Father Nicholas Kostmayer, a Catholic priest and younger brother of series recurring character Mickey Kostmayer, played by Keith Szarabajka. In 2012, he appeared in the Quentin Tarantino film Django Unchained as Leonide Moguy.",
    "Image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2024/08/instar50029295.jpg"
  },
  {
    "Actor Name": "Diana Muldaur",
    "Star Trek Roles": "1968 - Ann Mulhall - ST:TOS S2:E20 (Return to Tomorrow)\n1968 - Dr. Miranda Jones - ST:TOS S3:E5 (Is There in Truth No Beauty?)\n1988-1989 - Doctor Katherine Pulaski - ST:TNG",
    "Mini Bio": "Diana Muldaur (born 19 August 1938; age 86) is an actress, best known to Star Trek fans for her portrayal of Doctor Katherine Pulaski during the second season of Star Trek: The Next Generation. She appeared in all but two episodes of the season: \"The Outrageous Okona\" and \"Q Who\".\nMuldaur had previously appeared in two episodes of Star Trek: The Original Series (\"Return to Tomorrow\" and \"Is There in Truth No Beauty?\"), playing two different characters who also held the title of \"Doctor.\" Muldaur filmed her scenes for \"Return to Tomorrow\" between Monday 20 November 1967 and Tuesday 28 November 1967 at Desilu Stage 9 and Stage 10, and her scenes for \"Is There in Truth No Beauty?\" between Tuesday 16 July 1968 and Wednesday 24 July 1968 at Stage 9 and Stage 8.\n\nIn 1988, Muldaur was cast as Dr. Pulaski for the second season of The Next Generation as a replacement for Gates McFadden, the actress who played Beverly Crusher in the first season. McFadden had some sort of falling out with the show's producers, especially Maurice Hurley, and left (or was asked to leave) the show, and Muldaur was brought on board. However, following the end of the second season, the issues with McFadden were resolved and she returned to the series. Muldaur's last appearance as Dr. Pulaski was \"Shades of Gray\", the final episode of the second season. On 20 September 1988 Muldaur was interviewed and these interviews were later published on the TNG Season 2 DVD in the special features \"Mission Overview Year Two\" (\"Diana Muldaur\", \"Gene Roddenberry\") and \"Selected Crew Analysis Year Two\". In these interviews Muldaur told that she had moved into the high desert Sierra Nevada with her husband in 1988 when she got a call to work on The Next Generation and couldn't resist.\n\nAmong the props and costumes auctioned off on the It's A Wrap! sale and auction on eBay were a face mold and her costume from the episode \"Unnatural Selection\".",
    "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR0_0k3KobrW8zCZ4aArYJBzXn6N2EW2BMGuQ&s"
  },
  {
    "Actor Name": "Eric Pierpoint",
    "Star Trek Roles": "1993 - Voval - STTNG S7:E2 (Liaisons)\n1997 - Captain Sanders - ST:DS9 S5:E13 (For the Uniform)\n1999 - Kortar - ST:VOY S6:E3 (Barge of the Dead)\n2002 - Shiraht - ST:ENT S1:E18 (Rogue Planet)\n2005 - Harris - ST:ENT S4:E15 (Affliction)\n2005 - Harris - ST:ENT S4:E16 (Divergence)\n2005 - Harris - ST:ENT S4:E20 (Demons)\n2005 - Harris - ST:ENT S4:E21 (Terra Prime)",
    "Mini Bio": "Eric Pierpoint (born 18 November 1950; age 73) is an actor and author who had guest roles in the first four Star Trek spin-off television series Star Trek: The Next Generation, Star Trek: Deep Space Nine, Star Trek: Voyager and Star Trek: Enterprise. He is probably best known for his role as Detective George Francisco in Alien Nation (1989-1990) and its five spin-off television movies (1994-1997). He took over the role from Mandy Patinkin and starred with fellow Trek performers Gary Graham, Michele Scarabelli, and Ron Fassler.\n\nPierpoint was one of several future Star Trek actors who read for the role of William T. Riker, as well as for the lead roles on Deep Space Nine and Voyager, before it was decided to make those characters African-American and a woman, respectively. (citation needed • edit)\n\nOutside of Star Trek, he has appeared on Babylon 5, alongside Star Trek guest stars such as Andreas Katsulas and Patricia Tallman. He had a guest-starring role as US President Jefferson Williams on the fifth season of Sliders (starring Jerry O'Connell). Pierpoint also appeared in Liar Liar (1997, with Anne Haney, Mitchell Ryan, and Chip Mayer). Pierpoint has landed guest roles on CSI: Miami (with Jennifer Gatti) and on CSI: Crime Scene Investigation (starring Paul Guilfoyle, Wallace Langham and Liz Vassey, with Joseph Campanella).",
    "Image": "https://ntvb.tmsimg.com/assets/assets/19845_v9_bb.jpg"
  },
  {
    "Actor Name": "Erick Avari",
    "Star Trek Roles": "1991 - B'iJik - STTNG S5:E7 (Unification I)\n1995 - Vedek Yarka - ST:DS9 S3:E15 (Destiny)\n2001 - Jamin - ST:ENT S1:E6 (Terra Nova)",
    "Mini Bio": "Erick Avari (born 13 April 1952; age 72) is an actor who appeared as B'iJik in the Star Trek: The Next Generation fifth season episode \"Unification I\", Yarka in the Star Trek: Deep Space Nine third season episode \"Destiny\", and Jamin in the Star Trek: Enterprise first season episode \"Terra Nova\".\nAvari is probably known for his supporting roles in Independence Day (1996, with Brent Spiner), The Mummy (1999, with Oded Fehr), The 13th Warrior (1999, with Neil Maffin), Planet of the Apes (2001, with Cary-Hiroyuki, David Warner, Michael Clarke Duncan, Freda Foh Shen, Anne Elizabeth Ramsay, Michael Jace, Eileen Weisinger, Deep Roy, and Kevin Grevioux), Daredevil (2003, with Michael Clarke Duncan, Leland Orser, and Stan Lee). He also voiced Master Rahool in the video games Destiny (2014) and Destiny 2 (2017).\n\nHe is best known for the role of Kasuf in Stargate (1994, with Leon Rippy and Derek Webster) and reprised this role for three episodes of Stargate SG-1 (1998, 1999, and 2001, with Michael Shanks and Anthony Montgomery). He also played Mohinder's father Dr. Chandra Suresh in four episodes of the superhero series Heroes (2006, with Greg Grunberg, Cristine Rose, Tina Lifford, Thomas Dekker, Zachary Quinto, and Josh Clark).\n\nBorn as Nariman Eruch Avari in Darjeeling, West Bengal, India, he attended the North Point School in Darjeeling and later the College of Charleston in Charleston, South Carolina.",
    "Image": "https://ntvb.tmsimg.com/assets/assets/70392_v9_bc.jpg?w=270&h=360"
  },
  {
    "Actor Name": "Ethan Phillips",
    "Star Trek Roles": "1990 - Dr. Farek - STTNG S3:E24 (Ménage à Troi)\n1996 - Holodeck Nightclub Maitre d' - Star Trek: First Contact\n1995-2001 - Neelix - ST:VOY\n2002 - Ulis - ST:ENT S1:E19 (Acquisition)",
    "Mini Bio": "Ethan Phillips (born 8 February 1955; age 69) is the actor best known to Star Trek fans for playing the part of Neelix through all seven seasons of Star Trek: Voyager. He also played two different Ferengi characters, one on Star Trek: The Next Generation and another on Star Trek: Enterprise, and made an uncredited cameo as a holographic mâitre d' in Star Trek: First Contact.\n\nPhillips was born and raised in Long Island, New York. Phillips graduated with a degree in English Literature from Boston University and a Masters Degree in Fine Arts from Cornell University. He began his on-screen acting career playing Pete John Downey on the hit television series Benson. Although the series began airing in 1979, Phillips did not join the series until the following year. Also joining the series in that year was René Auberjonois.\n\nPhillips and Auberjonois co-starred together on Benson until 1985, when Phillips left the series. While still acting on the show, Phillips made his feature film debut with a small role in the acclaimed 1981 drama Ragtime. Starring in this film was Phillips' future Voyager co-star Brad Dourif (Lon Suder). Robert Joy also had a supporting role in the film.\n\nAfter leaving Benson, Phillips began to make a major transition towards films. He had a supporting role in Critters (1986, with Scott Grimes, and the following year, he appeared in Burglar, starring Whoopi Goldberg. He appeared in three films in 1989: Lean on Me (also featuring Tony Todd and Mike Starr), Bloodhounds of Broadway (co-starring Googy Gress, Stephen McHattie and Alan Ruck), and Glory (with Bob Gunton, Cliff DeYoung, Richard Riehle, and Mark Margolis).\n\nPhillips continued to appear on television, however. In 1987, he co-starred with Lance LeGault and Raphael Sbarge in the pilot episode of the short-lived series Werewolf. He also appeared on a number of other TV shows throughout the late 1980s, including an episode of The Twilight Zone with Christopher Carroll.",
    "Image": "https://www.timeshifterspodcast.com/interviews/wp-content/uploads/2016/07/wateropen16.jpg"
  },
  {
    "Actor Name": "F. J. Rio",
    "Star Trek Roles": "1995 - Muñiz - ST:DS9 S4:E6 (Starship Down)\n1996 - Muñiz - ST:DS9 S4:E18 (Hard Time)\n1996 - Muñiz - ST:DS9 S5:E2 (The Ship)\n2001 - Joleg - ST:VOY S7:E13 (Repentance)\n2003 - Vissian Chief Engineer - ST:ENT S2:E22 (Cogenitor)",
    "Mini Bio": "F.J. Rio is the actor who appeared as Enrique Muniz in the Star Trek: Deep Space Nine fourth and fifth season episodes \"Starship Down\", \"Hard Time\" and \"The Ship\". He later played Joleg in the Star Trek: Voyager seventh season episode \"Repentance\" and a Vissian engineer in the Star Trek: Enterprise second season episode \"Cogenitor\".\nRio has also played Cruz Pezuela in The Shield and Alex Diaz in Beverly Hills, 90210. Rio also guest-starred in Seinfeld, The X-Files, NYPD Blue, Prison Break, 24, and Southland.",
    "Image": "https://static.tvmaze.com/uploads/images/medium_portrait/168/421020.jpg"
  },
  {
    "Actor Name": "Fionnula Flanagan",
    "Star Trek Roles": "1993 - Enina Tandro - ST:DS9 S1:E7 (Dax)\n1993 - Dr. Juliana Tainer - STTNG S7:E10 (Inheritance)\n2002 - Vulcan Ambassador V'Lar - ST:ENT S1:E23 (Fallen Hero)",
    "Mini Bio": "Fionnula Flanagan (born 10 December 1941; age 82) is an Irish actress who appeared as Juliana Tainer in the Star Trek: The Next Generation seventh season episode \"Inheritance\", Enina Tandro in the Star Trek: Deep Space Nine first season episode \"Dax\" and V'Lar in the Star Trek: Enterprise first season episode \"Fallen Hero\". A costume worn by her in \"Inheritance\" was sold off on the It's A Wrap! sale and auction on eBay. (X)\n\nFlanagan was born Fionnghuala Manon Flanagan in Dublin, Ireland, and trained at Dublin's Abbey Theatre. Her most notable work is the tour de force \"James Joyce's Women\", in which she played six different roles. On TV, her most notable work was How the West was won, where she played Molly Cullhane for 12 episodes and was nominated for the Primetime Emmy Award as Outstanding Lead Actress in a Drama Series. This show also featured Ed Lauter, Harris Yulin, Richard Kiley, Ricardo Montalban and, for one episode, William Shatner.\n\nOther notable roles include Catarine in Caravan of Courage: An Ewok Adventure (1984). Film audiences may also remember her appearance as the housekeeper Mrs. Mills in the 2001 thriller The Others, or for her prominent role in John Singleton's Four Brothers. She also played a recurring role as Eloise Hawking in seasons three, five and six of Lost, with Daniel Dae Kim, Terry O'Quinn, Sam Anderson, and Alan Dale.\n\nOther film work includes the action film White Mile (1994, with Robert Picardo, Jacqueline Kim, Dakin Matthews, Ken Jenkins, Dan Kern, Brian Markinson, Dan Gilvezan, Gina Ravarra, Brett Porter, Ken Thorley, Don McManus and Tom Lupo), the comedy Waking Ned Devine (1998), and Blessed (2004).\n\nMore recently, Flanagan portrayed the recurring role of former mayor Nicolette \"Nicky\" Riordon in eight episodes of the first season of SyFy's Defiance in 2012/2013. Gary Hutzel, David Takemura, and Doug Drexler worked on the visual effects for this series and Allan Kroeker directed Flanagan in one episode. In 2017, she co-starred in the Irish-British miniseries Redwater. In the same year, she appeared in an episode of Bryan Fuller's American Gods, directed by Adam Kane and featuring Chris Obi.",
    "Image": "https://images.prismic.io/star-trek-untold/MWQyY2ZkNTItOGUxYi00YmYzLTgyNmUtNjY5NWIwOGRkNjM2_9f46e5628ee409616e471b361a94c053.jpgitokysmwpjbv?auto=compress,format&rect=0,0,461,390&w=461&h=390"
  },
  {
    "Actor Name": "Frank Corsentino",
    "Star Trek Roles": "1987 - DaiMon Bok - STTNG S1:E8 (The Battle)\n1990 - DaiMon Tog - STTNG S3:E24 (Ménage à Troi)\n2000 - Gegis - ST:YOY S7:E6 (Inside Man)",
    "Mini Bio": "Frank Corsentino (13 July 1941 – 7 January 2007; age 65) was an actor who had three Star Trek appearances to his credit, playing three different Ferengi characters. Among those characters was Bok in the Star Trek: The Next Generation first season episode \"The Battle\". (Bok returned in the seventh season episode \"Bloodlines\", but was played by Lee Arenberg.) His costume from the latter appearance was sold off on the It's A Wrap! sale and auction on eBay and was previously worn by Rob Steiner and Lou Wagner. (X) His face as Bok was later used in the 1995 video game Star Trek: The Next Generation - A Final Unity as the Ferengi character Aramut. He went uncredited in the game, however.\n\nCorsentino was born in San Pedro, California. In the 1970s, Corsentino guest-starred in two episodes of Gunsmoke with Glenn Corbett, with both Corsentino and Corbett playing a different character each time. The first episode, 1971's \"Phoenix\", also guest-starred Mariette Hartley, while the second episode, 1974's \"A Family of Killers\", featured Anthony Caruso.\n\nCorsentino also appeared on such shows as Then Came Bronson (in an episode with Skip Homeier), Ironside (with Joel Grey and Gene Lyons), The Courtship of Eddie's Father (with Alan Oppenheimer), The Odd Couple (starring Garry Walberg), Starsky & Hutch (starring David Soul), The Fantastic Journey (in an episode written by Harold Livingston), Vegas (including an episode with Ian Abercrombie and Gary Lockwood), and Hunter (in an episode with Michael Dorn). His feature film credits include Russ Meyer's Beyond the Valley of the Dolls (with Charles Napier), Simon, King of the Witches (1971, with Andrew Prine), Up Your Alley (with Eli Behar and Anthony Giger), and Moonchild (1974).\n\nActing on television since the 1960s, Corsentino's role as Gegis in the Star Trek: Voyager episode \"Inside Man\" was his last known TV appearance. Corsentino passed away in 2007 in Hawthorne, California.",
    "Image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgwYWhhqY5uPDyjXnocpQh6OTUH4H7oShLXFEI62pPFSzKmvrZbSWzBxr6JrFOHsScaZVT_UyEbMNNMFj1o8B-DroVDRdc9NF2mIn3AqS08CGxuqo4ECwuMKrrxO1Od8Lr369P_rBAFrFc/s1600/tng_bloodlines.jpg"
  },
  {
    "Actor Name": "Gary Graham",
    "Star Trek Roles": "1995 - Tanis - ST:VOY S2:E10 (Cold Fire)\n2001-2005 - Vulcan Ambassador Soval - ST:ENT",
    "Mini Bio": "Gary Graham (6 June 1950 – 22 January 2024; age 73) was the actor who played two roles on Star Trek – the Ocampa Tanis in the Star Trek: Voyager second season episode \"Cold Fire\" and the Vulcan ambassador Soval on all four seasons of Star Trek: Enterprise. A collection of his Soval costumes was sold off on the It's A Wrap! sale and auction on eBay. (X)\n\nGraham was once considered for the roles of both Benjamin Sisko and Captain Janeway before the decision was made for Janeway to be female and for Sisko to be an African-American. (Confirmed by Graham at Sci-Fi Ball 24, 3 February 2018)\n\nBeyond the realm of Star Trek, he is probably best known for playing Det. Matthew Sikes in Alien Nation (1989-1990) and its spin-off television movies (1994-1997), along with Eric Pierpoint, Michele Scarabelli, Ron Fassler, Tiny Ron, Kerrie Keane, and Wayne Péré.\n\nGraham also had a recurring role on M.A.N.T.I.S., three episodes of which were directed by Cliff Bole. \"Gary is a great actor,\" Bole later stated. (The Official Star Trek: Voyager Magazine issue 15)\n\nIn 2007, Graham was set to star alongside John Billingsley in a planned zombie series, entitled Alive, which featured Judith and Garfield Reeves-Stevens, and Denise and Michael Okuda in the creative staff. However, the series was scrapped.\n\nGraham's first feature film role was in the film Lost on Paradise Island (1975, with Jorge Cervera, Jr.). His other film role was with George C. Scott in the 1979 film Hardcore (1979, with Marc Alaimo, Leslie Ackerman, Bibi Besch, Tracey Walter, and Ed Begley, Jr.).\n\nHis feature film roles in the 1980s include The Hollywood Knights (1980, with Charles J. Stewart), All the Right Moves (1983, starring Lea Thompson, with Mel Winkler, Terry O'Quinn, and Dick Miller), The Arrogant (1988). Graham starred in the WWII movie The Last Warrior (1989, with Cary-Hiroyuki).\n\nDuring the 1990s, Graham starred in some other films, including Robot Jox (1990, with Robert Sampson, Jeffrey Combs, Ian Patrick Williams, and Jason Marsden), His other 1990s movies include Man Trouble (1992, with Michael McKean, Saul Rubinek, David Clennon, Raymond Cruz, Ken Thorley, and Rob LaBelle), Necronomicon (1993, with Jeffrey Combs, Richard Lynch, David Warner, and Dennis Christopher), Flight of the Dove (1996), To Die Quietly (1997), Steel (1997, with Charles Napier, Kerrie Keane, Eric Pierpoint, Tim de Zarn, and Rick Worthy), Running Woman (1998, with Andrew Robinson, Anthony Crivello, Faith C. Salie, Mike Gomez, and David L. Crowley).\n\nGraham's 2000s feature films include Siren (2006), Plugged (2007, with Dominic Keating and Ethan Phillips), Star Trek: Of Gods and Men (2007, with Walter Koenig, Alan Ruck, Nichelle Nichols, Garrett Wang, J.G. Hertzler, Tim Russ, Chase Masterson, Ethan Phillips, Cirroc Lofton, William Wellman Jr., Daamen Krall, Crystal Allen, Lawrence Montaigne, James Cawley, John Carrigan, Grace Lee Whitney, Jeffery Quinn, Arlene Martel, Jack Donner, Tania Lemani, Celeste Yarnall, and Amy Ulen), Mistaken Identity (2008, with Jonathan Newkerk), InAlienable (2008, with Walter Koenig, Courtney Peldon, Alan Ruck, Patricia Tallman, Erick Avari, Philip Anthony-Rodriguez, Andrew Koenig, Marina Sirtis, Lisa LoCicero, J.G. Herzler, Richard Herd, Jeff Rector, and Judy Levitt).\n\nIn the 2010s, his feature films include Quantum Quest: A Cassini Odyssey (2010, with Chris Pine, William Shatner, Robert Picardo, Brent Spiner, and Jason Alexander), Dreams Awake (2011), and Action Hero (2012, with Brian Thompson and Ian Patrick Williams).\n\nIn 2014, Graham reprised his role as Soval in the fan-made short film, Prelude to Axanar, which co-starred Trek alums Tony Todd, J.G. Hertzler, Kate Vernon, and Alec Peters. It was intended to be a prequel to the fan film Star Trek: Axanar, which never materialized.\n\nGraham died on 22 January 2024, aged 73.",
    "Image": "https://i0.wp.com/nerdbot.com/wp-content/uploads/2024/01/Soval.jpg?resize=550%2C825&ssl=1"
  },
  {
    "Actor Name": "George Murdock",
    "Star Trek Roles": "1989 - God - Star Trek V: The Final Frontier\n1990 - Admiral J. P. Hanson - STTNG S3:E26 (The Best of Both Worlds: Part 1)\n1990 - Admiral J. P. Hanson - STTNG S4:E1 (The Best of Both Worlds: Part 2)",
    "Mini Bio": "George Murdock (25 June 1930 – 30 April 2012; age 81) was an actor who portrayed \"God\" in Star Trek V: The Final Frontier and J.P. Hanson in the Star Trek: The Next Generation third and fourth season episodes \"The Best of Both Worlds\" and \"The Best of Both Worlds, Part II\".\n\nIn the pre-production of The Final Frontier, director William Shatner had originally planned to cast Murdock for the role of Korrd, but when Charles Cooper read for the role, Murdock was recast for the role of God. Shatner described the scenario as \"a rather strange way of finding the right roles, but it worked out perfectly.\" (Captain's Log: William Shatner's Personal Account of the Making of Star Trek V: The Final Frontier.\n\nMurdock is probably best known by fans for two recurring roles, as Lt. Ben Scanlon, the acerbic Internal Affairs officer on Barney Miller and the overstressed and bitter Dr. Salik on Battlestar Galactica. He was also in an episode of Seinfeld (with Jason Alexander) as a Russian writer Elaine works to get for her publishing house employer.\n\nHe also appeared in Trapper John, M.D. along with Madge Sinclair. Murdock also starred in Timescape (1992, with Lori Lively, Nicholas Guest, Emilia Crow, Time Winters, and Mimi Craven).\n\nMurdock died of cancer at Providence St. Joseph Medical Center in Burbank on 30 April 2012. He was 81.",
    "Image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2021/04/Star-Trek-God.jpg"
  },
  {
    "Actor Name": "Gregg Henry",
    "Star Trek Roles": "1998 - Gallatin - Star Trek: Insurrection\n2003 - Zho'Kaan - ST:ENT S2:E13 (Dawn)",
    "Mini Bio": "Gregg Lee Henry (born 6 May 1952; age 72) is an actor and musician from Lakewood, Colorado, who played Gallatin in Star Trek: Insurrection and Zho'Kaan in the Star Trek: Enterprise second season episode \"Dawn\". He also provided the voice for Gallatin's Ba'ku alter ego, Gal'na, in the video game Star Trek: Hidden Evil.\nHe is perhaps best known for his role as the duplicitous Val Resnick in Payback (1999, co-starring Star Trek: Deep Space Nine guest actor John Glover, David Paymer, Alex Henteloff and Jeff Imada), the director's cut of which featured Sally Kellerman in a voice-only appearance. Henry is also known for his appearances in several films directed by Brian De Palma, most notably Body Double (1984), in which Henry worked opposite Craig Wasson.\n\nHenry appeared on numerous television series, on such programs as Family Law (starring Christopher McDonald and Julie Warner), 24 (with Jude Ciccolella, Raymond Cruz, Alan Dale, Michelle Forbes, and Daniel Dae Kim), and Gilmore Girls. He starred as Hugh Panetta on The Riches (along with Todd Stashwick and Bruce French).\n\nIn addition to his film and television work, Henry continues to work on the stage. He has received 13 Drama Logue Awards, an L.A. Weekly Award, a Los Angeles Drama Critics Circle Award, and two additional LADCC nominations for his stage work. Besides acting, Henry is also a professional singer, songwriter, and pianist. He has released four CDs so far, with a fifth currently in the works.\n\nHenry is married to American Theater Director Lisa James and currently lives in Los Angeles, California. He is also good friends with actor Bruce Greenwood, who appeared in Star Trek and Star Trek Into Darkness. Greenwood and Henry worked together on the NBC made-for-TV movie The Great Pretender (filmed in 1989, aired in 1991). Years later, Greenwood urged Henry to begin recording the songs he was writing. Greenwood has provided vocals on all of Henry's CDs.",
    "Image": "https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/82365_v9_ba.jpg"
  },
  {
    "Actor Name": "Gregory Itzin",
    "Star Trek Roles": "1993 - Ilon Tandro - ST:DS9 S1:E7 (Dax)\n1998 - Hain - ST:DS9 S6:E12 (Who Mourns for Morn?)\n2000 - Dr. Dysek - ST:VOY S7:E5 (Critical Care)\n2002 - Captain Sopek - ST:ENT S1:E15 (Shadows of P'Jem)\n2005 - Admiral Black - ST:ENT S4:E19 (In a Mirror, Darkly: Part 2)",
    "Mini Bio": "Gregory Itzin (20 April 1948 – 8 July 2022; age 74) was an actor who appeared in five episodes spanning three spin-off series of the Star Trek franchise. He was first cast as either Whalen or McNary in the Star Trek: The Next Generation first season episode \"The Big Goodbye\", but dropped out in favor of doing an episode of L.A. Law instead, something he later expressed regret for. \n\nOutside of Trek, he may have been best known for his Emmy Award-nominated role as Vice President (and later President) Charles Logan on 24. His co-stars on this series included fellow Trek veterans Jude Ciccolella, Glenn Morshower, Roger Cross, Peter Weller, Ray Wise, Tzi Ma, Daniel Dae Kim, Tony Todd, Raphael Sbarge, John Berg, and Tom Wright. He once again popped up on the show for its sixth season in 2007, during which time James Cromwell, Maury Sterling, and Itzin's Star Trek: Deep Space Nine co-star Alexander Siddig were also members of the cast.\n\nHe also earned a Tony Award nomination for his role in the 1993 Broadway play The Kentucky Cycle, during which he acted alongside fellow Trek actors Scott MacDonald and Randy Oglesby.\n\nIn 2010, he starred in the audio drama The Physicists, produced by LA Theatreworks, co-starring Harry Groener, John de Lancie and Bruce Davison.\n\nHis friend and 24 producer Jon Cassar reported that Itzin had died on July 8, 2022.  Itzin's manager later confirmed that he had passed away due to complications that arose from emergency surgery.",
    "Image": "https://images.squarespace-cdn.com/content/v1/5cc3d1b051f4d40415789cc2/9f095791-42a1-4010-8115-2f07fee409de/gregory-itzin-ilon-tandro.png"
  },
  {
    "Actor Name": "Gwynyth Walsh",
    "Star Trek Roles": "1991 - B'Etor - STTNG S4:E26 (Redemption)\n1991 - B'Etor - STTNG S5:E1 (Redemption II)\n1993 - B'Etor - ST:DS9 S1:E2 (Past Prologue)\n1994 - B'Etor - STTNG S7:E21 (Firstborn)\n1994 - B'Etor - Star Trek: Generations\n1997 - Chief Examiner Nimira - ST:VOY S4:E10 (Random Thoughts)",
    "Mini Bio": "Gwynyth Walsh (born 7 November 1956; age 67) is the actress who played B'Etor in three episodes of Star Trek: The Next Generation, an episode of Star Trek: Deep Space Nine, and Star Trek Generations, and Chief Examiner Nimira in the Star Trek: Voyager fourth season episode \"Random Thoughts\".\nIn 1998, Walsh provided her voice for B'Etor in the video game Star Trek: The Next Generation - Klingon Honor Guard.\n\nWalsh filmed her first Star Trek episode \"Redemption\" on Monday 15 April 1991 and Thursday 18 April 1991 on Paramount Stage 16. For the episode \"Redemption II\", Walsh filmed her scenes on Monday 15 July 1991 and Wednesday 17 July 1991 on Paramount Stage 9 and 16. For \"Random Thoughts\", she filmed her scenes between Thursday 28 August 1997 and Thursday 4 September 1997 on Paramount Stage 8, 9, and 16.\n\nShe was interviewed by Ian Spelling for the Star Trek Generations - Official Movie Souvenir Magazine for the article \"Barbara March & Gwynyth Walsh: Lursa and B'Etor\", p. 72 in 1994 and for the Star Trek: Communicator issue 104, pp. 50-52, October 1995, article \"The Klingon Way: B'Etor\". Walsh was also interviewed by David Bassom for the article \"Forbidden Thoughts\" in Star Trek Monthly issue 41, pp. 62-63, in 1998 and by Ian Spelling for the articles \"Double Trouble\" in Star Trek Monthly issue 36 in 1998 and \"B'Etor the Devil You Know\" in Star Trek Monthly issue 73 in 2000.\n\nFollowing her appearance in Generations, Walsh appeared on several trading cards, book marks, posters, and standups for display.    In 1994 there was also an action figure of her character from the movie, released by Playmates Toys.  Her costume from Generations was sold at the Christie's auction in New York. (X)\n\nTogether with her on-screen sister and fellow Canadian Barbara March, Walsh is a frequent guest at Star Trek related conventions such as Trek Expo 2008 and the Creation Las Vegas Star Trek Conventions 2010 and 2011, also appearing in Klingon makeup and costume.",
    "Image": "https://static.next-episode.net/actor-images/actors/61/gwynyth-walsh.jpg"
  },
  {
    "Actor Name": "Henry Darrow",
    "Star Trek Roles": "1988 - Admiral Savar - STTNG S1:E24 (Conspiracy)\n1995 - Kolopak - ST:VOY S2:E9 (Tattoo)\n1996 - Kolopak - ST:VOY S2:E26 (Basics: Part 1)",
    "Mini Bio": "Henry Darrow (15 September 1933 – 14 March 2021; age 87) was the actor who played Savar in the Star Trek: The Next Generation first season episode \"Conspiracy\" and Kolopak in the Star Trek: Voyager second season episodes \"Tattoo\" and \"Basics, Part I\".\n\nDarrow is known for his performance as Manolito Montoya in The High Chaparral, where in a 1970 episode, \"Journal of Death,\" he was alongside Morgan Woodward and John Colicos. He is also known for his role as Don Alejandro de la Vega in the 1990s series Zorro, alongside Duncan Regehr and J.G. Hertzler.\n\nDarrow appeared as the Chief of Police of 2193 Washington D.C. in the first two episodes of Time Trax, appearing in the latter episode with Jerry Hardin.",
    "Image": "https://moviedude.co.uk/Henry%20Darrow%20%20'Kojak'%20(1974)%201.17.jpg"
  },
  {
    "Actor Name": "Hilary Shepard",
    "Star Trek Roles": "1996 - Hoya - ST:DS9 S5:E2 (The Ship)\n1997 - Lauren - ST:DS9 S6:E9 (Statistical Probabilities)\n1998 - Lauren - ST:DS9 S7:E5 (Chrysalis)",
    "Mini Bio": "Hilary Shepard Turner (born 10 December 1959; age 64) played Hoya in the Star Trek: Deep Space Nine fifth season episode \"The Ship\" (credited as Hilary Shepard), and later played Lauren in the sixth and seventh season episodes \"Statistical Probabilities\" (credited as Hilary Shepard-Turner) and \"Chrysalis\".\nShepard Turner appeared in the film The 40-Year-Old Virgin, and has co-developed the board game Liebrary for SimplyFun Games with fellow actress Daryl Hannah.\n\nShe is also known for playing Divatox, the villain from Power Rangers Turbo and made guest appearances as the same character in Power Rangers in Space. She appeared in the 1990 film Peacemaker, featuring a brief appearance by Bert Remsen.",
    "Image": "https://cm-live-media.s3.amazonaws.com/5a6f1f7e72bcca0024fc2bd4/9ac0af42-6f3e-4b7d-a8f2-69420bfcebd6.jpeg"
  },
  {
    "Actor Name": "Ian Abercrombie",
    "Star Trek Roles": "1999 - Abbot - ST:VOY S5:E22 (Someone to Watch Over Me)\n2000 - Milo - ST:VOY S6:E17 (Spirit Folk)",
    "Mini Bio": "Ian Abercrombie (11 September 1934 – 26 January 2012; age 77) was a British actor who played the Abbot in the Star Trek: Voyager fifth season episode \"Someone to Watch Over Me\" and Milo in the sixth season episode \"Spirit Folk\". He also did an ADR voiceover for Jeremy Kemp (Robert Picard) in the Star Trek: The Next Generation fourth season episode \"Family\".\n\nAbercrombie had many roles in both film and television, but was probably best known as Mr. Pitt in Seinfeld, which co-starred Jason Alexander.\n\nHe played butler Alfred Pennyworth in Birds of Prey with Dina Meyer as Barbara Gordon and Bruce Thomas as Batman, and played the Wise Man in Army of Darkness (1992). Other films in which he appeared include Sole Survivor (1970, with William Shatner, Lou Antonio, and John Winston), S.O.S. Titanic (1979, with Maurice Roëves), Blood Beach (1981, with Stefan Gierasch, Marianna Hill, and Bobby Bass), and The Lost World: Jurassic Park (1997, with Geno Silva, Katy Boyer, Marjean Holden, Jacqueline Schultz, and J. Patrick McCormack). In 1989, he appeared in an episode of Tales from the Crypt, with J. Patrick McNamara and Roy Brocksmith. His voice acting credits included Chancellor Palpatine/Darth Sidious in Star Wars: The Clone Wars, and Ganthet in Green Lantern: The Animated Series.\n\nAbercrombie died in Hollywood on 26 January 2012. He was 77.",
    "Image": "https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/97071_v9_ba.jpg"
  },
  {
    "Actor Name": "Ivar Brogger",
    "Star Trek Roles": "1997 - Orum - ST:VOY S3:E17 (Unity)\n2001 - Barus - ST:VOY S7:E22 (Natural Law)",
    "Mini Bio": "Ivar Brogger (born 10 January 1947; age 77) is an actor who played Orum in the Star Trek: Voyager third season episode \"Unity\", and Barus in the seventh season episode \"Natural Law\". Both of his costumes were sold off on the It's A Wrap! sale and auction on eBay.\n\nBesides Voyager, Brogger has appeared on numerous other popular television series, including 24], NYPD Blue, The Practice, Gene Roddenberry's Andromeda, and the final two-part episode of Touched by an Angel, which also featured fellow Star Trek actor Paul Winfield. He was also a regular performer on the hidden camera show The Jamie Kennedy Experiment. He had a recurring role as Father Jeffery Scanlon on ABC's Invasion, as did Star Trek: Deep Space Nine actor Cirroc Lofton.\n\nBrogger's feature film credits include Jacknife (1989, with Jordan Lund and Josh Pais) and Senseless (1998, with Jenette Goldstein, Richard McGonagle, Greg Grunberg, Alexander Enberg, Manu Intiraymi, Brad Dourif, Cyia Batten, Jack Shearer, Len Costanza, John Wilkie, Janet Dey, Bruce Dobos, Rubin Knight, and Andray Johnson).",
    "Image": "https://sbvtalent.s3.amazonaws.com/uploads/talent/image/196/main_Brogger__Ivar.jpg"
  },
  {
    "Actor Name": "J. Paul Boehmer",
    "Star Trek Roles": "1998 - German SS Officer - ST:VOY S4:E18 (The Killing Game: Part 1)\n1998 - German SS Officer - ST:VOY S4:E19 (The Killing Game: Part 2)\n1998 - 'One,' 29th-Century Borg Drone - ST:VOY S5:E2 (Drone)\n1999 - Vornar - ST:DS9 S7:E22 (Tacking Into the Wind)\n2002 - Mestral - ST:ENT S2:E2 (Carbon Creek)\n2004 - SS Officer - ST:ENT S3:E24 (Zero Hour)\n2004 - SS Agent - ST:ENT S4:E1 (Storm Front: Part 1)",
    "Mini Bio": "J. Paul Boehmer (born 30 October 1965; age 58) is an actor who played several characters in episodes of Star Trek: Deep Space Nine, Star Trek: Voyager, and Star Trek: Enterprise.\nHe provided his voice for several video games as well. He played Melkor, the primary antagonist in Star Trek: Klingon Academy, and later voiced several characters in Star Trek: Bridge Commander, including Gul Sek, Commander Joshua Martin, and Ambassador Saalek.\n\nHe has since had guest roles on television series such as Nip/Tuck and Numbers. More recently, he portrayed the recurring character Dr. Cutler on The Young and the Restless (2014-2015) and had guest roles in episodes of Colony (2017, with Sherman Augustus and Jolene Kay), Feud (2017, with Mark L. Taylor, John Rubinstein, and Van Epperson), and The Orville (2017, with Seth MacFarlane, Penny Johnson, Scott Grimes, Victor Garber, and Derek Mears).",
    "Image": "https://static.wikia.nocookie.net/english-voice-over/images/a/a8/J._Paul_Boehmer.png/revision/latest/scale-to-width-down/220?cb=20171103143843&path-prefix=sv"
  },
  {
    "Actor Name": "J.G. Hertzler",
    "Star Trek Roles": "1993 - Vulcan Captain - ST:DS9 S1:E1 (Emissary)\n1995-1999 - Martok - ST:DS9\n1999 - Laas - ST:DS9 S7:E14 (Chimera)\n2000 - Hirogen Hunter - ST:VOY S6:E15 (Tsunkatse)\n2003 - Advocate Kolos - ST:ENT S2:E19 (Judgment)\n2004 - Klingon Captain - ST:ENT S4:E4 (Borderland)",
    "Mini Bio": "John Garman \"J.G.\" Hertzler (born 18 March 1950; age 74) is an American actor from Savannah, Georgia, who has portrayed many different roles on several Star Trek series. He is one of only five actors to play seven or more different characters in the Star Trek franchise, the others being Jeffrey Combs, Randy Oglesby, Vaughn Armstrong and Thomas Kopache. Hertzler's best-known role is Martok, whom he played for four seasons on Star Trek: Deep Space Nine. He also wrote the continuation of his character's story in The Left Hand of Destiny novel diptych with Jeffrey Lang.\nIn addition, Hertzler has provided voice-over roles on several Star Trek computer games, including Star Trek: Armada and Star Trek: Armada II as the voice of Martok. Hertzler also played the role of Koval in Star Trek: Of Gods and Men. In 2007, it was announced that Hertzler would play Harry Mudd in a forthcoming edition of Star Trek: New Voyages, which he would also direct.\n\nIn a special feature on the DS9 7th Season DVD set (disc 7), Hertzler remarks, \"You know, the thing about Star Trek is they use more theater people, Shakespearean-trained (I've done a lot of Shakespeare – most of the Klingons have done a lot of Shakespeare) and that's something that Star Trek was unique. Is unique. They tend to go with people who can operate in a strangely heightened reality and somehow make it as close to reality as you can. That's sci-fi, you know, that's what you need.\"\n\nHertzler was interviewed for the Deep Space Nine documentary What We Left Behind.\n\nHertzler made his film debut in The Redeemer (1978, starring Jeannetta Arnette). He then appeared in ...And Justice for All (1979, with Keith Andes and Robert Symonds). In both the 1970s and the 1980s, however, he worked primarily on stage, including a stint on Broadway in an adaptation of the Greek tragedy The Bacchae.\n\nOne of Hertzler's first major television roles was a guest spot in the 1990 Quantum Leap episode \"Sea Bride – June 3, 1954\", where he appeared with Scott Bakula and Dean Stockwell. Hertzler then became a regular on the 1990s series Zorro, playing Alcalde Ignacio de Soto during the show's third and fourth seasons. Duncan Regehr was the star of this series, and Henry Darrow was also a regular.\n\nHertzler has since guest-starred on such shows as The Adventures of Brisco Country, Jr. (in an episode directed by Kim Manners and co-starring Morgan Woodward and David Youse), Diagnosis: Murder (directed by Leo Penn), Dr. Quinn, Medicine Woman (with Chad Allen, Leland Orser, and Gregory Sierra), Seinfeld (starring Jason Alexander), and Lois & Clark: The New Adventures of Superman (with K Callan and Teri Hatcher). In 2000, Hertzler and Jeff Corey appeared as council members in an episode of Charmed. Hertzler also guest-starred on Roswell in an episode written by Ronald D. Moore; William Sadler was a regular on this series. Later that year, Herzler worked with Lee Meriwether, Keith Szarabajka, and Ray Walston on an episode of Touched by an Angel.\n\nHe had a recurring role as a gallery owner on Six Feet Under, during which time he worked with Joanna Cassidy, James Cromwell, Ann Cusack, Matt Malloy, Chris Pine, Anne Elizabeth Ramsay, and Jeff Yagher. His other TV credits include the role of Black Dog in the 1994 family-oriented fantasy TV movie Treasure Island: The Adventure Begins, in which Anthony Zerbe portrayed Long John Silver and Shannon Cochran played the mother of the young protagonist. Hertzler also appeared in the 1996 mini-series Innocent Victims, along with Sam Anderson, Richard Fancy, Gregory Itzin, Don Keefer, Don McManus, Glenn Morshower, and Leon Russom. In 1999, Hertzler played director Ridley Scott in the biographical TV movie Pirates of Silicon Valley, which also featured Jeffrey Nordling and Marc Worden.",
    "Image": "https://www.popmythology.com/wp-content/uploads/2015/08/jg-hertzler-travis.jpg"
  },
  {
    "Actor Name": "Jack Shearer",
    "Star Trek Roles": "1993 - Vadosia - ST:DS9 S1:E16 (The Forsaken)\n1995 - Admiral Strickler ST:VOY S2:E5 (Non Sequitur)\n1995 - Ruwon - ST:DS9 S3:E17 (Visionary)\n1996 - Admiral Hayes - Star Trek: First Contact\n1998 - Admiral Hayes - ST:VOY S4:E26 (Hope and Fear)\n2000 - Admiral Hayes - ST:VOY S6:E24 (Life Line)",
    "Mini Bio": "Jack Shearer (born 21 March 1944; age 80) is an actor who appeared in five Star Trek television episodes and one feature film.\nShearer has appeared in many television series, such as in a recurring role in Ally McBeal, Malcolm in the Middle (with Kate Asner and Kevin Brief), and Boston Legal, starring William Shatner and René Auberjonois.\n\nIn addition his film credits include The Usual Suspects (1995, directed by Bryan Singer) and Senseless (1998, with Jenette Goldstein, Richard McGonagle, Greg Grunberg, Alexander Enberg, Manu Intiraymi, Ivar Brogger, Cyia Batten, Brad Dourif, Len Costanza, John Wilkie, Janet Dey, Bruce Dobos, Andray Johnson, and Rubin Knight).",
    "Image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2024/05/star-trek-ds9-jack-shearer-romulan.jpg"
  },
  {
    "Actor Name": "James Cromwell",
    "Star Trek Roles": "1990 - Prime Minister Nayrok - STTNG S3:E11 (The Hunted)\n1993 - Jaglom Shrek - STTNG S6:E16 (Birthright: Part 1)\n1993 - Jaglom Shrek - STTNG S6:E17 (Birthright: Part 2)\n1995 - Hanok - ST:DS9 S4:E6 (Starship Down)\n1996 - Zefram Cochran - Star Trek: First Contact\n2001 - Dr. Zefram Cochrane - ST:ENT S1:E1 (Broken Bow: Part 1)",
    "Mini Bio": "James Cromwell (born 27 January 1940; age 84) is a veteran actor who has made several appearances in the Star Trek franchise, and is best known to Trek fans for his portrayal of Zefram Cochrane in Star Trek: First Contact. He would go on to make an uncredited cameo as Cochrane in the Star Trek: Enterprise first season episode \"Broken Bow\".\n\nHe was interviewed on 25 June 2002 for the TNG Season 6 DVD special feature \"Departmental Briefing Year Six\" – \"Make Up\".Born in Los Angeles, California and raised in New York, Cromwell studied engineering at the Carnegie Institute of Technology (now Carnegie Mellon University). Appropriately, he has played the part of a warp drive inventor (Star Trek) and a visionary cyberneticist (I, Robot, a film adaptation of Isaac Asimov's Robot Series). He began his acting career on television in 1974, but had some difficulty breaking into feature films because of his height. At a staggering 6'6½\" (199 cm) , many filmmakers were afraid to give him any roles as he would tower over their stars. This soon changed, however.\n\nCromwell was married to actress Julie Cobb, who played Yeoman Leslie Thompson in the Star Trek: The Original Series second season episode \"By Any Other Name\". Cromwell's former stepdaughter, Rosemary Morgan, is also a Trek alumna, having played Piri in the Star Trek: Voyager third season episode \"The Chute\".Cromwell has become a highly recognizable figure outside of Star Trek. He earned an Academy Award nomination for his performance as Farmer Hoggett in Babe (1995), a role which he reprised in Babe: Pig in the City (1998). He also acquired praise for playing a crooked police captain in L.A. Confidential (1997). Another cast member was Star Trek: The Next Generation guest actor Matt McCoy, whom Cromwell had worked with twice before in two television projects and would work with again on Citizen Baines in 2001. Other cast members in L.A. Confidential were Robert Clendenin, Steve Rankin, Paul Guilfoyle, Symba Smith, Brenda Bakke, John Mahon, Jim Metzler and Colin Mitchell as well as stuntmen Steven Lambert, Don Pulford and Allan Graf. Cromwell would star as future disgraced United States Senator Charles Keating in The People vs. Larry Flynt (1996, co-starring fellow Next Generation guest star Vincent Schiavelli.",
    "Image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgkv-AsF_FaMWxYTF8ksrAGuVA6HYkEC-GjFEbUJCRVbo0GDFDop5rwu9GjXIu5v7k9g6f8b_oveI8mb89UUfWXSB72mJK_o2yjqn-u-Zbny9o8dpd8GUvN4BMvIG-FfiJKTsNhbvIQlv7p/s320/James+Cromwell.jpg"
  },
  {
    "Actor Name": "James Horan",
    "Star Trek Roles": "1993 - Dr. Jo'Bril - STTNG S6:E22 (Suspicions)\n1993 - Lieutenant Barnaby - STTNG S7:E1 (Descent: Part 2)\n1997 - Tosin - ST:VOY S3:E13 (Fair Trade)\n1997 - Ikat'ika - ST:DS9 S5:E14 (In Purgatory's Shadow)\n1997 - Ikat'ika - ST:DS9 S5:E15 (By Inferno's Light)\n2001 - Humanoid Figure - ST:ENT S1:E1 (Broken Bow: Part 1)\n2001 - Humanoid Figure - ST:ENT S1:E2 (Broken Bow: Part 2)\n2001 - Humanoid Figure - ST:ENT S1:E11 (Cold Front)\n2002 - Humanoid Figure - ST:ENT S1:E26 (Shockwave: Part 1)\n2002 - Humanoid Figure - ST:ENT S2:E1 (Shockwave: Part 2)\n2003 - Humanoid Figure - ST:ENT S2:E26 (The Expanse)",
    "Mini Bio": "James Horan (born 14 December 1954; age 69) is an actor who has appeared in four Star Trek spin-off television series: Star Trek: The Next Generation, Star Trek: Deep Space Nine, Star Trek: Voyager and Star Trek: Enterprise. In addition, he lent his voice to the video games Star Trek: Klingon Academy, Star Trek: Starfleet Command III, and Star Trek Online.\n\nHoran is a veteran television soap opera actor, having starred in Guiding Light (1981), Another World (1981-1982), General Hospital, All My Children, and The Young and the Restless (1998).\n\nHe is well-known for his guest appearance on Highlander: The Series as the evil Immortal named Grayson in the first season episode entitled \"Band of Brothers\" (1993). He had a recurring role on Zorro (1992, starring Duncan Regehr), and also made guest appearances on Baywatch, Melrose Place, Walker, Texas Ranger (with Noble Willingham), Charmed, and Lost.\n\nIn 1994, he co-starred with Louise Fletcher in The Haunting of Seacliff Inn. His film credits include Chattanooga Choo Choo (1984, with Christopher McDonald, Davis Roberts, and Bill Zuckert), Scanner Cop (1994, with Mark Rolston), Counter Measures (1999, with Scott Marlowe), and Gods and Generals (2003, with Kevin Conway, Robert Easton, W. Morgan Sheppard, and Andrew Prine).\n\nCurrently, he mostly supplies voices for video games, including The Hobbit (as Smaug), Ghost Recon, Freelancer, Star Wars: Knights of the Old Republic, Everquest II, Warhammer 40,000: Dawn of War II, and its expansion packs Chaos Rising, and Retribution. He also voiced President Shinra in Final Fantasy VII Remake (2017). He has a recurring role as Wheeljack on Transformers: Prime, executive produced by Roberto Orci and Alex Kurtzman, co-starring with Jeffrey Combs, Tania Gunadi, Frank Welker, and Tony Todd.",
    "Image": "https://www.irishtimes.com/resizer/v2/O6YKLGBU25UWGBAIFEQECPDVMQ.jpg?auth=5086e2b9a2bb94743a84a12c94a0407de85f82e91f7f58a2746bf9084d9261e4&smart=true&width=1024&height=576"
  },
  {
    "Actor Name": "James Sloyan",
    "Star Trek Roles": "1990 - Admiral Alidar Jarok - STTNG S3:E10 (The Defector)\n1994 - Doctor Mora Pol - ST:DS9 S2:E12 (The Alternate)\n1994 - K'Mtar - STTNG S7:E21 (Firstborn)\n1995 - Ma'bor Jetrel - ST:VOY S1:E14 (Jetrel)\n1997 - Doctor Mora Pol - ST:DS9 S5:E12 (The Begotten)",
    "Mini Bio": "James Joseph Sloyan (born 24 February 1940; age 84) is an actor who played Alidar Jarok in the Star Trek: The Next Generation third season episode \"The Defector\", K'mtar in the seventh season episode \"Firstborn\", Mora Pol in the Star Trek: Deep Space Nine second and fifth season episodes \"The Alternate\" and \"The Begotten\", and Ma'Bor Jetrel in the Star Trek: Voyager first season episode \"Jetrel\".\n\nOne of Sloyan's earliest feature film credits was The Sting (1973, featuring Next Generation and Voyager guest Ray Walston). He also played the role of Barnard \"Barney\" Smith in the 1979 Buck Rogers in the 25th Century two-parter \"The Plot to Kill a City\" (with Frank Gorshin, Felix Silla, Anthony James, Seamon Glass, and Tim O'Connor). In 1970, he appeared in The Traveling Executioner with Graham Jarvis, Marianna Hill, Stefan Gierasch, Logan Ramsey, and James Greene.\n\nSloyan had a role in Centennial (1978, featuring Michael Ansara, Cliff DeYoung, Brian Keith, Sally Kellerman, Morgan Woodward, and Anthony Zerbe). He co-starred with Robert Picardo in the 1981 made-for-TV movie The Violation of Sarah McDavid and was also once a regular on the TV series Ryan's Hope, as was Kate Mulgrew. Sloyan's voice is familiar to many as he is the spokesman for Lexus.\n\nSloyan made several appearances as Avery Baltus on the TV series Party of Five. He played Dr. Frank Nollette in The X-Files episode \"Roland\". He also guest-starred in an episode of Quantum Leap, starring Scott Bakula and Dean Stockwell, and appeared as Superintendent Hazen on several episodes of Dr. Quinn, Medicine Woman, starring Barbara Babcock, as well as recurring on Murder, She Wrote as insurance investigator Robert Butler in episodes featuring Jessica Fletcher's friend Dennis Stanton (played by Keith Mitchell), sharing every episode with Hallie Todd, who played Dennis' receptionist.",
    "Image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2024/03/star-trek-voyager-jetrel-james-sloyan-1.jpg"
  },
  {
    "Actor Name": "Jeff Austin",
    "Star Trek Roles": "1995 - Bolian - ST:DS9 S3:E26 (The Adversary)\n1998 - Allos - ST:VOY S4:E21 (The Omega Directive)",
    "Mini Bio": "Jeff Austin (born 29 August 1954; age 70) is an actor who played a Bolian security officer in the Star Trek: Deep Space Nine third season episode \"The Adversary\" and Allos in the Star Trek: Voyager fourth season episode \"The Omega Directive\".\n\nAustin starred in Rocky IV, L.A. Confidential (1997) and Armageddon (1998). He appeared in the first episode of Babylon 5, starring Claudia Christian and Andreas Katsulas. Austin has also guest starred on The X-Files, 3rd Rock from the Sun, Sabrina the Teenage Witch, The King of Queens and Castle.",
    "Image": "https://tvwish.com/Img/Actor/933.jpg"
  },
  {
    "Actor Name": "Jeffrey Alan Chandler",
    "Star Trek Roles": "1995 - Hatil - ST:VOY S1:E8 (Emanations)\n1995 - Guardian - ST:DS9 S3:E25 (Facets)",
    "Mini Bio": "Jeffrey Alan Chandler (9 September 1944 – 19 December 2001; age 57) was an actor who appeared as Hatil Garan in the Star Trek: Voyager first season episode \"Emanations\" and Trill Guardian in the Star Trek: Deep Space Nine third season episode \"Facets\". For both appearances he was credited as Jefrey Alan Chandler.\n\nChandler was a graduate of Carnegie Mellon University in Pittsburgh, and performed in several theatre productions in his native New York City before moving to Los Angeles to pursue a screen career. He guested in a large number of television series, including Knight Rider (starring Patricia McPherson and William Daniels, with Brian Thompson), Hill Street Blues (starring James B. Sikking, with Barbara Bosson, Saul Rubinek, and Mimi Kuzyk), The A-Team (starring Dwight Schultz, directed by Michael O'Herlihy), L.A. Law (starring Corbin Bernsen, with Robert Picardo), Doogie Howser, M.D. (starring Lawrence Pressman and James B. Sikking), Picket Fences (with Ray Walston), Ellen, and ER (with Lily Mariye).\n\nHis only film credits were small roles in La Bamba (1987, with Rosana DeSoto, Sam Anderson, and Noble Willingham), In the Mood (1987, with Douglas Rowe), and Iron Will (1994, with David Ogden Stiers and Richard Riehle).\n\nChandler died in 2001 of liver failure in Los Angeles, California. He was 57 years old.",
    "Image": "https://images.plex.tv/photo?size=large-1920&scale=1&url=https%3A%2F%2Fmetadata-static.plex.tv%2Ff%2Fpeople%2Ff931a73dd769f7fc15423acaa9c2b600.jpg"
  },
  {
    "Actor Name": "Jeffrey Combs",
    "Star Trek Roles": "1994 - Tiron - ST:DS9 S3:E8 (Meridian)\n1995-1999 - Brunt - ST:DS9\n1996-1999 - Weyoun - ST:DS9\n2000 - Penk - ST:VOY S6:E15 (Tsunkatse)\n2001-2005 - Commander Thy'lek Shran - ST:ENT\n2002 - Krem - ST:ENT S1:E19 (Acquisition)",
    "Mini Bio": "Jeffrey Alan Combs (born 9 September 1954; age 70) is an actor who has the distinction of portraying nine different characters on four Star Trek television series, most notably those of Brunt and the various Weyouns on Star Trek: Deep Space Nine, and Thy'lek Shran on Star Trek: Enterprise.\nMost recently, he voiced AGIMUS in the Star Trek: Lower Decks episodes \"Where Pleasant Fountains Lie\", \"A Mathematically Perfect Redemption\" and \"A Few Badgeys More\".\n\nBorn in Oxnard, California, Combs was raised in Lompoc, California along with many older and younger siblings. He graduated from Lompoc High School in 1972, after which he honed his acting talents at the Pacific Conservatory of the Performing Arts in Santa Maria, California and the Professional Actor's Training Program at the University of Washington in Seattle, Washington.\n\nOutside of Star Trek, Combs has made guest appearances on several other television series. In 1987, he appeared on an episode of Beauty and the Beast, starring Linda Hamilton and Ron Perlman. Also in 1987, he was seen on Houston Knights, working with Madlyn Rhue.\n\nCombs has also worked on The Flash (1991, with Dick Miller), Babylon 5 (1994, starring Claudia Christian and Bill Mumy and David L. Crowley), Perversions of Science (1997, with Jeff Corey, Ron Perlman, and David Warner), and the remake of The Twilight Zone (2003). He also played the recurring role of Kevin Burkhoff on The 4400 (2005-2007).\n\nOther series on which he has appeared include Freddy's Nightmares (1989, starring Robert Englund), Hunter (1991, in an episode with Kenneth Marshall), Life Goes On (1991, with David Graf and Bill Smitrovich), The Single Guy (1996, starring Olivia d'Abo and Mark Moses), Martial Law (2000, with Neal McDonough and T.J. Storm), CSI: Crime Scene Investigation (2003), and Cold Case (2008).\n\nIn 1996, Combs had a role in Norma Jean & Marilyn. Also starring in this movie were Ashley Judd, Steven Culp, David Drew Gallagher, Alex Henteloff, and John Rubinstein. In 2005, Combs appeared in two made-for-TV horror movies: Voodoo Moon and Hammerhead: Shark Frenzy.\n\nCombs is also a sought-after voice actor, appearing in numerous animated television shows. He has most prominently worked as a voice actor for animation set in the DC Animated Universe, specifically as The Scarecrow in The New Batman Adventures (1997, working on the same episode as Charles Rocket) and The Question in several episodes of Justice League (2004-2006, alongside Clancy Brown, Robert Foxworth, Virginia Madsen, and Charles Napier). He also voiced the Scarecrow for the video game Batman: Rise of Sin Tzu (2003), which also featured Cary-Hiroyuki, Loren Lester, and Ron Perlman. Combs voiced the Autobot Ratchet in Roberto Orci and Alex Kurtzman's Transformers: Prime (2010-2013), Viceroy in Chadam (2010), The Leader in Avengers: World's Mightiest Heroes (2010-2012), Rat King in Teenage Mutant Ninja Turtles (2012-2016), and Ratchet in Transformers: Robots in Disguise (2016-2017).",
    "Image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2020/07/Jeffrey-Combs-in-Star-Trek.jpg"
  },
  {
    "Actor Name": "Jennifer Gatti",
    "Star Trek Roles": "1993 - Ba'el - STTNG S6:E16 (Birthright: Part 1)\n1993 - Ba'el - STTNG S6:E17 (Birthright: Part 2)\n1995 - Libby - ST:VOY S2:E5 (Non Sequitur)",
    "Mini Bio": "Jennifer Gatti (born 4 October 1968; age 56) is an actress who played Ba'el in the Star Trek: The Next Generation sixth season episodes \"Birthright, Part I\" and \"Birthright, Part II\" and Libby in the Star Trek: Voyager second season episode \"Non Sequitur\".\n\nHer costume from her previous Trek appearance was sold off on the It's A Wrap! sale and auction on eBay. (X) Gatti was a runner-up for the role of Kes, eventually won by Jennifer Lien. (Captains' Logs Supplemental - The Unauthorized Guide to the New Trek Voyages, p. 156)\n\nGatti's earliest work in film was as the title character in the video for Bon Jovi's hit song \"Runaway\". Gatti made her movie debut in Mobsters (1991, with F. Murray Abraham, Seymour Cassel, Frank Collison, Willie Garson, Christian Slater, and Titus Welliver), followed by We're Talking Serious Money (1992, with Robert Costanzo and Barbara Alyn Woods), Nemesis (1992, with Nicholas Guest, Cary-Hiroyuki, and Branscombe Richmond), and Double Exposure (1993, with Ron Perlman).\n\nAfter The Next Generation, Gatti appeared in Things That Go Bump (1997, with Gregory Itzin), Blood Money (1999, with Erich Anderson, Alicia Coppola, Raymond Cruz, and Gregory Sierra) and Millennium Man (with Jonathan Banks, Michael Harney, and Monte Markham). The most recent movie Gatti appeared in was 2002's The Ten Rules.\n\nOn television, Gatti starred in the CBS Schoolbreak Special (with Lanei Chapman and Tricia O'Neil). Gatti next appeared on Doogie Howser, M.D. (starring Lawrence Pressman and James B. Sikking). She also appeared on Cheers (starring Kirstie Alley, Kelsey Grammer, and Bebe Neuwirth). Gatti's next television role was on Flying Blind (with Robert Bauer and Cristine Rose). Other appearances include ER (starring Eriq La Salle, with Lily Mariye), The Division (with Joseph Campanella, Georgann Johnson, Julia Nickson, and Simon Templeman), NCIS (with Alan Dale, Tim Kelleher, and Rudolf Martin), CSI: Crime Scene Investigation (starring Paul Guilfoyle and Wallace Langham, with Steven Culp and Kim Rhodes), CSI: Miami, with fellow Next Generation/Voyager guest star Eric Pierpoint and due to her work on NCIS, Gatti won a guest role on JAG (starring David Andrews, Scott Lawrence, and Zoe McLellan), in an episode with Dey Young. Gatti also appeared as a guest in a 2005 episode of Surface, and in a 2010 episode of Drop Dead Diva.",
    "Image": "https://pics.filmaffinity.com/116542019546253-nm_200.jpg"
  },
  {
    "Actor Name": "Jerry Ayres",
    "Star Trek Roles": "1967 - O'Herlihy - ST:TOS S1:E18 (Arena)\n1967 - Rizzo - ST:TOS S2:E13 (Obsession)",
    "Mini Bio": "Jerry Ayres (21 September 1936 – 14 May 2013; age 76) was an actor who played O'Herlihy in the Star Trek: The Original Series first season episode \"Arena\" and Rizzo in the second season episode \"Obsession\". Ayres filmed his scenes for \"Arena\" on Friday 11 November 1966 at the fortress set near Vasquez Rocks Natural Area Park and Tuesday 15 November 1966 at Desilu Stage 9. He filmed his scenes for \"Obsession\" on Thursday 12 October 1967 and Friday 13 October 1967 at Stage 9 and Stage 10.\n\nAyres was born as Gerald Hoyt Ayres, Jr.. He went on to become a regular on the soap operas General Hospital and The Bold and the Beautiful. He also had a recurring role in the first season of the television drama series Dynasty. He appeared in seven episodes, including the pilot (\"Oil\") and \"The Chaffeur Tells a Secret\", both helmed by \"Obsession\" director Ralph Senensky. The former also featured Peter Mark Richman, Lee Bergere, Ellen Geer, Julie Parrish, and Paul Sorensen. Senensky also directed him in \"Double Jeopardy\", the pilot of Dan August, which featured Ned Romero, Susan Oliver, and Fritz Weaver. Ayres also appeared in the 1979 television movie Disaster on the Coastliner (with William Shatner and Michael Pataki and featuring the music of Gerald Fried).\n\nAyres passed away from natural causes on May 14, 2013. He was 76.",
    "Image": "https://moviedude.co.uk/1Actors%20Images%20J/Jerry%20Ayres%20%20'Star%20Trek'%20(1967)%201.17.jpg"
  },
  {
    "Actor Name": "Jerry Hardin",
    "Star Trek Roles": "1988 - Radue - STTNG S1:E16 (When the Bough Breaks)\n1992 - Samuel Clemens - STTNG S5:E26 (Time's Arrow: Part 1)\n1992 - Samuel Clemens - STTNG S6:E1 (Time's Arrow: Part 2)\n1995 - Dr. Neria - ST:VOY S1:E8 (Emanations)",
    "Mini Bio": "Jerry Hardin (born 20 November 1929; age 94) is an actor who played Radue in the Star Trek: The Next Generation first season episode \"When The Bough Breaks\", Samuel Clemens in the fifth and sixth season episodes \"Time's Arrow\" and \"Time's Arrow, Part II\", and Neria in the Star Trek: Voyager first season episode \"Emanations\".\n\nElsewhere in the sci-fi genre, Hardin is well-known for his portrayal of the informant Deep Throat beginning in the first season of The X-Files, as well as his role as the unnamed attorney in Big Trouble in Little China (1986, starring Kim Cattrall). He had a bit part in the 1975 movie Mitchell, in which Robert Phillips had a supporting role. He also had a small role in the 1981 Star Wars Radio Drama as the voices of additional characters.\n\nHe has made guest appearances in Ironside (starring Barbara Anderson), Starsky & Hutch (starring David Soul), The Rockford Files, Little House on the Prairie, The Twilight Zone (with Andrew J. Robinson, Louis Giambalvo, Mark L. Taylor, and David Sage), Dallas (starring Susan Howard, with William Smithers), Knots Landing, Quantum Leap (starring Scott Bakula and Dean Stockwell, with Alan Oppenheimer), Lois & Clark: The New Adventures of Superman (starring Teri Hatcher, K Callan, and Tracy Scoggins), Dr. Quinn, Medicine Woman Murder, She Wrote, Melrose Place, Sliders (starring Jerry O'Connell, with Ken Jenkins and Kristanna S. Loken) and The Middle.",
    "Image": "https://www.looper.com/img/gallery/who-plays-mark-twain-on-star-trek/l-intro-1697824372.jpg"
  },
  {
    "Actor Name": "John Fleck",
    "Star Trek Roles": "1991 - Taibak - STTNG S4:E24 (The Mind's Eye)\n1993 - Cardassian Overseer - ST:DS9 S2:E1 (The Homecoming)\n1994 - Ornithar - ST:DS9 S3:E1 (The Search: Part 1)\n1999 - Koval - ST:DS9 S7:E16 (Inter Arma Enim Silent Leges)\n1999 - Abaddon - ST:VOY S6:E5 (Alice)\n2001 - Silik - ST:ENT S1:E1 (Broken Bow: Part 1)\n2001 - Silik - ST:ENT S1:E2 (Broken Bow: Part 2)\n2001 - Silik - ST:ENT S1:E11 (Cold Front)\n2002 - Silik - ST:ENT S1:E26 (Shockwave: Part 1)\n2002 - Silik - ST:ENT S2:E1 (Shockwave: Part 2)\n2003 - Silik - ST:ENT S2:E26 (The Expanse)\n2004 - Silik - ST:ENT S4:E1 (Storm Front: Part 1)\n2004 - Silik - ST:ENT S4:E2 (Storm Front: Part 2)",
    "Mini Bio": "John Fleck (born 7 May 1951; age 73) is an actor who appeared in several episodes of Star Trek: The Next Generation, Star Trek: Deep Space Nine, and Star Trek: Voyager. He is probably best known for his recurring role of Silik in Star Trek: Enterprise.\n\nIn 2021, Fleck recalled his appearances: \"I played so many species. I made a nice living playing NON-Human beings. I called it \"torture pay,\" sitting in the makeup chair for hours getting glued and painted and then hours taking it off. But hey, I'm grateful Rick Berman kept calling me back to play different characters on all the Star Trek series - it segued into me playing Gecko on HBO's Carnivale - and I'm forever grateful for the residuals that still trickle in from all the streaming still going on\".\n\nFleck filmed his first appearance on Star Trek in \"The Mind's Eye\" on Friday 22 March 1991 and Thursday 28 March 1991 on Paramount Stage 8 and 16. His Borothan costume from the episode \"Cold Front\" was later sold off on the It's A Wrap! sale and auction on eBay. (X)\n\nFleck had a regular role on Carnivále as Gecko, along with Adrienne Barbeau, Clancy Brown, Michael John Anderson, Scott MacDonald, John Savage, Robert Knepper, K Callan, and Frank Collison.\n\nHe also had a regular role on Murder One as Louis Hines. Other regulars and semi-regulars on the show were Daniel Benzali, Barbara Bosson, Gregory Itzin, Kevin Tighe, Stanley Kamel, Donna Murphy, Victor Bevine, Ned Vaughn, Adam Scott, Conor O'Farrell, Richard McGonagle, Clayton Rohner, and Jack Kehler.\n\nHe played the mendicant in the park on the film Falling Down and appeared in the Babylon 5 pilot episode (created by J. Michael Straczynski and featuring Andreas Katsulas, Patricia Tallman, and David Sage). In motion pictures he played a doctor in Waterworld and \"Explosion Thug #2\" in The Naked Gun 2½: The Smell of Fear (the other \"Explosion Thug\" was played by fellow Next Generation guest star Reiner Schöne). Fleck later made an appearance on NBC's Chuck, produced by Robert Duncan McNeill and starring Tony Todd and Bonita Friedericy.\n\nMore recently, in 2019, Fleck played the part of a Krill ambassador in The Orville second season episode \"Blood of Patriots.",
    "Image": "https://cdn.mos.cms.futurecdn.net/4MSxeHRogBHGUsQkLHpYVG-320-80.jpg"
  },
  {
    "Actor Name": "John K. Shull",
    "Star Trek Roles": "1994 - Molor - STTNG S7:E21 (Firstborn)\n1995 - Security Officer - ST:DS9 S3:E24 (Shakaar)\n1996 - K'Temang - ST:DS9 S4:E13 (Return to Grace)\n1996 - Medicine Man - ST:VOY S3:E1 (Basics: Part 2)\n1999 - Brok'Tan - ST:VOY S6:E3 (Barge of the Dead)\n2001 - Commander Nocona - ST:VOY S7:E23 (Homestead)",
    "Mini Bio": "John Kenton Shull (born 23 May 1953; age 71) is an actor who appeared in several episodes of Star Trek: The Next Generation, Star Trek: Deep Space Nine and Star Trek: Voyager. His main appearances have been as Klingons. His costume from the episode \"Homestead\" was sold off on the It's A Wrap! sale and auction on eBay. [1](X) In addition, Shull lent his voice to the Star Trek video games Star Trek: Klingon and Star Trek: Klingon Academy.\n\nShull has primarily worked on television beginning with his debut on Fantasy Island starring Ricardo Montalban in 1981. He then appeared on The Fall Guy (1982, with Peter Mark Richman), Highway to Heaven (1985, with Noble Willingham), Dallas (1986, with John Beck and Barry Jenner), and The Young and the Restless (with Jonathan Farwell). Further television credits include guest roles in Boomtown (2003, with Virginia Madsen, Neal McDonough, and Vanessa Williams) and Cold Case (2005, co-executive produced by Roxann Dawson).\n\nHe made his film debut in Bates Motel (1987, with Gregg Henry, Kerrie Keane, Craig Richard Nelson, Lori Petty and Robert Picardo). He then appeared in Pump Up the Volume (1990, with Christian Slater, Gregg Daniel, Alexander Enberg, Clayton Landey, Robert Schenkkan and Ed Trotta).",
    "Image": "https://pbs.twimg.com/profile_images/1618836989683326978/skI1bmKR_400x400.jpg"
  },
  {
    "Actor Name": "John L. Bennett",
    "Star Trek Roles": "1989 - Starbase Montgomery Technician - ST:TNG S2:E14 (The Icarus Factor)\n1994 - Kozak - ST:DS9 S3:E3 (The House of Quark)\n1995 - Gabriel Bell - ST:DS9 S3:E11 (Past Tense: Part 1)\n1996 - Towering Klingon - ST:DS9 S5:E1 (Apocalypse Rising)",
    "Mini Bio": "John Lendale Bennett (27 November 1951 – 27 February 2006; age 54) was a stuntman and stunt actor who portrayed three characters in Star Trek: Deep Space Nine. Two of his appearances were as Klingons. In addition, he worked as a stunt double, photo double, and stand-in for Avery Brooks on Deep Space Nine and as stunt double for Tim Russ on Star Trek: Voyager. One of his costumes as double for Brooks was sold off on the It's A Wrap! sale and auction on eBay. [1](X) Bennett previously appeared in the Star Trek: The Next Generation second season episode \"The Icarus Factor\" [2] and performed a high tower fall stunt in another Next Generation episode.\n\nHe was one of the photo doubles, alongside Todd Slayton, Steve Wilson, and Jennifer Berlant, who filled in for the actors for the wide shots in the desert of Palmdale in California for the seventh season episode \"Shadows and Symbols\". (Star Trek: Deep Space Nine Companion, p. 601 (citation needed • edit))\n\nBorn in Chicago, Illinois, Bennett initially considered joining the priesthood, graduating from Quigley Preparatory Seminary South. While there, he performed in a number of high school plays. He also won a statewide oration competition for his rendition of Martin Luther King, Jr.'s \"I Have a Dream\" speech.\n\nHe then attended Ohio State University, where he played college football. After returning to Chicago and working as a conductor, he moved to California to become an actor.\n\nBennett also had acting roles on Space: Above and Beyond and Seven Days. As a stuntman, he performed in such films as Face/Off (1997), Stuart Baird's U.S. Marshals (1998), Gone in 60 Seconds (2000), The Replacements (2000), and Minority Report (2002).\n\nBennett died of his fourth heart attack in 2006. He was 54 years old. He is remembered as an \"adrenaline junkie\", a man who loved to take risks, yet his only serious injury was a broken arm. (Jim Ritter, \"Action movie stuntman was 'adrenaline junkie,'\" Chicago Sun-Times, 24 Apr. 2006)",
    "Image": "https://static.wikia.nocookie.net/startrek/images/7/7f/Gabriel_Bell.jpg/revision/latest/scale-to-width/360?cb=20240113174618"
  },
  {
    "Actor Name": "John Vickery",
    "Star Trek Roles": "1995 - John Evansville - ST:VOY S2:E1 (The 37's)\n2002 - Mazarite Captain - ST:ENT S1:E23 (Fallen Hero)\n2004 - Minister Kuvak - ST:ENT S4:E8 (Awakening)\n2004 - Minister Kuvak - ST:ENT S4:E9 (Kir'Shara)",
    "Mini Bio": "John Vickery (born 4 November 1950; age 73) is a stage, film, and television actor who appeared as Andrus Hagan in the Star Trek: The Next Generation fourth season episode \"Night Terrors\", Rusot in the Star Trek: Deep Space Nine seventh season episodes \"The Changing Face of Evil\", \"When It Rains...\", and \"Tacking Into the Wind\" and Orak in the Star Trek: Enterprise second season episode \"Judgment\".\nVickery's costume from his appearance on Enterprise was sold off on the It's A Wrap! sale and auction on eBay. [1](X) [2](X) [3](X) The boots were also worn by Michael Dorn and Jef Ayres and the trousers by James Worthy. Vickery filmed his scenes for the episode \"Night Terrors\" on Monday 7 January 1991 and Wednesday 9 January 1991 on Paramount Stage 9 and 16.",
    "Image": "https://trekmovie.com/wp-content/uploads/2020/02/pic-103-promo-00007-640x427.jpg"
  },
  {
    "Actor Name": "Jonathan Del Arco",
    "Star Trek Roles": "1992 - 3rd of 5/Hugh - STTNG S5:E23 (I Borg)\n1993 - Hugh - STTNG S7:E1 (Descent: Part 2)\n2001 - Fantome - ST:VOY S7:E15 (The Void)",
    "Mini Bio": "Jonathan Del Arco (born 7 March 1966; age 58) is the Uruguayan-born actor who played Hugh in the Star Trek: The Next Generation fifth and seventh season episodes \"I Borg\" and \"Descent, Part II\". He reprised the role in the Star Trek: Picard first season episodes \"The End is the Beginning\", \"The Impossible Box\", and \"Nepenthe\".\n\nHe also appeared as Fantome in the Star Trek: Voyager seventh season episode \"The Void\". Footage from his appearance in \"I Borg\" was also used in the TNG sixth season episode \"Descent\". Del Arco filmed his scenes for \"I Borg\" between Friday 6 March 1992 and Monday 9 March 1992 and Wednesday 11 March 1992 and Monday 16 March 1992 on Paramount Stage 8, 9, and 16.\n\nHe was interviewed on 14 February 2002 for the TNG Season 5 DVD special features \"Mission Overview Year Five\" (\"I Borg\") and \"Intergalactic Guest Stars\" (\"Profile: \"Hugh\" Borg\"). According to the latter interview, Del Arco auditioned for the part of Wesley Crusher at the beginning of The Next Generation.\n\nDel Arco also supplied his voice to two Star Trek video games: Star Trek: Armada II, for which he provided additional background voices, and Star Trek: Bridge Commander, for which he voiced the character of Miguel Pedro Diaz.",
    "Image": "https://trekmovie.com/wp-content/uploads/2020/02/pic-103-promo-00007-640x427.jpg"
  },
  {
    "Actor Name": "Joseph Ruskin",
    "Star Trek Roles": "1968 - Galt - ST:TOS S2:E16 (The Gamesters of Triskelion)\n1994 - Tumek - ST:DS9 S3:E3 (The House of Quark)\n1995 - Informant - ST:DS9 S3:E20 (Improbable Cause)\n1996 - Tumek - ST:DS9 S5:E3 (Looking for par'Mach in All the Wrong Places)\n1998 - Son'a Officer #3 - Star Trek: Insurrection\n1999 - Vulcan Master - ST:VOY S5:E13 (Gravity)\n2001 - Suliban Doctor - ST:ENT S1:E1 (Broken Bow: Part 1)",
    "Mini Bio": "Joseph Ruskin (14 April 1924 – 28 December 2013; age 89), born Joseph Richard Schlafman, was an American actor who appeared as Galt in the Star Trek: The Original Series second season episode \"The Gamesters of Triskelion\", Tumek in the Star Trek: Deep Space Nine third and fifth season episodes \"The House of Quark\" and \"Looking for par'Mach in All the Wrong Places\", the Cardassian Informant in the Deep Space Nine third season episode \"Improbable Cause\", a Vulcan master in the VOY: fifth season episode \"Gravity\", and Suliban doctor in the Star Trek: Enterprise first season episode \"Broken Bow\". Along with Majel Barrett, Clint Howard, Jack Donner, and Vince Deadrick, he was one of only five actors to appear in both The Original Series and Enterprise. He, Barrett, and Howard also appeared in Deep Space Nine.\n\nRuskin also worked on two Star Trek video games, lending his voice to Master Si'tann in Star Trek: Hidden Evil in 1999 and to Admiral Nolotai and Vulcan Master N'Kal in Star Trek: Away Team in 2001.\n\nRuskin filmed his scenes for \"The Gamesters of Triskelion\" on Wednesday 18 October 1967 and between Friday 20 October 1967 and Tuesday 24 October 1967 at Paramount Test Stage and Desilu Stage 10.\n\nHailing from Haverhill, Massachusetts, USA, Ruskin, like William Schallert, Barry Gordon, and Kitty Swink, served on the Screen Actors Guild Executive Board of Directors, becoming a Trustee at the Screen Actors Guild Pension and Health Plan. Ruskin worked for the SGA between 1976 and 1999.\n\nHe had a long and distinguished career, appearing in television series as early as 1959. In his later years, he had a recurring role as Alliance Member Alain Christophe in J.J. Abrams' Alias, as well as playing an elderly mob boss in Smokin' Aces (2006, featuring Chris Pine).\n\nRuskin died on 28 December 2013 at the age of 89 from natural causes at UCLA Medical Center in Santa Monica.",
    "Image": "https://www.ex-astris-scientia.org/rankings/images/ten-multiple-roles-07.jpg"
  },
  {
    "Actor Name": "Julie Caitlin Brown",
    "Star Trek Roles": "1993 - Ty Kajada - ST:DS9 S1:E8 (The Passenger)\n1993 - Vekor - STTNG S7:E4 (Gambit: Part 1)\n1993 - Vekor - STTNG S7:E5 (Gambit: Part 2)",
    "Mini Bio": "Caitlin Brown (born 27 January 1961; age 63) is an actress, agent, musician and filmmaker who played Ty Kajada in the Star Trek: Deep Space Nine first season episode \"The Passenger\" and Vekor in the Star Trek: The Next Generation seventh season episodes \"Gambit, Part I\" and \"Gambit, Part II\".\n\nShe is probably best known for playing Na'Toth in the first season of Babylon 5, a role taken up by Mary Kay Adams for two episodes in season two. Claudia Christian, Andreas Katsulas and Bill Mumy co-starred with her. Brown reprised the role for one episode of season 5 and played a Human lawyer, Guinevere Corey, in the second season episode \"There All the Honor Lies\" written by Peter David.\n\nBrown spoke about how welcoming the Star Trek production team was, her casting experience while changing agents, and meeting Aerosmith while filming \"Gambit\" in an interview with Starlog #226 (pp. 72-75).\n\nShe also made guest appearances on several other shows, including Beverly Hills, 90210 (1999, with Cari Shayne), Sliders (1999, starring Jerry O'Connell), JAG (1996 and 2000, with Rif Hutton and Kamala Lopez-Dawson in the latter one), Becker (1999, co-starring Terry Farrell), and Law & Order: Criminal Intent (2005). She later portrayed Tammy Tennis in All About Evil (2010, featuring Thomas Dekker, Jack Donner, and Zachary Culbertson).",
    "Image": "https://pbs.twimg.com/media/FKHtz5CUUAQAFyg.jpg"
  },
  {
    "Actor Name": "Kaitlin Hopkins",
    "Star Trek Roles": "1996 - Kilana - ST:DS9 S5:E2 (The Ship)\n2000 - Dala - ST:VOY S6:E21 (Live Fast and Prosper)",
    "Mini Bio": "Kaitlin Hopkins (born 1 February 1964; age 60) played Kilana in the Star Trek: Deep Space Nine fifth season episode \"The Ship\". She also appeared in the Star Trek: Voyager sixth season episode \"Live Fast and Prosper\" as Dala. She also portrayed The Doctor in that same episode when he was impersonating her character Dala. She was born on the same day as Steve Larson.\n\nOther television appearances include guest roles in Dr. Quinn, Medicine Woman (with Chad Allen, Barbara Babcock, Frank Collison, and Hélène Udy), Wings (with fellow Deep Space Nine guest star Steven Weber), The Practice (with Stan Ivar, Clancy Brown) and Spin City (with Alan Ruck).\n\nHer motion picture credits include Runaway Dreams (1989), Spirits (1992), Ted (1998, with Lee Arenberg) and Crocodile Dundee in Los Angeles (2001).",
    "Image": "https://images.prismic.io/star-trek-untold/MzVjZGQyOTEtMmVjMy00NmJkLTg2NjMtZjQ3ZTAwMzNjOWI4_a549b30ff8e5fec31c394ecc3096db4e.jpgitokzy7v1bac?auto=compress,format&rect=0,0,550,300&w=550&h=300"
  },
  {
    "Actor Name": "Karen Austin",
    "Star Trek Roles": "1996 - Kalandra - ST:DS9 S5:E4 (...Nor the Battle to the Strong)\n1999 - Miral, B'Elanna Torres' Mother - ST:VOY S6:E3 (Barge of the Dead)",
    "Mini Bio": "Karen Austin (born 24 October 1954; age 69) is an actress who appeared as Doctor Kalandra in the Star Trek: Deep Space Nine fifth season episode \"Nor the Battle to the Strong\" and Miral in the Star Trek: Voyager sixth season episode \"Barge of the Dead\".\n\nShe was among the contenders for the role of Kathryn Janeway, but was beaten out by first Geneviève Bujold, then Kate Mulgrew.\n\nShe was a regular on the first season of Night Court with John Larroquette and played Sister Ignaious in Steven Spielberg's \"Taken\" series in 2002.\n\nFrom 1995 to 1996, Austin starred in Live Shot. Other Star Trek stars who were also cast members include David Birney, Ron Canada, Jeff Yagher, Bruce McGill, and Sam Anderson. Star Trek stars who guest-starred include Casey Biggs, Chase Masterson, Dion Anderson, John Schuck, Lee Arenberg, Hal Landon, Jr., Cully Fredricksen, and Kenneth Tigar.",
    "Image": "http://immunology.8m.net/images/austin15.jpg"
  },
  {
    "Actor Name": "Larry Hankin",
    "Star Trek Roles": "1992 - Wind Dancer - STTNG S5:E20 (Cost of Living)\n1995 - Gaunt Gary - ST:VOY S1:E5 (The Cloud)\n1995 - Gaunt Gary - ST:VOY S1:E14 (Jetrel)\n1995 - Gaunt Gary - ST:VOY S2:E6 (Twisted)",
    "Mini Bio": "Larry A. Hankin (born 31 August 1940; age 84) is the actor who played Gaunt Gary in the Star Trek: Voyager episodes \"The Cloud\", \"Jetrel\" (credited as Larry Hankin), and \"Twisted\".\nHankin previously portrayed the wind dancer in the Star Trek: The Next Generation fifth season episode \"Cost Of Living\", for which he received no credit and was identified by the call sheet. He was not part of the principal photography for this episode and filmed his scene on second unit on Friday 28 February 1992 during the production of the episode \"Imaginary Friend\". For \"The Cloud\" he filmed his scenes on Tuesday 6 December 1994, for \"Jetrel\" on Wednesday 22 March 1995, and for \"Twisted\" between Monday 24 April 1995 and Friday 28 April 1995 on Paramount Stage 16.\n\nHankin was born in New York City. He studied acting at Syracuse University in Syracuse, New York, where he was in the same class as Star Trek: Deep Space Nine guest star Frank Langella. Along with fellow Voyager guest star Hamilton Camp, Hankin was a founding member of The Committee, a San Francisco-based improvisational comedy group. He was also a member of the improv comedy troupe, The Second City.\n\nHankin has been acting in television and film since the late 1960s. Outside of Star Trek, he is perhaps best known for his role as Charley Butts in the 1979 Paramount Pictures film Escape from Alcatraz (composed by Jerry Fielding) and for his recurring role as Mr. Heckles on NBC's Friends. In one Friends episode – \"The One Where Heckles Dies\" – Hankin co-starred with The Next Generation guest actor Michael G. Hagerty.\n\nIn addition to his recurring role on Friends, Hankin is well-remembered for his appearance on the comedy series Seinfeld, playing an actor who played Kramer in the fourth season episode, \"The Pilot\" (1993). In addition to series regular Jason Alexander, this episode featured Tony Amendola, Erick Avari, Lanei Chapman, Peter Crombie, Elizabeth Dennehy, Bill Erwin, Teri Hatcher, Gina Hecht, and Heidi Swedberg.",
    "Image": "https://preview.redd.it/larry-hankin-mr-heckles-in-star-trek-voyager-as-gaunt-gary-v0-7rx46213g0od1.jpg?width=740&format=pjpg&auto=webp&s=c217b22a005962c24c3006bd4082a78f7721262e"
  },
  {
    "Actor Name": "Lee Arenberg",
    "Star Trek Roles": "1993 - Gral - ST:DS9 S1:E10 (The Nagus)\n1993 - DaiMon Prak - STTNG S7:E9 (Force of Nature)\n1994 - DaiMon Bok - STTNG S7:E22 (Bloodlines)\n1999 - Pelk - ST:VOY S5:E21 (Juggernaut)\n2005 - Tellarite Ambassador Gral - ST:ENT S4:E12 (Babel One)\n2005 - Tellarite Ambassador Gral - ST:ENT S4:E13 (United)",
    "Mini Bio": "Lee Arenberg (born 18 July 1962; age 62) is an actor who played Gral in the Star Trek: Deep Space Nine first season episode \"The Nagus\", Prak in the Star Trek: The Next Generation seventh season episode \"Force of Nature\", Bok later that season in \"Bloodlines\", Pelk in the Star Trek: Voyager fifth season episode \"Juggernaut\", and Gral in the Star Trek: Enterprise fourth season episodes \"United\" and \"The Aenar\".\n\nFor \"Juggernaut\", Arenberg filmed his scenes between Monday 18 January 1999 and Monday 25 January 1999 on Paramount Stage 8, 9, and 16.\n\nBorn in Palo Alto, California, he appeared in numerous films and television series, ranging from Scrubs to CSI: Crime Scene Investigation. He also played Pintel, one of the sinister undead pirates in the films Pirates of the Caribbean: The Curse of the Black Pearl, Pirates of the Caribbean: Dead Man's Chest, and Pirates of the Caribbean: At World's End with co-star Vanessa Branch and stuntman Tom Morga.\n\nArenberg once guest-starred in Live Shot. Other Star Trek stars who were cast members include David Birney, Karen Austin, Ron Canada, Jeff Yagher, Bruce McGill, and Sam Anderson. Star Trek performers who also guest-starred include Casey Biggs, Chase Masterson, Dion Anderson, John Schuck, Hal Landon, Jr., Cully Fredricksen, and Kenneth Tigar. In two different seasons of Seinfeld, he appeared in the same role. Voyager guest Jason Alexander was on camera with him in the first episode he made. He recurred on ABC's Once Upon A Time as Grumpy/Leroy for its first six seasons. Arenberg also appeared on American Gods (2019, featuring Corbin Bernsen, Fionnula Flanagan, and Scott Thompson).",
    "Image": "https://subspacecommunique.com/sites/default/files/0410-general/lee-arenberg.jpg"
  },
  {
    "Actor Name": "Majel Barrett",
    "Star Trek Roles": "1966-1969 - Nurse Christine Chapel - ST:TOS\n1966-1969 - Enterprise Computer Voice - ST:TOS\n1979 - Dr. Chapel - Star Trek: The Motion Picture\n1986 - Commander Chapel - Star Trek IV: The Voyage Home\n1987-1994 - Lwaxana Troi - STTNG\n1987-1994 - Enterprise Computer Voice - STTNG\n1994 - Computer - Star Trek: Generations\n1996 - Computer - Star Trek: First Contact\n1993-1999 - Lwaxana Troi - ST:DS9\n1993-1999 - Federation Computer - ST:DS9\n1995-2001 - Voyager Computer Voice - ST:VOY\n2005 - Computer - ST:ENT S4:E19 (In a Mirror, Darkly: Part 2)\n2005 - Enterprise-D Computer - ST:ENT S4:E22 (These Are the Voyages...)\n2009 - Starfleet Computer - Star Trek",
    "Mini Bio": "Majel Barrett Roddenberry (23 February 1932 – 18 December 2008; age 76) was a recurring actress in the Star Trek franchise and was the wife of Star Trek creator Gene Roddenberry from 1969 until his death in 1991. This association with Roddenberry and his most famous creation has earned Barrett the title \"The First Lady of Star Trek\".\nBarrett was the only performer to have had a role on the first six Star Trek series – usually not as a character but as the voice of the various computers used throughout those series. She also supplied the voice of the Enterprise computer in five of the Star Trek films – spanning all three film series (Original Series, The Next Generation Series, and the Alternate Reality Series)\n\nHer most frequent portrayal in Star Trek, besides the computer, was that of Christine Chapel on Star Trek: The Original Series, Star Trek: The Animated Series, and in two of the films. She also voiced M'Ress and several other characters on The Animated Series and later played Betazoid Ambassador Lwaxana Troi on Star Trek: The Next Generation and Star Trek: Deep Space Nine. Her first filmed appearance was in the original Star Trek pilot episode \"The Cage\" as Number One in 1964.\n\nBarrett was born Majel Leigh Hudec in Cleveland, Ohio. She enrolled in an acting workshop when she was ten years old but later attended the University of Miami in Coral Gables, Florida with the intention of becoming a legal clerk. She attended law school for a year, but, after failing a class in contract law, opted to move to New York to try her luck in acting. She landed parts in several stage plays, including Models by Season and The Solid Gold Cadillac, the latter of which toured across the country for nine months. During this time, her father, a police officer in Cleveland, was killed while out on patrol. [1]\n\nBelieving the competition in New York to be too stiff, Barrett moved to California in the 1950s where she won parts in stage plays as well as films. She had a bit part in the 1957 film Will Success Spoil Rock Hunter?, after which she made an uncredited appearance in the 1958 Paramount Pictures release The Black Orchid. She then landed a supporting role in the 1958 Paramount film As Young As We Were, along with Original Series guest actor Barry Atwater. She also had a brief role in Paramount's The Buccaneer that same year.\n\nOne of Barrett's earliest television appearances came in 1959 in an episode of the syndicated adventure/drama series Whirlybirds, which starred Kenneth Tobey. She then made an uncredited appearance as a waitress in a 1960 episode of Desilu's The Untouchables, which aired on NBC. That same year, she guest-starred on the ABC family comedy series Leave It to Beaver, which starred Tony Dow.\n\nIn 1961, Barrett was seen in a supporting role in Paramount Pictures' Love in a Goldfish Bowl. This was followed by a supporting role in the 1963 war drama The Quick and the Dead. She also continued making appearances on television shows, including Cain's Hundred (with Anthony Caruso) and a 1962 episode of Bonanza with her future Original Series co-star James Doohan, entitled \"Gift of Water\".\n\nIn 1962, Barrett met actress Lucille Ball at an acting class and was signed to a contract with Desilu. Soon thereafter, she appeared with Lucy in an episode of Desilu's The Lucy Show.",
    "Image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2020/07/Lwaxana-Troi.jpg"
  },
  {
    "Actor Name": "Malachi Throne",
    "Star Trek Roles": "1966 - Commodore José Mendez - ST:TOS S1:E11 (The Menagerie: Part I)\n1966 - Commodore José Mendez - ST:TOS S1:E12 (The Menagerie: Part II)\n1991 - Senator Pardek - STTNG S5:E7 (Unification I)\n1991 - Senator Pardek - STTNG S5:E8 (Unification II)",
    "Mini Bio": "Malachi Throne (1 December 1928 – 13 March 2013; age 84) was an actor from New York who appeared in three episodes of Star Trek: The Original Series and two episodes of Star Trek: The Next Generation.\nThrone was Gene Roddenberry's first choice for the role of Doctor Phillip Boyce for the first Star Trek pilot, \"The Cage\", however he turned down the role not wanting to play \"the third man\" next to the hero and his sidekick. However, Throne expressed interest in playing Spock, but Leonard Nimoy was already contracted to play the part by then. Roddenberry finally offered him the chance to provide the voice for the Talosian Keeper (physically portrayed by Meg Wyllie), which Throne accepted. Almost two years later, Throne was cast as Commodore Mendez for the \"envelope\" portions of \"The Menagerie\" two-parter. His voice for The Keeper had to be electronically pitch-altered so the audience wouldn't recognize it as the same actor who played Mendez. (These Are the Voyages: TOS Season Two)\n\nAlong with Gene Lesser he submitted a story idea for Star Trek called \"The V.I.P.s\". It did not go beyond a few bits of correspondence back and forth. [1]\n\nHe was with Leonard Nimoy for both his first (the first Star Trek pilot, \"The Cage\") and last (the TNG episode \"Unification II\") Star Trek appearances on television. He also appeared with Leonard Nimoy in Mission: Impossible (1967, 1969, also with Lee Meriwether, Vic Perrin, Ed McCready, and Paul Sorensen), and the TV movie Assault on the Wayne (1971, also with Lloyd Haynes and William Windom).\n\nThrone filmed his scenes for \"The Menagerie\" between Tuesday 11 October 1966 and Tuesday 18 October 1966 on Desilu Stage 9 and 10. He filmed his scenes for the episodes \"Unification I\" and \"Unification II\" on Monday 9 September 1991, between Wednesday 11 September 1991 and Friday 13 September 1991, Tuesday 24 September 1991, and Thursday 26 September 1991 on Paramount Stage 9 and 16.\n\nAs a boy, he had success in a musical version of Tom Sawyer, and he would go on to train as an actor at Brooklyn College and Long Island University. In 1959, he left the stages of New York to try to make a career in film and television.\n\nIn 1965, Throne appeared in the Gene Roddenberry-produced unsold pilot Police Story, which also featured Steve Ihnat, Grace Lee Whitney, and DeForest Kelley. Between 1968 and 1969, Throne starred as \"Noah Bain\" on the series It Takes a Thief, which was produced by Gene Coon. The series featured guest stars Alfred Ryder, George Sawaya, Meg Wyllie, Rosemary Forsyth, Keye Luke, Robert Ito, Mark Lenard, Peter Brocco, Steve Ihnat, Lawrence Montaigne, Roger C. Carmel, Yvonne Craig, Ricardo Montalban, John Hoyt, Erik Holland, Brock Peters, George Takei, Michael Ansara, Terri Garr, Sally Kellerman, Anthony Caruso, Julie Newmar, Joseph Bernard, Whit Bissell, Kenneth Tobey, and William Campbell.",
    "Image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj0GCty74zFSHMNInAWwadfEG6iZEnBEaonbchHkG1-YyPuUx7XnSu_cVT0sUaQdXkwmb_TOFRGNjOGUoc67E9jPK5Sd1mX-gcKm93OKyRCHcKEXWaDQf7a1kbCd5dpXC608BZ645GWgp55/s1600/Commodore+Mendez.jpg"
  },
  {
    "Actor Name": "Marc Alaimo",
    "Star Trek Roles": "1987 - Badar N'D'D - ST:TNG S1:E6 (Lonely Among Us)\n1988 - Commander Tebok - ST:TNG S1:E25 (The Neutral Zone)\n1991 - Gul Macet - ST:TNG S4:E12 (The Wounded)\n1992 - Frederick LaRouque - ST:TNG S5:E26 (Time's Arrow: Part 1)\n1993-1999 - Gul Dukat - ST:DS9",
    "Mini Bio": "Marc Alaimo (born 5 May 1942; age 82) is the actor who played Gul Dukat in Star Trek: Deep Space Nine. He also voiced the role in the video game Star Trek: Deep Space Nine - Dominion Wars. Alaimo also appears in the documentary What We Left Behind.\nBefore landing in the role of Dukat, Alaimo played several other characters in Star Trek. He holds the honor of playing one of the first two Romulans seen in the Star Trek: The Next Generation era as well as the first Cardassian seen in the Star Trek saga. Nicknamed \"The Neck\" for his prominent neck muscles, Alaimo influenced makeup supervisor Michael Westmore's design of the Cardassian makeup, as Westmore based the race's neck ridges on Alaimo's physique.\n\nSeveral costumes worn by Alaimo in Star Trek were sold off on the It's A Wrap! sale and auction on eBay, including his Breen suit from the episode \"Indiscretion\", which was later worn by background performer Todd Slayton. [1](X)\n\nBorn in Milwaukee, Wisconsin as Michael Joseph Alaimo , he started his acting career with the Marquette University Players and the Milwaukee Repertory Theater in the 1960s. Making his homebase New York City, he performed with various theatre companies in New York and with touring companies across the country. While in New York in 1971, he acquired his first television role, playing the recurring character of Frank Barton during the 1971-1972 season of the soap opera The Doctors. He followed that up with a recurring role on another soap, Somerset, from 1972-1973. Alaimo is not the only Star Trek veteran to perform on the soap opera Somerset. Others include Bibi Besch, Nicholas Coster, Bruce Gray, DS9 co-star Barry Jenner, Mark Lenard, Michael Nouri, Percy Rodriguez, and Tucker Smallwood. However, all had either left or were not yet members of the cast during Alaimo's brief tenure.",
    "Image": "https://scifiandtvtalk.typepad.com/.a/6a01348361f24a970c01543214034a970c-600wi"
  },
  {
    "Actor Name": "Marc Lawrence",
    "Star Trek Roles": "1989 - Volnath - STTNG S3:E9 (The Vengeance Factor)\n1999 - Mr. Zeemo - ST:DS9 S7:E15 (Badda-Bing, Badda-Bang)",
    "Mini Bio": "Marc Lawrence (17 February 1910 – 28 November 2005; age 95) was a character actor who guest-starred as Volnoth in the Star Trek: The Next Generation third season episode \"The Vengeance Factor\" and Carl Zeemo in the Star Trek: Deep Space Nine seventh season episode \"Badda-Bing, Badda-Bang\".\n\nLawrence appeared in over two hundred films and television series dating back to 1932. His brooding, sinister appearance often got him cast in the role of villains, especially gangsters and mob bosses – roles which he played throughout his entire career, from his uncredited appearance in 1932's If I Had a Million to the 1996 TV movie Gotti. He even played three different gangster roles on the TV series The Untouchables. He was not always cast in such roles, however; he received much praise for his performance as a mute in The Shepherd of the Hills (1941 film)|The Shepherd of the Hills}} (1941, starring John Wayne]]). However, he is probably best remembered for playing Kloppman in the 1992 film Newsies (also featuring Frank Novak and Kevin Tighe).\n\nHis extensive film credits also include Johnny Apollo (1940, with Anthony Caruso), This Gun for Hire (1942, with Richard Webb), The Ox-Bow Incident (1943), Dillinger (1945, with Elisha Cook and Lawrence Tierney), Cloak and Dagger (1946), Key Largo (1948), The Asphalt Jungle (1950, with Anthony Caruso), Helen of Troy (1956, directed by Robert Wise), Custer of the West (1967, with Jeffrey Hunter and Lawrence Tierney), Krakatoa, East of Java (1969, with Brian Keith), Marathon Man (1976, with Fritz Weaver), Goin' Coconuts (1978, with Kenneth Mars and Ted Cassidy), Hot Stuff (1979, with Raymond Forchion), The Big Easy (1987), Blood Red (1989, with John de Lancie), Newsies (1992, with Frank Novak), From Dusk till Dawn (1996), and End of Days (1999, with Mark Margolis and Jack Shearer).",
    "Image": "https://soulrideblog.com/wp-content/uploads/2019/02/10000.jpg"
  },
  {
    "Actor Name": "Mark Lenard",
    "Star Trek Roles": "1966 - Romulan Commander - ST:TOS S1:E14 (Balance of Terror)\n1967 - Sarek - ST:TOS S2:E10 (Journey to Babel)\n1979 - Klingon Captain - Star Trek: The Motion Picture\n1984 - Sarek - Star Trek III: The Search for Spock\n1986 - Sarek - Star Trek IV: The Voyage Home\n1990 - Sarek - STTNG S3:E23 (Sarek)\n1991 - Sarek - STTNG S5:E7 (Unification I)\n1991 - Sarek - Star Trek VI: The Undiscovered Country",
    "Mini Bio": "Mark Lenard (15 October 1924 – 22 November 1996; age 72) was an American actor best known for his role as Sarek in the Star Trek: The Original Series second season episode \"Journey to Babel\", Star Trek III: The Search for Spock, Star Trek IV: The Voyage Home, Star Trek VI: The Undiscovered Country and the Star Trek: The Next Generation third and fifth season episodes \"Sarek\" and \"Unification I\". He also voiced the role in the Star Trek: The Animated Series first season episode \"Yesteryear\".\n\nBefore he was cast as Sarek, Lenard played the first major Romulan character seen on Star Trek, the Romulan commander in the TOS first season episode \"Balance of Terror\". As such, Lenard is often credited as being the first ever Romulan to appear in Star Trek; however, by strict order of screen appearance, that honor falls to Lawrence Montaigne as Decius, who appeared seconds before Lenard but was wearing a helmet covering his Romulan ears. Lenard was the first Romulan to be fully seen with Vulcan-type ears.\n\nLenard filmed his scenes for \"Balance of Terror\" on Wednesday 27 July 1966 and Thursday 28 July 1966 at Desilu Stage 9. He filmed his scenes for \"Journey to Babel\" between Monday 25 September 1967 and Thursday 28 September 1967 at Stage 9.\n\nLenard and Montaigne were at one point considered as a replacement for Spock had Leonard Nimoy not returned for the second season of Star Trek: The Original Series if contract negotiations had fallen through. [1](X) [2] Lenard was also the first choice to portray Abraham Lincoln in \"The Savage Curtain\", but was unavailable due to a regular role on the series Here Come the Brides. [3]\n\nLenard also became the first actor to play a Klingon with forehead ridges (and the first to speak the Klingon language) when he appeared as the Klingon Captain of the IKS Amar in Star Trek: The Motion Picture. Lenard had actually requested to reprise his role as Sarek for this film, but when his request was declined, he was offered the role of the Klingon captain instead.\n\nIn 1991 Lenard appeared for the last time as Sarek in the Star Trek: The Next Generation fifth season episode \"Unification I\". He arrived on Monday 23 September 1991 in Los Angeles and the transportation department picked him up at the airport. On the next day, Tuesday 24 September 1991, he had a wardrobe fitting at 9:00 am and was picked up at his hotel at 8:30 am Lenard finally filmed his scenes on Wednesday 25 September 1991 at Paramount Stage 16, was picked up at the hotel at 5:15 am, had a make up call at 5:30 am and a set call at 8:30 am.",
    "Image": "https://images.prismic.io/star-trek-untold/ZTU3MGUwY2QtMzdkMy00NzgyLWE2M2YtMWYyZTIxMzgyOGM4_3c7781a36bcd6cf08c11a970fbe0e2a6.jpg?auto=compress,format&rect=0,0,620,260&w=620&h=260"
  },
  {
    "Actor Name": "Martha Hackett",
    "Star Trek Roles": "1994 - T'Rul - ST:DS9 S3:E1 (The Search: Part 1)\n1994 - T'Rul - ST:DS9 S3:E2 (The Search: Part 2)\n1995-1996 - Seska - ST:VOY\n2001 - Seska - ST:VOY S7:E11 (Shattered)",
    "Mini Bio": "Martha Hackett (born 21 February 1961; age 63) is an actress from Needham, Massachusetts, best known for her role of Seska on thirteen episodes of Star Trek: Voyager. She also appeared in two episodes of Star Trek: Deep Space Nine as a Romulan, portrayed a character in a deleted scene of the Star Trek: The Next Generation finale, and provided her voice in five video games.\nShe won a Dramalogue Award for her acting in the theatrical production Barbarians and has appeared in King Lear, The Revenger's Tragedy, Tom Walker (2001), and Happy End (2005).\n\nHer entry into the Star Trek universe came when she auditioned for the role of Jadzia Dax on Deep Space Nine. Although she didn't end up getting the part, which went to Terry Farrell, the producers did like something about her and she was called back to play the Terrellian pilot Androna in the Next Generation seventh season episode \"All Good Things...\" Unfortunately, her storyline was cut from the final production. An image of her was printed in the Star Trek Monthly issue 26 and her costume from this appearance was sold off on the It's A Wrap! sale and auction on eBay. [1](X)\n\nA few months later she was called in to play Sub-Commander T'Rul, a Romulan on Deep Space Nine, in the episodes \"The Search, Part I\" and \"The Search, Part II\". It was then a director called her, saying they wanted her for a role coming up later that season, on the new Trek series Voyager.\n\nWhen brought aboard to play Seska, she was promised a recurring role though there was no guarantee of the number of episodes, and the writer had not fully figured out her character yet. All she was told about the character was that \"she was a member of the Maquis, and she's not so happy with Janeway.\" It wasn't until her fourth appearance in \"State of Flux\" that she knew Seska was \"more than a little unhinged,\" and she was perfectly fine with the fact her character was a villain. Said Hackett, \"I had a lot of sympathy for her. As an actor, you have to look at it from your character's point of view, even if your character is a murderer.\" (citation needed • edit)\n\nIn 1995, Hackett found out that she was pregnant. Unsure about how this would affect her future on the show, she went to tell them and was told, \"Wow! We're writing it in anyway.\" So she was very pleased at the interesting coincidence. Pleased after receiving the initial script for \"Basics, Part II\" in which Maje Culluh and her baby die, while she escapes in a pod 'to live to fight Voyager another day,' she was later disappointed at the rewrites (and eventually final) script where she died, and both of the others lived. But overall she was pleased with how Seska eventually turned out.",
    "Image": "https://images.squarespace-cdn.com/content/v1/5d2c1cedb84a8f0001e2be34/1563763670699-E7UE3E29R5E0DSHLEHZO/Martha_Hackett_StarTrek?format=750w"
  },
  {
    "Actor Name": "Max Grodénchik",
    "Star Trek Roles": "1990 - Sovak - STTNG S3:E19 (Captain's Holiday)\n1992 - Par Lenor - STTNG S5:E21 (The Perfect Mate)\n1993-1999 - Rom - ST:DS9\n1998 - Alien Ensign - Star Trek: Insurrection",
    "Mini Bio": "Max Grodénchik (born 12 November 1952; age 71) also credited as Michael Grodénchik, is an actor best known for his portrayal of Rom on Star Trek: Deep Space Nine.\nGrodénchik was born in Queens, New York. Before getting the role of Rom, he auditioned for the role of Rom's brother, Quark. He was at one time romantically involved with production staff associate Lolita Fatjo.\n\nHe wrote and performed Rom's Song and performed the song \"The Lady is a Tramp\" in the Deep Space Nine seventh season episode \"The Siege of AR-558\". He also appeared in Star Trek: Insurrection as a Trill ensign who made a joke with Jonathan Frakes' character; that scene was deleted from the released version but included in the Star Trek: Insurrection (Special Edition) DVD \"deleted scenes\" feature, where it can be found as scene #40 \"Flirting\". His name, however, remained in the end credits of the film and the scene was retained in the novelization of Star Trek: Insurrection. Grodénchik filmed his scenes for the Star Trek: The Next Generation fifth season episode \"The Perfect Mate\" between Tuesday 18 February 1992 and Thursday 20 February 1992 on Paramount Stage 8 and 9.\n\nGrodénchik made his first on-screen appearances as Michael Grodénchik in the '80s. He played a small role in the 1981 comedy Chu Chu and the Philly Flash, alongside the late Vincent Schiavelli, as well as in the drama Out (1982) and in the Night Court episode \"The Cop and the Lady\" (1989, with cast member John Larroquette).",
    "Image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/08/star-trek-ds9-rom-max-grodenchik.jpg"
  },
  {
    "Actor Name": "Merritt Butrick",
    "Star Trek Roles": "1982 - Dr. David Marcus - Star Trek II: The Wrath of Khan\n1984 - Dr. David Marcus - Star Trek III: The Search for Spock\n1988 - T'Jon - STTNG S1:E21 (Symbiosis)",
    "Mini Bio": "Merritt Butrick (3 September 1959 – 17 March 1989; age 29) was the American actor best known for his role as Dr. David Marcus in Star Trek II: The Wrath of Khan and Star Trek III: The Search for Spock; while a photo of him appeared in Star Trek VI: The Undiscovered Country, two years after his death. He later played T'Jon in the Star Trek: The Next Generation first season episode \"Symbiosis\". Footage of this character was later used four months after his death in the second season episode \"Shades of Gray\".\n\nButrick made his professional debut appearing as a rapist in two episodes of Hill Street Blues in 1981. James B. Sikking, Barbara Babcock, and Barbara Bosson were regulars on this series. Robert Butler, who previously directed the first Star Trek pilot, directed both of Butrick's episodes.\n\nButrick next appeared in NBC's Splendor in the Grass (1981, with Cyril O'Reilly, Graham Jarvis, and K Callan). He also made an appearance on CHiPs that same year, working with Gary Graham, Claudette Nevins, and series regular Robert Pine.\n\nIn 1982, Butrick was cast as New Wave music-loving high school student John Ulasewicz, aka \"Johnny Slash\", in CBS' Square Pegs which aired for one season from September 1982 through March 1983. Butrick then had a supporting role in the NBC TV movie When Your Lover Leaves, along with Dwight Schultz.",
    "Image": "https://images.squarespace-cdn.com/content/v1/5cc3d1b051f4d40415789cc2/1615969419614-08UZXXQIUQJJJ32TCCIX/merritt-butrick-star-trek-ii.png"
  },
  {
    "Actor Name": "Michael Dorn",
    "Star Trek Roles": "1987-1994 - Lieutenant/Commander Worf - STTNG\n1991 - Klingon Defense Attorney - Star Trek VI: The Undiscovered Country\n1994 - Worf - Star Trek: Generations\n1995-1999 - Lt. Commander Worf - ST:DS9\n1996 - Worf - Star Trek: First Contact\n1998 - Worf - Star Trek: Insurrection\n2002 - Worf - Star Trek: Nemesis",
    "Mini Bio": "Michael Dorn (born 9 December 1952; age 71), born Michiel Dorn, is an actor, director, producer, and writer best known for his portrayal of Worf on Star Trek: The Next Generation, Star Trek: Deep Space Nine, and in four Star Trek films. He also portrayed Worf's namesake, Colonel Worf, in Star Trek VI: The Undiscovered Country. Stated Robert Hewitt Wolfe, \"Michael Dorn's a great guy and a terrific actor.\"\n\nDorn was born in Luling, Texas, but he grew up in Pasadena, California. He studied radio and television production at the Pasadena City College, after which he pursued a career in music.\n\nDorn is an accomplished pilot and owns and operates an old Air Force T-33 trainer jet, one of the first jet aircraft in the US inventory; it is often referred to as his \"starship.\" He also owns an old F-86 Sabre jet that he acquired from the South African Air Force. He has flown with the Blue Angels and the Thunderbirds, the USAF Precision Flight team.\n\nDorn's favorite episodes of TNG are \"The Drumhead\" and \"The Offspring\". [1]\n\nDorn cites the Star Trek: Deep Space Nine episodes \"Soldiers of the Empire\" and \"Once More Unto the Breach\" as his inspiration for a new series based on Worf: \"When I saw those episodes, it really lit a fire under me, that it was great writing – they were written by Ron Moore – and it was wonderfully acted in terms of all the Klingon characters and the things that were at stake. And even though they’re not Human, the Human condition that showed up in all these characters, it really was like, 'there’s a series here.' That’s what first started it\". \n\nMichael Dorn was aware of Star Trek: The Original Series during his childhood. \"I liked the show when I was growing up,\" he recalled. (Captains' Logs: The Unauthorized Complete Trek Voyages, p. 143) Dorn also said of the original series' regular cast, \"I grew up with those guys.\" (Star Trek: The Magazine Volume 3, Issue 9, p. 19)\n\nOn his audition for Worf, Dorn commented, \"I did not wear makeup, but I took on the psychological guise of a Klingon. I walked into Paramount in character. No jokes. No laughing with the other actors. I sat by myself waiting for my interview. When my turn came, I walked in, didn't smile, did the reading, thanked them, and walked right out.\" (Star Trek: The Next Generation Companion, 2nd ed., p. 20) Dorn was the last of the main actors who was cast. (TNG Season 1 DVD special feature \"Selected Crew Analysis\"-\"Casting\")\n\nFrom his first appearance in TNG's first season episode, \"Encounter at Farpoint\", to his latest in Star Trek Nemesis, Dorn has appeared more times as a regular cast member than any other actor of the Star Trek franchise, spanning five movies and 272 television episodes. Dorn has also directed three episodes of DS9 and the Star Trek: Enterprise episode \"Two Days and Two Nights\".\n\nBetween the fourth and fifth seasons of Star Trek: The Next Generation, Dorn played Colonel Worf in Star Trek VI: The Undiscovered Country. Although the relationship was not stated on screen, the filmmakers' intention was that the Star Trek VI character was the grandfather of the Next Generation character.",
    "Image": "https://gizmodo.com/app/uploads/2021/01/yzsvinvyxxjl2slctdnh.jpg"
  },
  {
    "Actor Name": "Paul Winfield",
    "Star Trek Roles": "1982 - Captain Clark Terrell - Star Trek II: The Wrath of Khan\n1991 - Captain Dathon - STTNG S5:E2 (Darmok)",
    "Mini Bio": "Paul Winfield (22 May 1939 – 7 March 2004; age 64) was an actor who played Clark Terrell in Star Trek II: The Wrath of Khan and Dathon in the Star Trek: The Next Generation fifth season episode \"Darmok\".\nWinfield filmed his scenes for \"Darmok\" between Tuesday 23 July 1991 and Friday 26 July 1991 on Paramount Stage 9, Paramount Stage 16, and on location at Bronson Canyon. For his two day location shooting, he was picked up at home at 2:45 am and 6:45 am and brought to the studio where he received his make up from Michael Westmore, Gerald Quist, and Ed French before he was brought to location.\n\nWinfield appeared in roughly 125 films and television shows. Among the roles for which he is known are his Academy Award-nominated portrayal of a Depression-era Louisiana sharecropper in the 1973 film Sounder and his Emmy Award-nominated performance as Dr. Martin Luther King in the 1978 mini-series King. He is also known for his supporting roles in such films as The Terminator and Mars Attacks! and for narrating the A&E series City Confidential.\n\nWinfield is one of only four Star Trek alumni to have been nominated for the Academy Award in the Best Actor in a Leading Role category. The others were F. Murray Abraham, Frank Langella, and Benedict Cumberbatch; thus far, Abraham is the only one to win the award.\n\nIn his afterword in the novelization of Far Beyond the Stars, Steven Barnes noted that Winfield's film characters tended not to survive and that they usually died to protect white characters. Barnes commented: \"Poor Paul Winfield actually made a career out of dying in SF movies. Wrath of Khan (protecting William Shatner), Terminator (protecting Linda Hamilton), Serpent and the Rainhow (protecting Bill Pullman) and, most insultingly, in Damnation Alley. Oh, I remember watching that movie. In fact, I'll never forget it\".",
    "Image": "https://www.looper.com/img/gallery/star-trek-actors-you-may-not-know-passed-away/paul-winfield-captain-terrell-dathon-1706527524.jpg"
  },
  {
    "Actor Name": "Phil Morris",
    "Star Trek Roles": "1966 - Boy - Army Helmet - ST:TOS S1:E8 (Miri)\n1984 - Trainee Foster - Star Trek III: The Search for Spock\n1996 - Thopok - ST:DS9 S5:E3 (Looking for par'Mach in All the Wrong Places)\n1997 - Remata'Klan - ST:DS9 S6:E2 (Rocks and Shoals)\n1999 - Lieutenant John Kelly - ST:VOY S6:E8 (One Small Step)",
    "Mini Bio": "Phil Morris (born 4 April 1959; age 65) is an actor who played a Miri native in the Star Trek: The Original Series first season episode \"Miri\", Cadet Foster in Star Trek III: The Search for Spock, Thopok in the fifth season episode \"Looking for par'Mach in All the Wrong Places\", Remata'Klan in the Deep Space Nine sixth season episode \"Rocks and Shoals\", and John Kelly in the Star Trek: Voyager sixth season episode \"One Small Step\".\n\nMorris is the son of the late Greg Morris, who played Barney Collier on the 1960s-70s spy series Mission: Impossible, which was filmed at the same studio where The Original Series (and, specifically, the Phil Morris episode, \"Miri\") was filmed and featured Leonard Nimoy for two seasons. His sister is Iona Morris. Morris is often identified in \"Miri\" as a boy in a green helmet with a gold shield; however, this is a different child actor. His role was uncredited.",
    "Image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi8gi0GlzkWC7jAWwuisW9PzxoH9d0ztQUg0XP7pL29WCSB3ZAsfgB1YI_sBqM64hBJaJFh3SpzBsQ7fFUeph47XexH5MHJny22vtfsCj4NLHON1XKOvooy4cC-Nej4lmuxl1OzFzKuAVE/s1600/phil-morris_startrek.jpg"
  },
  {
    "Actor Name": "Randy Oglesby",
    "Star Trek Roles": "1989 - Scholar / Artist - STTNG S2:E5 (Loud as a Whisper)\n1993 - Ro-Kel - ST:DS9 S1:E11 (Vortex)\n1993 - Ah-Kel - ST:DS9 S1:E11 (Vortex)\n1997 - Silaran - ST:DS9 S5:E11 (The Darkness and the Light)\n1998 - Kir - ST:VOY S5:E10 (Counterpoint)\n2001 - Trena'L - ST:ENT S1:E5 (Unexpected)\n2003-2004 - Degra - ST:ENT",
    "Mini Bio": "Randy Oglesby (born 31 August 1948; age 76), also credited as Thomas Oglesby, is an actor who has portrayed seven different Star Trek characters, most notably Degra on Star Trek: Enterprise. He is one of only six actors to do so, the others being Jeffrey Combs, J.G. Hertzler, Vaughn Armstrong, Brent Spiner and Thomas Kopache.\nOglesby has also guest-starred in numerous other television series, including L.A. Law, The X Files, and ER (starring Eriq La Salle, with James Cromwell). He also appeared in Angel, Cold Case, and JAG (2002 and 2005). He has also starred Boston Legal (starring William Shatner, René Auberjonois, and John Larroquette) and had a recurring role in Vanished. In 2007, he appeared in General Hospital, before earning another recurring role on Dirt. He later appeared in True Blood, Lie to Me, Bones, and NCIS.\n\nOglesby has also had some film roles, most notably as Mike Dodge in Independence Day (1996) and as Detective Bryson in Liar Liar (1997). Other roles include a strategic analyst in Pearl Harbor (2001), Lieutenant Colonel List in We Were Soldiers (2002, uncredited), and a harvest surgeon in The Island (2005), alongside Ethan Phillips and Michael Clarke Duncan.",
    "Image": "https://i.pinimg.com/originals/9d/ef/50/9def5086ef87817ea135e5c246b035ca.jpg"
  },
  {
    "Actor Name": "Rene Auberjonois",
    "Star Trek Roles": "1991 - Colonel West - Star Trek VI: The Undiscovered Country\n1993-1999 - Odo - ST:DS9\n2002 - Ezral - ST:ENT S1:E20 (Oasis)",
    "Mini Bio": "René Auberjonois (1 June 1940 – 8 December 2019; age 79) was the actor best known for portraying Chief of Security Odo on Star Trek: Deep Space Nine. He also directed many episodes of the series. Prior to assuming the role of Odo, he appeared as Colonel West in Star Trek VI: The Undiscovered Country, although his scenes were initially cut for the film's theatrical release. In addition, he made a guest appearance as Ezral in the Star Trek: Enterprise first season episode \"Oasis\". His costume from the Deep Space Nine episode \"Children of Time\" was sold off on the It's A Wrap! sale and auction on eBay. [1](X) Auberjonois was also briefly considered to portray The Doctor in Star Trek: Voyager. \n\nAuberjonois was born in New York City on 1 June 1940. His father, Fernand Auberjonois, was a journalist, and his grandfather, also called René Auberjonois, a Swiss painter. His mother was Princess Laure Murat, who was descended from Joachim Murat, one of Napoleon Bonaparte's marshals and one-time King of Naples, and husband of Caroline Bonaparte, Napoleon's youngest sister.\n\nActor Armin Shimerman, who played Odo's nemesis Quark on DS9, was a close friend of Auberjonois. They acted in a play together prior to DS9 and spent many hours together in make-up chairs while starring in DS9.\n\nAuberjonois initially disliked DS9's season three premiere, \"The Search, Part I\", in which his orphan character, Odo, met his people, the Founders, for the first time and discovered his origin. Auberjonois felt part of Odo's mystery and vitality as a character stemmed from his not knowing where he came from. However, Auberjonois soon came to like the development because new twists were added as more was learned about Odo's past – whether Odo's loyalties would reside with the Founders and leaders of the Dominion or with the Federation, and whether others would trust Odo during the Dominion War added complexity to his character even after his origin was established. (DS9 Season 3 DVD special features)\n\nAuberjonois died in December 2019 of metastatic lung cancer. He is the first regular actor on a Star Trek spinoff series to pass away.",
    "Image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/01/rene-auberjonois-odo-changeling-star-trek-ds9.jpg"
  }
]