[
  {
    "Actor Name": "Andreas Katsulas",
    "Star Trek Roles": "1989 - Commander Tomalak - STTNG S3:E7 (The Enemy)\n1990 - Commander Tomalak - STTNG S3:E10 (The Defector)\n1990 - Commander Tomalak - STTNG S4:E8 (Future Imperfect)\n1994 - Commander Tomalak - STTNG S7:E25 (All Good Things...)\n2003 - Vissian Captain Drennik - ST:ENT S2:E22 (Cogenitor)",
    "Mini Bio": "Missouri-born actor Andreas Katsulas (18 May 1946 – 13 February 2006; age 59) is best known to Star Trek fans for playing the recurring character of Romulan Commander Tomalak on Star Trek: The Next Generation. He also played Vissian Captain Drennik in the Star Trek: Enterprise second season episode \"Cogenitor\".\nOut of his four appearances as Tomalak, he appeared on a viewscreen in three of them. He once commented: \"I felt much more comfortable when he was an incredible giant on a screen, just a face. Suddenly when I had to account for everything else, I didn't feel support and nothing was supporting what I was doing. I was happy not to recur unless it would have gone back to a screen character\". (Captains' Logs: The Unauthorized Complete Trek Voyages)\n\nKatsulas is best known for his role as Ambassador G'Kar on J. Michael Straczynski's Babylon 5. Claudia Christian, Bill Mumy, Patricia Tallman, Caitlin Brown, and Mary Kay Adams also starred in the series, which ran from 1994 through 1998. Walter Koenig had a recurring role on the series.\n\nKatsulas' most recognized film role is that of the murderous one-armed man in the 1993 thriller The Fugitive, based on the classic series of the same name. Fellow Next Generation guest star Daniel Roebuck also had a role in the film, as did Richard Riehle and Danny Goldring.\n\nOne of his earliest film appearances came in Ragtime (1981, featuring Brad Dourif, Robert Joy, and Ethan Phillips. The following year, he appeared in the made-for-TV movies A Midsummer Night's Dream, based on William Shakespeare's play and co-starring Steve Vinovich, and A Very Delicate Matter, with Zach Galligan. Katsulas would again appear with Galligan (as well as Erick Avari and Lawrence Tierney) in Nothing Lasts Forever (1984). This was followed with roles in such films as Someone to Watch Over Me (1987, with Daniel Hugh Kelly, Mark Moses, and John Rubinstein), Sunset (1988, starring Malcolm McDowell), Next of Kin (1989, with Michael J. Pollard), True Identity (1991, co-starring Frank Langella and Michael McKean), and Hot Shots! Part Deux (1993, with Miguel Ferrer and Gregory Sierra). He also played the villain in Stuart Baird's Executive Decision (1996, featuring Brad Blaisdell, Tim Kelleher, Warren Munson, Richard Riehle, and Dey Young).\n\nOutside of his appearances on Trek, Katsulas guest-starred on numerous other TV series. One of his earliest was a 1982 episode of General Hospital, along with Deborah May. He followed this with two appearances on Max Headroom along with series regulars Matt Frewer, W. Morgan Sheppard, and Concetta Tomei and fellow guest-star Charles Rocket. He also appeared in episodes of The Equalizer (with Daniel Davis, Robert Lansing, and Keith Szarabajka), Alien Nation (starring Gary Graham, Eric Pierpoint, Michele Scarabelli and Ron Fassler and guest starring Sam Anderson, Joel Swetow and Craig Richard Nelson), Murder, She Wrote (with Bruce Gray, Stephen Macht, David Soul, and William Windom), Millennium (starring Terry O'Quinn), and NYPD Blue (with Daniel Benzali, Gordon Clapp, William Dennis Hunt, and Don Stark). Among the made-for-TV movies in which he appeared include The Neon Empire (1989, with Natalia Nogulich) and The Death of the Incredible Hulk (1990, with Barbara J. Tarbuck).\n\nKatsulas, a heavy smoker, was diagnosed with inoperable lung cancer in early 2005. He lost his battle with the disease on February 13, 2006, at the age of 59. His appearance on Enterprise was among his last television appearances.",
    "Image": "https://www.andreaskatsulas.com/gallery/pics/andr34..jpg"
  },
  {
    "Actor Name": "Ann Gillespie",
    "Star Trek Roles": "1989 - Ensign Hildebrant - STTNG S2:E15 (Pen Pals)\n1993 - Nurse Jabara - ST:DS9 S1:E4 (Babel)\n1994 - Nurse Jabara - ST:DS9 S2:E22 (The Wire)\n1995 - Nurse Jabara - ST:DS9 S3:E13 (Life Support)\n1995 - Nurse Jabara - ST:DS9 S3:E18 (Distant Voices)",
    "Mini Bio": "Ann H. Gillespie (born 8 August 1957; age 67) is an actress who played two Star Trek roles, with her largest being the recurring character of Nurse Jabara, whom she played four times in the first three seasons of Star Trek: Deep Space Nine. Gillespie had earlier portrayed Ensign Hildebrant in the Star Trek: The Next Generation second season episode \"Pen Pals\". In 1984, Gillespie married the future fellow Next Generation and Star Trek: Voyager guest actor Jeff Allin. [1]\n\nShe is probably best known for her recurring role as Jackie Taylor in Beverly Hills, 90210, whom Gillespie played throughout the series' ten year run. Her career on 90210 had her working alongside Michael Durrell, Stanley Kamel, Kerrie Keane, Dina Meyer and Noley Thornton. From 2008 to 2009, Gillespie reprised her role as Jackie Taylor in six episodes of its successor 90210.\n\nGillespie also guest starred in Happy Days, Matlock (with Corbin Bernsen and Granville Van Dusen), Hunter (with Leslie Bevis) and 7th Heaven (starring Stephen Collins and Catherine Hicks).\n\nGillespie received a BA degree from Goddard College in 2003. She is also an Episcopal priest, and uses the names Mother Ann Gillespie and Rev. Ann Gillespie.",
    "Image": "https://img.seriebox.com/people/47/47458/ann-gillespie_min225.jpg"
  },
  {
    "Actor Name": "Anne Haney",
    "Star Trek Roles": "1989 - Rishon Uxbridge - STTNG S3:E3 (The Survivors)\n1993 - Renora - ST:DS9 S1:E7 (Dax)",
    "Mini Bio": "Anne Haney (4 March 1934 – 26 May 2001; age 67)[1] was the actress who played Rishon Uxbridge in the Star Trek: The Next Generation third season episode \"The Survivors\" and Els Renora in the Star Trek: Deep Space Nine first season episode \"Dax\".\n\nHaney was a regular on Mama's Family from 1986 through 1989, and had a recurring role as Judge Marilyn Travelini on L.A. Law from 1986 through 1994. She also appeared in two episodes of Quantum Leap, starring Scott Bakula from Star Trek: Enterprise, the former starring Parley Baer and the latter with Hal Landon, Jr. and Patrick Massett. She also appeared with Andrew Robinson in the 1981 failed television pilot, Big Bend Country which was directed by Ralph Senensky.\n\nHer feature film credits include K-9000 (1991; with Judson Scott, David Renan, Ted Barba, James H. Burk, Kenny Endoso, Jeff Imada, Dave Perna, and Nicholas Shaffer, and with stunts by Greg Barnett and Lane Leavitt), Mrs. Doubtfire (1993, with William Newman), The American President (1995), and Liar Liar (1997), which also featured Mitchell Ryan, Ernest Perry, Jr., and Eric Pierpoint. She co-starred in Roses Are for the Rich (1987, featuring Star Trek: Voyager stars Kate Mulgrew and Robert Picardo).\n\nShe appeared in Psycho (1998, featuring Ken Jenkins and Roy Brocksmith). Her \"Survivors\" co-star John Anderson played the car salesman in the original version.\n\nShe also guest-starred in an episode of The Golden Girls with Robert Picardo and Bill Quinn.\n\nAt the age of 67, Haney died of congestive heart failure at her home in Studio City, Los Angeles, California. [2]",
    "Image": "https://imgcdn.stablediffusionweb.com/2024/4/19/b291b32e-c0c6-4ad4-b18b-15fc2f6ae8de.jpg"
  },
  {
    "Actor Name": "Annette Helde",
    "Star Trek Roles": "1995 - Karina - STTNG S3:E17 (Visionary)\n1996 - Guard - Star Trek: First Contact\n1997 - Takar - ST:VOY S4:E7 (Scientific Method)\n1998 - Lt. Nadia Larkin - ST:DS9 S7:E8 (The Siege of AR-558)",
    "Mini Bio": "Annette Helde (born 14 November 1956; age 67) is an actress who appeared in two Star Trek spin-off series and in Star Trek: First Contact. In addition she portrayed a character in the 1996 video game Star Trek: Klingon.\nFor the Star Trek: Voyager fourth season episode \"Scientific Method\", Helde filmed her scene on Thursday 31 July 1997 on Paramount Stage 8. Her costume from this episode was later sold off on the It's A Wrap! sale and auction on eBay. [1](X)\n\nHelde is primarily a stage actress and has appeared in many plays such as MacBeth in 1988 and A Few Good Men between 1989 and 1991, in which she played Lt. Cmdr. Joanne Galloway, a character which was played by Demi Moore in the film version of 1992. She is frequently involved in the Denver Center for Performing Arts in Denver, Colorado.\n\nOn-screen she has appeared in films such as Nixon (1995, with Paul Sorvino, Robert Beltran, Tony Plana, David Paymer, Saul Rubinek, and Wilson Cruz), Freeway (1996, with Lorna Raver), Bean (1997, with Harris Yulin, Larry Drake, and April Grace), Magnolia (1999, with Henry Gibson, Jim Beaver, and April Grace), and The Expendables (2000, with Brett Cullen, Eileen Weisinger, Caron Colvett, Tim Rigby, and Spice Williams).\n\nShe has also appeared in several television series such as Chicago Hope (1995, with Erick Avari), Providence (1999, alongside Cristine Rose and Charles S. Chun), and Family Law (starring Christopher McDonald, Julie Warner, and Salli Elise Richardson).",
    "Image": "https://fwcdn.pl/ppo/19/46/91946/222753.1.jpg"
  },
  {
    "Actor Name": "Armin Shimerman",
    "Star Trek Roles": "1987 - Letek - STTNG S1:E4 (The Last Outpost)\n1987 - Gift-Box Face - STTNG S1:E10 (Haven)\n1989 - DaiMon Bractor - STTNG S2:E21 (Peak Performance)\n1993-1999 - Quark - ST:DS9\n1994 - Quark - STTNG S7:E21 (Firstborn)\n1995 - Quark - ST:VOY S1:E1 (Caretaker)\n1998 - Quark - Star Trek: Insurrection",
    "Mini Bio": "Armin Shimerman (born 5 November 1949; age 74) is the actor who is best known in the Star Trek universe for his portrayal of Quark on Star Trek: Deep Space Nine. He is one of only seven actors to appear in three different live action Star Trek series (Star Trek: The Next Generation, Deep Space Nine, and Star Trek: Voyager) as the same character. Prior to assuming the role of Quark, however, Shimerman earned the distinction of being among the first to ever portray a Ferengi in the Star Trek franchise when the race first appeared in the Next Generation episode \"The Last Outpost\". Shimerman went on to make two more appearances on The Next Generation (including a second time as a Ferengi in the episode \"Peak Performance\") and to star on Deep Space Nine for its entire seven-year run (1993 – 1999). He also co-wrote the Trek novel The 34th Rule.\n\nBorn to immigrant parents in Lakewood, New Jersey, Shimerman and his family moved to Los Angeles at the age of sixteen. There, his mother enrolled him into a drama group to help her son meet new people. After graduating from the University of California, Los Angeles (UCLA), Shimerman was one of eight people out of nine hundred applicants chosen to become an apprentice at the prestigious Old Globe Theater in San Diego, California. Shimerman participated in numerous regional theater productions before moving to New York and landing roles on the Broadway stage.\n\nShimerman's Broadway debut came when he played part of an ensemble and served as an understudy in the musical Threepenny Opera, which ran for 306 performances from 1 May, 1976 through 23 January, 1977. \"Peak Performance\" co-star Roy Brocksmith was also a part of that play's cast. Shimerman next performed in the play Saint Joan from December 1977 through February 1978 and played the role of Mr. Thorkelson in the musical I Remember Mama in 1979.\n\nShimerman ultimately moved back to Los Angeles, where he acquired guest spots on such television shows as Cagney & Lacey, Remington Steele, andThe Facts of Life. From 1987 through 1989, he was a recurring player on the TV series Beauty and the Beast, which starred Star Trek Nemesis actor Ron Perlman and Tony Jay. He went on to make appearances on L.A. Law (starring Corbin Bernsen and Larry Drake), Who's the Boss?, Alien Nation (starring Gary Graham, Eric Pierpoint, and Michele Scarabelli), and Married... with Children. Shimerman also became a regular on Brooklyn Bridge during that show's first season (1991-92), playing Uncle Bernie.\n\nBeyond Star Trek, however, he is perhaps best known for his recurring role as Principal Snyder on Buffy the Vampire Slayer, and Dr. Nefarious in Ratchet and Clank. His character on Buffy was killed by a transformed Mayor Wilkins, played by Trek guest star Harry Groener.",
    "Image": "https://workingactorsjourney.com/wp-content/uploads/2018/01/Armin-Shimerman.png"
  },
  {
    "Actor Name": "Aron Eisenberg",
    "Star Trek Roles": "1993-1999 - Nog - ST:DS9\n1995 - Young Kazon - ST:VOY S1:E10 (State of Flux)\n1995 - Kar - ST:VOY S2:E2 (Initiations)",
    "Mini Bio": "Aron Eisenberg (6 January 1969 – 21 September 2019; age 50) was the actor who is best known for portraying Nog on Star Trek: Deep Space Nine.\n\nEisenberg worked with Mark Paniccia on the Malibu celebrity comic book \"The Rules of Diplomacy\". Alongside fellow Deep Space Nine performers Max Grodénchik, Chase Masterson, and Cecily Adams he performed sketches as the \"Ferengi Family Hour\" on several Star Trek conventions.\n\nEisenberg reprised his role as Nog in Star Trek Online beginning in the Season 10 mission \"Time in a Bottle\", released June 18, 2015. He also appeared in subsequent episodes of \"Season 10: The Iconian War\", and in the expansion \"Victory Is Life\" in 2018.\n\nBorn in Hollywood, California, USA, Eisenberg underwent a kidney transplant when he was a teenager, which stunted his growth at 5 feet. Eisenberg's oldest son Nicholas Lawrence Eisenberg was born 25 April 1997. His other son is Christopher Eisenberg.\n\nEisenberg made his first acting appearance in Beverly Hills Brats (1989, with Whoopi Goldberg and Star Trek stunt coordinator Dennis Madalone). Also that year, he starred with Lawrence Tierney in The Horror Show. His last movie of that year was Amityville 4: The Evil Escapes also starring Warren Munson. He appeared in Playroom (1990, directed by future Star Trek: Enterprise writer Manny Coto). He also starred in Streets that year. In 1991 he starred in Prayer of the Rollerboys and Puppet Master III: Toulon's Revenge with future Deep Space Nine guest stars Ian Abercrombie and Matthew Faison. In 1993 he played alongside Wil Wheaton in The Liars' Club. A year later, he starred in Pterodactyl Woman from Beverly Hills and in Brave New World (1998, with Leonard Nimoy, Miguel Ferrer, and Daniel Dae Kim).\n\nEisenberg also appeared in a few television series, including Parker Lewis Can't Lose (1991, episode \"Jerry: Portrait of a Video Junkie\"), Tales from the Crypt (1991, episode \"Undertaking Palor\", with John Glover, Jason Marsden, John Kassir, and Graham Jarvis), The Secret World of Alex Mack (1994, episodes \"School Dance\" and \"The Feud\", with J.D. Hall and John Marzilli in the latter one), and Brotherly Love (1996, episode \"Motherly Love\", starring Melinda Culea and Liz Vassey, and guest-starring Lee Arenberg). Eisenberg also performed in several stage plays, received awards for these appearances, and directed a few stage plays.\n\nHe died from heart failure on 21 September 2019, [1] the same day as Star Trek: The Original Series actors Jack Donner and Sid Haig.",
    "Image": "https://ew.com/thmb/792MhJhlQkYzuL--tz9P2Rd5SFA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/aron-eisenberg-2000-06a180d9049d4929aa699dc304177144.jpg"
  },
  {
    "Actor Name": "Barbara Babcock",
    "Star Trek Roles": "1967 - Trelane's Mother - ST:TOS S1:E17 (The Squire of Gothos)\n1967 - Mea 3 - ST:TOS S1:E23 (A Taste of Armageddon)\n1968 - Beta 5 Computer - ST:TOS S2:E26 (Assignment: Earth)\n1968 - Commander Loskene - ST:TOS S3:E9 (The Tholian Web)\n1968 - Philana - ST:TOS S3:E10 (Plato's Stepchildren)\n1969 - Zetar - ST:TOS S3:E18 (The Lights of Zetar)",
    "Mini Bio": "Actress Barbara Babcock (born 27 February 1937; age 87) has enjoyed a long Hollywood career that includes roles in nearly thirty movies, regular roles in a half-dozen or so television series, about sixty guest appearances, a number of which were repeat appearances for her character, and a number of stage appearances. She filmed her scenes for the Star Trek: The Original Series first season episode \"A Taste of Armageddon\" between Wednesday 28 December 1966 and Wednesday 4 January 1967 at Desilu Stage 10, and her scenes for \"Plato's Stepchildren\" between Monday 9 September 1968 and Thursday 12 September 1968, and on Tuesday 17 September 1968, also at Stage 10.\n\nBabcock had a recurring role as Liz Craig on Dallas from 1978 through 1982. She won an Emmy Award for her role as Grace Gardner in Hill Street Blues. Babcock is also known to television viewers for Dr. Quinn, Medicine Woman, for which she also received an Emmy nomination. She also co-starred with Jerry Orbach, Earl Boen and Juliana Donald in the 1987-88 series The Law & Harry McGraw, a spin-off of Murder, She Wrote in which she made five guest appearances.\n\nHer feature film credits include Bang the Drum Slowly (1973), The Lords of Discipline (1983), Salem's Lot (1979, with Original Series guest stars Elisha Cook, David Soul, Julie Cobb, and Reggie Nalder), Far and Away (1992, with Colm Meaney), and Space Cowboys (2000, with James Cromwell).",
    "Image": "https://image.tmdb.org/t/p/original/wOB6OSPgFlyI3V1PtCTg7q8vrdW.jpg"
  },
  {
    "Actor Name": "Bari Hochwald",
    "Star Trek Roles": "1995 - Elizabeth Lense - ST:DS9 S3:E22 (Explorers)\n2001 - Brin - ST:VOY S7:E21 (Friendship One)\n2002 - E'lis - ST:ENT S2:E6 (Marauders)",
    "Mini Bio": "Bari Hochwald (born 12 March 1964; age 60) is an actress and director who appeared as Elizabeth Lense in the Star Trek: Deep Space Nine third season episode \"Explorers\", Brin in the Star Trek: Voyager seventh season episode \"Friendship One\", and E'Lis in the Star Trek: Enterprise second season episode \"Marauders\".\n\nOther television series on which she has made guest appearances include Dr. Quinn, Medicine Woman (with Chad Allen and Barbara Babcock), Walker, Texas Ranger (with Noble Willingham), The Drew Carey Show (with Diedrich Bader), The Guardian (with Raphael Sbarge), CSI: Crime Scene Investigation (starring Paul Guilfoyle), and Desperate Housewives (starring Teri Hatcher and Steven Culp). She also had recurring roles on Party of Five (1998) and The Practice (2003).",
    "Image": "https://iv1.lisimg.com/image/4714022/224full-bari-hochwald.jpg"
  },
  {
    "Actor Name": "Brent Spiner",
    "Star Trek Roles": "1987-1994 Lt. Commander Data - STTNG\n1990 - Dr. Noonien Soong - STTNG S4:E3 (Brothers)\n1990 - Lore - STTNG S4:E3 (Brothers)\n1993 - Dr. Noonien Soong - STTNG S6:E16 (Birthright: Part 1)\n1993 - Lore - STTNG S6:E26 (Descent: Part 1)\n1993 - Lore - STTNG S7:E1 (Descent: Part 2)\n1993 - Dr. Noonien Soong - STTNG S7:E10 (Inheritance)\n1994 - Data - Star Trek: Generations\n1996 - Data - Star Trek: First Contact\n1998 - Data - Star Trek: Insurrection\n2002 - Data - Star Trek: Nemesis\n2002 - B-4 - Star Trek: Nemesis\n2004 - Dr. Arik Soong - ST:ENT S4:E4 (Borderland)\n2004 - Dr. Arik Soong - ST:ENT S4:E5 (Cold Station 12)\n2004 - Dr. Arik Soong - ST:ENT S4:E6 (The Augments)\n2020 - Data - Star Trek: Picard (Season 1)\n2020 - Dr. Altan Inigo Soong - Star Trek: Picard (S1:E9-10)\n2022 - Dr. Adam Soong - Star Trek: Picard (Season 2)\n2023 - Lore, B-4, and Data (merged)  - Star Trek: Picard (Season 3)",
    "Mini Bio": "Brent Jay Spiner (born 2 February 1949; age 75) is an actor best known for playing the android Starfleet officer, Lieutenant Commander Data, on Star Trek: The Next Generation, in four Star Trek films, several episodes of Star Trek: Picard, and off-screen in \"These Are the Voyages...\", the final episode of Star Trek: Enterprise. He also played Data's \"brother\", Lore, and \"father\", Doctor Noonien Soong, in various episodes of Next Generation. In 2002, he played B-4 in Star Trek Nemesis. He appeared as Arik Soong in a three-episode arc on Enterprise and as Altan Soong and Adam Soong on Picard. He also co-wrote the story for Star Trek Nemesis with Rick Berman and John Logan.\nHis portrayal of Data, the android in search of Humanity, made him an invaluable member of the Next Generation cast. These skills were highlighted in the episode \"Brothers\", in which Spiner played all three main characters of the story, effectively turning the episode into a \"one-man show\".\n\nHe is one of only six actors to play seven or more different characters in the Star Trek franchise, the others being Jeffrey Combs, Randy Oglesby, Thomas Kopache,J.G. Hertzler, and Vaughn Armstrong.",
    "Image": "https://ew.com/thmb/l_LmUAHE14AAB_TwV0q4e_mi7H4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/independence-day-0ccebf55e0104d078a6e0c1aa5227250.jpg"
  },
  {
    "Actor Name": "Brian Cousins",
    "Star Trek Roles": "1992 - Parem - STTNG S5:E24 (The Next Phase)\n1993 - Crosis - STTNG S6:E26 (Descent: Part 1)\n1993 - Crosis - STTNG S7:E1 (Descent: Part 2)\n2002 - Alien Lieutenant - ST:ENT S2:E12 (The Catwalk)",
    "Mini Bio": "Brian J. Cousins (born 9 May 1959; age 65) is an actor who appeared in two episodes of Star Trek: The Next Generation and in an episode of Star Trek: Enterprise. For the Enterprise episode \"The Catwalk\", Cousins filmed his scenes in late October 2002 on Paramount Stage 18.\n\nBesides his first Star Trek role in 1992, Cousins' earliest acting credits include Longtime Companion (1989, with Bruce Davison, Freda Foh Shen, Kelly Connell, Dan Butler, and Robert Joy), Killer Instinct (1991, with Charles Napier), Mandroid (1993, with Robert Symonds), and guest roles in One Life to Live (1990) and L.A. Law (1993, with Corbin Bernsen, Larry Drake, Aaron Lustig, and Lawrence Pressman).\n\nMore recently, Cousins appeared in episodes of No Ordinary Family (2010, with Jimmy Bennett, Autumn Reeser, Tim Kelleher, and Reggie Lee), The Mentalist (2010, with John Billingsley and Connor Trinneer), and Desperate Housewives (2012, with Teri Hatcher, Vanessa Williams, Patrick Fabian, John Rubinstein, and Stephanie Erb).",
    "Image": "https://i.gawby.com/mjaymg/mdg/mdq/mdu/mzu/b/r/o/brian-cousins-8533499266.jpg"
  },
  {
    "Actor Name": "Brian Markinson",
    "Star Trek Roles": "1994 - Vorin - STTNG S7:E13 (Homeward)\n1995 - Lieutenant Peter Durst - ST:VOY S1:E12 (Cathexis)\n1995 - Lieutenant Peter Durst - ST:VOY S1:E13 (Faces)\n1995 - Sulan - ST:VOY S1:E13 (Faces)\n1997 - Giger - ST:DS9 S5:E25 (In the Cards)",
    "Mini Bio": "Brian Markinson (born 14 September 1961; age 63) is an actor who played Vorin in the Star Trek: The Next Generation seventh season episode \"Homeward\", Pete Durst in the Star Trek: Voyager first season episodes \"Cathexis\" and \"Faces\", and Sulan in the latter, and Elias Giger in the Star Trek: Deep Space Nine fifth season episode \"In the Cards\". He was cast as Sulan for \"Faces\" prior to portraying Pete Durst in \"Cathexis\". (Beyond the Final Frontier, p. 200) Markinson had previously auditioned for the roles of The Doctor [1] and Neelix. [2]\nMarkinson has also guest-starred in The X-Files (with Dey Young), The Dead Zone (with Nicole de Boer, David Ogden Stiers and Bill Mondy), and Stargate SG-1.\n\nHe had a recurring role on the Canadian television series Da Vinci's Inquest, as did Gwynyth Walsh. He also appeared in the 1994 HBO movie White Mile with Robert Picardo, Jacqueline Kim, Dakin Matthews, Ken Jenkins, Dan Kern, Fionnula Flanagan, Dan Gilvezan, Gina Ravarra, Brett Porter, Ken Thorley, Don McManus, and Tom Lupo. In 2002 he played a supporting part in the mini-series Taken with Matt Frewer, Anton Yelchin, Gwynyth Walsh, and Rob LaBelle. Markinson made two separate appearances in Ronald D. Moore's Battlestar Galactica, in a recurrent role on the 2010 spin-off prequel series Caprica, and in another part on the subsequent 2012 sequel television movie Blood & Chrome.\n\nMarkinson and Voyager co-star Robert Duncan McNeill became friends years later when they were reunited on the TV series Girlfriend's Guide to Divorce, in which Markinson acted and McNeill directed.[3]",
    "Image": "https://www.speakerbookingagency.com/storage/celebrities/1549050826_brian-markinson.jpg"
  },
  {
    "Actor Name": "Brian Thompson",
    "Star Trek Roles": "1989 - Second Officer Klag - STTNG S2:E8 (A Matter of Honor)\n1993 - Inglatu - ST:DS9 S2:E7 (Rules of Acquisition)\n1994 - Klingon Helm - Star Trek: Generations\n1996 - Toman'torax - ST:DS9 S4:E22 (To the Death)\n2005 - Admiral Valdore - ST:ENT S4:E12 (Babel One)\n2005 - Admiral Valdore - ST:ENT S4:E13 (United)\n2005 - Admiral Valdore - ST:ENT S4:E14 (The Aenar)",
    "Mini Bio": "Brian Thompson (born 28 August 1959; age 65) is an actor from Ellensburg, Washington who appeared in several episodes of Star Trek: The Next Generation, Star Trek: Deep Space Nine and Star Trek: Enterprise, as well as in Star Trek Generations. His costume from the episode \"Rules of Acquisition\" was sold off on the It's A Wrap! sale and auction on eBay. [1](X)\n\nHe made his big screen debut in 1984 with a small role in The Terminator (starring Linda Hamilton, with Dick Miller, Paul Winfield, and Earl Boen).\n\nHe is probably best known in his role as the alien bounty hunter on The X-Files. His other TV credits include guest spots on Falcon Crest, Charmed and Buffy the Vampire Slayer. He appeared as Eddie Fiore in Kindred: The Embraced along with Jeff Kober, and as an eccentric Florida sheriff on Key West, that also starred Denise Crosby, T.C. Carson, Geno Silva, Leland Crooke and Jennifer Barlow. He is also one of the many actors who have appeared in both the Star Trek and Babylon 5 franchises, guest-starring in an episode of Crusade with Gary Cole, Tracy Scoggins, Marjean Holden and Daniel Dae Kim. He has also had numerous roles in including Cobra (1986, with Andrew Robinson, Roger Aaron Brown, Laura Drake, Leslie Morris, and Kurt V. Hulett), Three Amigos (1986, with Tony Plana), Alien Nation (1988, with Earl Boen, Jeff Kober, Roger Aaron Brown, Leslie Bevis, Keone Young, Tom Morga, and Frank Collison), Moon 44 (1990, with Malcolm McDowell and Leon Rippy), Ted & Venus (1991, with Lily Mariye, Carol Kane, Tricia O'Neil, and Vincent Schiavelli), Dragonheart (1996, with Dina Meyer and Jason Isaacs), Doctor Mordrid (1992, with Jeffrey Combs), Mortal Kombat Annihilation (1997, with Musetta Vander), and Joe Dirt (2001).",
    "Image": "https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/9346_v9_ba.jpg"
  },
  {
    "Actor Name": "Brock Peters",
    "Star Trek Roles": "1986 - Admiral Cartwright - Star Trek IV: The Voyage Home\n1991 - Admiral Cartwright - Star Trek VI: The Undiscovered Country\n1996-1998 - Joseph Sisko - ST:DS9",
    "Mini Bio": "Brock Peters (2 July 1927 – 23 August 2005; age 78) was an accomplished veteran actor of stage, film, and television. He played Admiral Cartwright in Star Trek IV: The Voyage Home and Star Trek VI: The Undiscovered Country, and later portrayed Joseph Sisko on Star Trek: Deep Space Nine.\nIn addition to his canon Star Trek roles, Peters voiced the role of General Mi'Qogh (β) in the video game Star Trek: Starfleet Command III.\n\nPeters was born as George Fisher in New York City to African and West Indian parentage and began acting at the age of ten. He trained in his craft at Fiorello H. LaGuardia High School of Music & Art and Performing Arts in New York City. He studied physical education at the City College of New York, which he abandoned after landing a role in the opera Porgy and Bess in 1949.\n\nBeyond the realm of Star Trek, Peters is probably best known for his performance as Tom Robinson, the black man unjustly accused and convicted of raping a white girl, in To Kill a Mockingbird (1962). His co-stars in this film included Star Trek: The Original Series guest actors Frank Overton, Paul Fix, William Windom, John Megna, and Richard Hale. On the set of that film, he struck up a lifelong friendship with star Gregory Peck, and delivered the eulogy at Peck's funeral in 2003.\n\nPeters also became friends with actor Charlton Heston after working with him on several stage productions in the 1940s and 1950s. Peters later worked with Heston on three films: Major Dundee (1965), Soylent Green (1973), and Two-Minute Warning (1976).",
    "Image": "https://swatkats.info/wp-content/uploads/2018/07/brock-peters.jpg"
  },
  {
    "Actor Name": "Carel Struycken",
    "Star Trek Roles": "1987 - Mr. Homn - STTNG S1:E10 (Haven)\n1989 - Mr. Homn - STTNG S2:E19 (Manhunt)\n1990 - Mr. Homn - STTNG S3:E24 (Ménage à Troi)\n1991 - Mr. Homn - STTNG S4:E22 (Half a Life)\n1992 - Mr. Homn - STTNG S5:E20 (Cost of Living)\n1996 - Spectre - ST:VOY S2:E23 (The Thaw)",
    "Mini Bio": "Carel Struycken (born 30 July 1948; age 76) is a Dutch actor known to Star Trek fans for playing Lwaxana Troi's assistant and valet, Mr. Homn, in five episodes of Star Trek: The Next Generation. He also played The Spectre in the Star Trek: Voyager second season episode \"The Thaw\".\n\nA giant of a man at seven feet (2.13 meters) tall, due to a medical condition known as acromegaly (giantism), Struycken is probably most well-known for his role as Lurch in The Addams Family (1991) and Addams Family Values (1993), in which he co-starred with Christopher Lloyd, and Carol Kane in the latter.\n\nStruycken made his debut as Mr. Homn on Star Trek: The Next Generation in the first season episode \"Haven\", which aired the week of 28 November 1987. He also had his only line on the show in this episode, when he thanks Picard for \"the drinks.\"\n\nStruycken reprised the role of Homn for four more episodes, and as the personal assistant to Ambassador Lwaxana Troi, Struycken always shared the screen with the late Majel Barrett-Roddenberry in each of his appearances. He filmed his scenes for the fourth season episode \"Half a Life\" on Monday 4 March 1991 on Paramount Stage 8 and 9. For his final appearance as Homn in \"Cost of Living\", he filmed his scenes between Tuesday 4 February 1992 and Thursday 6 February 1992, on Monday 10 February 1992, and on second unit on Friday 14 February 1992 on Paramount Stage 8 and 9.\n\nIn 1988, between his first and second appearance on The Next Generation, Struycken appeared in an episode of St. Elsewhere, starring William Daniels Ed Begley, Jr., Christina Pickles, Ronny Cox, Bruce Greenwood, Norman Lloyd, France Nuyen, and Jennifer Savidge. Struycken's episode also featured fellow Next Generation guest star Robert Costanzo.\n\nStruycken had a recurring role as \"The Giant\" (AKA: The Fireman) throughout the second season of Twin Peaks in 1990 and 1991, appearing with Mädchen Amick, Richard Beymer, Ray Wise, Miguel Ferrer, Kenneth Welsh, and Catherine Coulson. He reprised the role in Twin Peaks: The Return in 2017, appearing again with Richard Beymer, Miguel Ferrer, Ray Wise, and Catherine Coulson. Also in 1990, Struycken appeared along with Joel Swetow in the HBO movie Framed. He then had a supporting role in the horror film Servants of Twilight, which starred Bruce Greenwood and Mimi Craven.\n\nWhile Struycken is famous for playing Lurch in the film version of The Addams Family, Original Series guest actor Ted Cassidy is famous for originating the role on the classic 1960s TV show.\n\nStruycken was the only actor from the first two Addams Family films (with the exception of Christopher Hart's hand playing the role of Thing) to reprise his role in the 1998 direct-to-video sequel Addams Family Reunion. Struycken's co-stars in this film included Ed Begley, Jr. as well as Ray Walston, Leigh Taylor-Young, and Clint Howard.",
    "Image": "https://images.prismic.io/star-trek-untold/ZTVmZWY3MDAtZmE0Yy00YzQzLTk0YTgtMjU1ODMzODJhYmQ2_2050e03ca119580f74cca14cc6e97462.jpg?auto=compress,format&rect=0,0,620,260&w=620&h=260"
  },
  {
    "Actor Name": "Casey Biggs",
    "Star Trek Roles": "1996-1999 - Damar - ST:DS9\n2004 - Illyrian Captain - ST:ENT S3:E19 (Damage)",
    "Mini Bio": "Casey Patrick Biggs (born 4 April 1955; age 69) is an actor best known for his portrayal of Damar on Star Trek: Deep Space Nine as well as several other roles. He is the ex-husband of Roxann Dawson.\n\nCasey Biggs was interviewed in the 2005-released docu-comedy Trekkies 2 and for the Deep Space Nine documentary What We Left Behind.\n\nHe is a member of the Enterprise Blues Band, which writes and performs songs about Star Trek. The other members are Vaughn Armstrong, Richard Herd, Steve Rankin, William Jones, and Ronald B. Moore. Biggs plays the rhythm guitar, and sings some of the back-up vocals.\n\nBiggs once guest-starred in Live Shot. Other Star Trek stars who were cast members include David Birney, Karen Austin, Ron Canada, Jeff Yagher, Bruce McGill, and Sam Anderson. Star Trek stars who also guest-starred include Chase Masterson, Dion Anderson, John Schuck, Lee Arenberg, Hal Landon, Jr., Cully Fredricksen, and Kenneth Tigar.\n\nBiggs also guest starred in The X-Files, Medium, The Good Wife, Elementary and Person of Interest. Biggs also appeared in The Pelican Brief (1993), Broken Arrow (1996), Shadow Conspiracy (1997), Auggie Rose (2001), and Dragonfly (2002).",
    "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS5bu8e5OjW7-waogwcR7lLcTE5PzNOO90zzAj188V9vyTrRXuNNpq1OvHiwBGblsRKaAQ&usqp=CAU"
  },
  {
    "Actor Name": "Charles Cooper",
    "Star Trek Roles": "1989 - Korrd - Star Trek V: The Final Frontier\n1990 - K'mpec - STTNG S4:E7 (Reunion)\n1990 - K'mpec - STTNG S4:E17 (Sins of the Father)",
    "Mini Bio": "Charles Darwin Cooper (11 August 1926 – 29 November 2013; age 87) was the actor who portrayed Korrd in Star Trek V: The Final Frontier. He also portrayed K'mpec in the Star Trek: The Next Generation third and fourth season episodes \"Sins of The Father\" and \"Reunion\".\n\nBorn in San Francisco, California, USA, Cooper made his first acting experiences at the age of fifteen in a San Francisco stage production of \"Hamlet\". Cooper enjoyed the recurring role of Judge Robert Boucher on the legal drama The Practice appearing in \"Part IV\" along with Miriam Flynn, Richard McGonagle, and Natalia Nogulich, \"Dog Bite\" with Nogulich as well as Willie Garson, \"Hide & Seek\" with Earl Billings, Jack Blessing, and Titus Welliver, and \"The Civil Right\" with Googy Gress and Mitchell Ryan, all in 1997.\n\nCooper passed away on 29 November 2013, at the age of 87.",
    "Image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjW_fQoe64YoKa3S7EQwU8EIsLL16CmkZ635yGxceanZ8mbLKVn00bguMSJgqa6QRxIrTbOlUDfyI65Wmv93F2qmlr5dr39GohM1oc6UZ1NF655WfZ7HT0uvSCBYnBS87yTHSWe/s1600/charles-cooper_korrd.jpg"
  },
  {
    "Actor Name": "Charles Lucia",
    "Star Trek Roles": "1992 - Ambassador Ves Alkar - STTNG S6:E3 (Man of the People)\n1996 - Mabus - ST:VOY S2:E14 (Alliances)\n2001 - Captain Keene - ST:ENT S1:E10 (Fortunate Son)",
    "Mini Bio": "Charles Lucia (born 3 January 1946; age 78), also credited as Chip Lucia and Charles O. Lucia, is an actor who appeared in episodes of Star Trek: The Next Generation, Star Trek: Voyager, and Star Trek: Enterprise.\nLucia's film credits include the 1992 biopic Her Final Fury: Betty Broderick, The Last Chapter with Stephen Collins, J. Downing, Clayton Landey, Richard McGonagle, Margot Rose, Stephen Root, and Jandi Swanson, and Tank Girl (1995, starring Lori Petty and Malcolm McDowell, with Reg E. Cathey, Iggy Pop, Ann Magnuson, Doug Jones, Ann Cusack, and Jeff Kober).\n\nFollowing his appearances in \"Fortunate Son\", an episode of The District (2001, with Roger Aaron Brown), and the short film Cinema/Vérité (2001, with Todd Babcock), Lucia retired from acting. Today, he lives in Youngsville, Pennsylvania.",
    "Image": "https://image.tmdb.org/t/p/w500/jwNxR4sVWzSkpQPRngXvW0CHJnv.jpg"
  },
  {
    "Actor Name": "Clint Howard",
    "Star Trek Roles": "1966 - Balok - ST:TOS S1:E10 (The Corbomite Maneuver)\n1995 - Grady - ST:DS9 S3:E12 (Past Tense: Part 2)\n2002 - Muk - ST:ENT S1:E19 (Acquisition)\n2002 - Muk - Star Trek: Enterprise S1:E19 (Acquisition)\n2018 - Orion - Star Trek: Discovery S1:E15 (Will You Take My Hand)\n2023 - Buckley - Star Trek: SNW S2:E8 (Under the Cloak of War)",
    "Mini Bio": "Clint Howard (born 20 April 1959; age 65) is an actor who played Balok in the Star Trek: The Original Series first season episode \"The Corbomite Maneuver\", Grady in the Star Trek: Deep Space Nine third season episode \"Past Tense, Part II\", Muk in the Star Trek: Enterprise first season episode \"Acquisition\", a Creepy Orion in the Star Trek: Discovery first season episode \"Will You Take My Hand?\" and Buck Martinez in Star Trek: Strange New Worlds second season episode \"Under the Cloak of War\".\n\nHe filmed his scenes as Balok for \"The Corbomite Maneuver\" on Wednesday 1 June 1966 at Desilu Stage 9. He also filmed a makeup test the previous day. [1]\n\nAlong with Majel Barrett, Joseph Ruskin, Jack Donner and Vince Deadrick, he is one of only five actors to appear in both The Original Series and Enterprise. He, Barrett, and Ruskin also appeared in Deep Space Nine. He is the only performer to date who appeared in both The Original Series and Discovery or Strange New Worlds (excluding performers who appeared in archive footage).\n\nOn Comedy Central's 2006 roast of William Shatner, Howard reprised his role as Balok in an older, grown-up form addicted to tranya.\n\nHoward holds the record for longest period between first and most recent appearances on Star Trek, of 20713 days, or just under 57 years, reclaiming the record from Walter Koenig who played the voice only role of Anton Chekov in Star Trek:",
    "Image": "https://static1.cbrimages.com/wordpress/wp-content/uploads/2021/08/Clint-Howard-as-Grady-in-Star-Trek-Deep-Space-Nine.jpg"
  },
  {
    "Actor Name": "Cyia Batten",
    "Star Trek Roles": "1995 - Ziyal - ST:DS9 S4:E4 (Indiscretion)\n1996 - Ziyal - ST:DS9 S4:E13 (Return to Grace)\n2000 - Irina - ST:VOY S7:E3 (Drive)\n2005 - Navaar - ST:ENT S4:E17 (Bound)",
    "Mini Bio": "Cyia Batten (born 26 January 1972; age 52) is an actress and dancer who played Tora Ziyal in the Star Trek: Deep Space Nine fourth season episodes \"Indiscretion\" and \"Return to Grace\", Irina in the Star Trek: Voyager seventh season episode \"Drive\" and Navaar in the Star Trek: Enterprise fourth season episode \"Bound\".\nBatten made her acting debut in Red Shoe Diaries in the episode \"Tears\" (1995) with Carolyn Seymour. That year also found Batten in W.E.I.R.D. World with Scott Nimerfro, Gina Ravarra and Clayton Rohner. Batten was then in the telefilms Marshall Law (1996, with Geoffrey Blake) and Sins of the Mind (1997, with Louise Fletcher and Robert Pine). In 1998 she was featured in Senseless, with Jenette Goldstein, Richard McGonagle, Greg Grunberg, Alexander Enberg, Manu Intiraymi, Ivar Brogger, Brad Dourif, Jack Shearer, Len Costanza, John Wilkie, Janet Dey, Rubin Knight, Andray Johnson, and Bruce Dobos. Batten's next film was Black & White (1999, with Seymour Cassel, Kamala Lopez-Dawson, and Boris Krutonog).\n\nIn the 2000s, Batten appeared in Bubble Boy (2001, with Brian George and John Carroll Lynch), The Sweetest Thing (2002, with Loren Lester), American Crime (2004, with Wade Andrew Williams), The Texas Chainsaw Massacre: The Beginning (2006, with Tim de Zarn and John Larroquette), Charlie Wilson's War (2007, with Ron Fassler, Spencer Garrett, Pasha Lychnikoff, Brian Markinson and J. Patrick McCormack). Batten finished 2007 with the telefilm Suspect with Star Trek: Enterprise actor John Billingsley.\n\nBatten has made guest appearances on CSI: Crime Scene Investigation (2003, with Paul Guilfoyle and Wallace Langham) CSI: NY (2005 with Marco Sanchez, Irene Tsu as well as an uncredited Morgan H. Margolis), and CSI: Miami (2006, with Mark Rolston and Michael Buchman Silver).\n\nBatten is also an original member of the burlesque singing group the Pussycat Dolls.",
    "Image": "https://images.squarespace-cdn.com/content/v1/5cc3d1b051f4d40415789cc2/2e7bc54c-1d23-4336-ace2-408fa3ab527b/cyia-batten-tracy-middendorf-ziyal-navaar-irina.png"
  },
  {
    "Actor Name": "David Birkin",
    "Star Trek Roles": "1990 - René Picard - STTNG S4:E2 (Family)\n1992 - Young Jean-Luc Picard - STTNG S6:E7 (Rascals)",
    "Mini Bio": "David Tristan Birkin (born 21 November 1977; age 46) is a British actor and artist who portrayed René Picard in the Star Trek: The Next Generation fourth season episode \"Family\". Two years later he appeared as a younger version of Jean-Luc Picard in the sixth season episode \"Rascals\".\nWith the exception of his Star Trek appearances, he has appeared primarily in UK productions. In 1998, he played the role of Courfeyrac in the motion picture adaptation of Les Misérables. His other film credits include the 1989 adventure The Return of the Musketeers (with Kim Cattrall), the 1991 romantic comedy Impromptu, the 2001 war drama Charlotte Gray and the 2003 biopic Sylvia.\n\nHe was later featured in an episode of Identity (2010) and in the drama Men Don't Lie (2011).\n\nBirkin is the son of screenwriter Andrew Birkin (Omen III, The Name of the Rose) and nephew of actress and singer Jane Birkin.",
    "Image": "https://www.caricatures-ireland.com/blog/wp-content/uploads/2019/01/Jean-Luc_Picard-_age_12.jpg"
  },
  {
    "Actor Name": "David Graf",
    "Star Trek Roles": "1995 - Fred Noonan - ST:VOY S2:E1 (The 37's)\n1997 - Leskit - ST:DS9 S5:E21 (Soldiers of the Empire)",
    "Mini Bio": "David Graf (16 April 1950 – 7 April 2001; age 50) was an American actor who guest-starred as Fred Noonan in the Star Trek: Voyager second season episode \"The 37's\" and Leskit in the Star Trek: Deep Space Nine fifth season episode \"Soldiers of the Empire\". His widow, Kathryn Graf, guest-starred in the Deep Space Nine first season episode \"A Man Alone\". Prior to his appearance in Voyager, Graf guest-starred in a series called Voyagers! (VOY Season 2 DVD, \"The 37's\" text commentary)\nIn addition to his episodic appearances, Graf also did voice work on several Trek video games, including Star Trek: Voyager - Elite Force and Star Trek: Away Team.\n\nHe is best remembered for his role as Officer (and later Sergeant) Eugene Tackleberry in all seven of the Police Academy movies from 1984 through 1994. He also played the character on the short-lived 1997-98 series inspired by the films. One of these films, 1988's Police Academy 5: Assignment: Miami Beach, also featured his wife, Kathryn, as well as Deep Space Nine star René Auberjonois and Star Trek: The Next Generation guest star Matt McCoy. In fact, all the other Police Academy films featured fellow Trek alumni: the first film (1984) had Kim Cattrall, Steve Guttenberg, and Scott Thomson; Police Academy 2: Their First Assignment (1985) had Arthur Batanides, who also appeared in the fourth and sixth films; Scott Thomson, Steve Guttenberg, and Brian Tochi appeared in Police Academy 3: Back in Training (1986) and also appeared in Police Academy 4: Citizens on Patrol (1987); Police Academy 6: City Under Siege (1989) featured Gerrit Graham, Darryl Henriques, Kenneth Mars, Matt McCoy, Beans Morocco, and Angelo Tiffe; and Ron Perlman co-starred in Police Academy: Mission to Moscow (1994).",
    "Image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjlynkemp7Vvn36VTdcQ33WoS4QAcc-DLu5ELNR6RWxekx4TOdQ0kgIH0SieP6GphQV9nP26S1BvlHYiA0UkN9mKsPGD89pwH53mzgZj2InIT_GY8iy-wKhuUFxTqRKR3f5DYAedl7bkgM/s1600/DG01.jpg"
  },
  {
    "Actor Name": "David Warner",
    "Star Trek Roles": "1992 - Gul Madred - STTNG S6:E10 & 11 (Chain of Command)\n1991 - Chancellor Gorkon - Star Trek VI: The Undiscovered Country\n1989 - Ambassador St. John Talbot - Star Trek V: The Final Frontier",
    "Mini Bio": "David Warner (29 July 1941 – 24 July 2022; age 80) was an English actor who played St. John Talbot in Star Trek V: The Final Frontier, Gorkon in Star Trek VI: The Undiscovered Country, and Madred in the Star Trek: The Next Generation sixth season episodes \"Chain Of Command, Part I\" and \"Chain Of Command, Part II\". He reprised the role of Gorkon for the video game Star Trek: Klingon Academy.\nWarner took over the role of Madred on three days notice and, though he had previously appeared in Star Trek V: The Final Frontier and Star Trek VI: The Undiscovered Country, he knew nothing about the Cardassians from The Next Generation. As he recalled in a 2011 interview; \"I took over on three days' notice. It was another makeup job. It was with Pat Stewart, who's an old colleague. It was great to be a part of that. I thought, \"Oh, I've done two of the others, the old classic ones, and here I am in The Next Generation. I'll go for it.\" So I wasn't aware of it, of the Cardassians. I didn't know their history at all, except of course, that they weren't very nice.\" Due to the short time in which he had to prepare, Warner also did not have enough time to memorize his lines. As such, they were written down on cue cards. As he commented; \"There was too much technobabble and dialogue that doesn't come naturally to me. So they wrote everything up for me. I don't mind people knowing this. Every line I said, I actually was reading it over Patrick's shoulder or they put it down there for me to do it.\" [1]\n\nWarner was also approached by the Star Trek: Deep Space Nine production staff for the role of Akorem Laan in \"Accession\". Ira Steven Behr commented, \"Personally, I wanted David Warner as Akorem. He wanted to do it, but his wife talked him out of it because he was on vacation and she didn't want him to work. To this day I still wish David Warner was in it.\" (Captains' Logs Supplemental - The Unauthorized Guide to the New Trek Voyages [page number? • edit])",
    "Image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2020/08/St-John-Talbot-Star-Trek-V.jpg"
  },
  {
    "Actor Name": "Dennis Christopher",
    "Star Trek Roles": "1994 - Borath - ST:DS9 S3:E2 (The Search: Part 2)\n2002 - Danik - ST:ENT S1:E21 (Detained)",
    "Mini Bio": "Dennis Christopher (born 2 December 1955; age 68) played Borath in the Star Trek: Deep Space Nine third season episode \"The Search, Part II\" and Danik in the Star Trek: Enterprise first season episode \"Detained\".\nChristopher rose to prominence with his starring role in the 1979 coming-of-age drama Breaking Away, for which he won a BAFTA Award for most promising newcomer and was nominated for a Golden Globe. Paul Dooley played his character's father in this film. He also appeared as Dooley's son in an episode of Law & Order: Criminal Intent. In 1981, Christopher played American athlete Charlie Paddock in Chariots of Fire, which starred Ben Cross and Alice Krige.\n\nOn television, he had recurring roles on Angel (as the evil wizard Cyvus Vail) and Profiler (as the \"Jack of All Trades\"), and guest appearances on series such as NYPD Blue, Six Feet Under, and Roswell.\n\nIn the Profiler series, his character's mother, Miriam Newquay, was played by Louise Fletcher. Furthermore, Dennis Christopher played Dr. Martin Ruper in the Sci-Fi Channel's The Lost Room in 2006. He also portrayed Eddie Kaspbrak in the 1990 adaptation of Stephen King's It.\n\nBetween 2000 and 2001, Christopher portrayed Vince Elsing in FreakyLinks where he worked with Ron Canada, Patrick Fabian, Daniel Roebuck, Ryan Bollman, John Billingsley, Connor Trinneer, Leslie Jordan, Brooke Benko, Dawn Stern, Art Chudabala, Steve Vinovich, Faran Tahir, Aaron Lustig, Scott Lincoln, Mirron E. Willis, and Tom McCleister.\n\nIn the 1980s, he guest-starred on The Equalizer as Father Nicholas Kostmayer, a Catholic priest and younger brother of series recurring character Mickey Kostmayer, played by Keith Szarabajka. In 2012, he appeared in the Quentin Tarantino film Django Unchained as Leonide Moguy.",
    "Image": "https://static1.srcdn.com/wordpress/wp-content/uploads/2024/08/instar50029295.jpg"
  },
  {
    "Actor Name": "Diana Muldaur",
    "Star Trek Roles": "1968 - Ann Mulhall - ST:TOS S2:E20 (Return to Tomorrow)\n1968 - Dr. Miranda Jones - ST:TOS S3:E5 (Is There in Truth No Beauty?)\n1988-1989 - Doctor Katherine Pulaski - ST:TNG",
    "Mini Bio": "Diana Muldaur (born 19 August 1938; age 86) is an actress, best known to Star Trek fans for her portrayal of Doctor Katherine Pulaski during the second season of Star Trek: The Next Generation. She appeared in all but two episodes of the season: \"The Outrageous Okona\" and \"Q Who\".\nMuldaur had previously appeared in two episodes of Star Trek: The Original Series (\"Return to Tomorrow\" and \"Is There in Truth No Beauty?\"), playing two different characters who also held the title of \"Doctor.\" Muldaur filmed her scenes for \"Return to Tomorrow\" between Monday 20 November 1967 and Tuesday 28 November 1967 at Desilu Stage 9 and Stage 10, and her scenes for \"Is There in Truth No Beauty?\" between Tuesday 16 July 1968 and Wednesday 24 July 1968 at Stage 9 and Stage 8.\n\nIn 1988, Muldaur was cast as Dr. Pulaski for the second season of The Next Generation as a replacement for Gates McFadden, the actress who played Beverly Crusher in the first season. McFadden had some sort of falling out with the show's producers, especially Maurice Hurley, and left (or was asked to leave) the show, and Muldaur was brought on board. However, following the end of the second season, the issues with McFadden were resolved and she returned to the series. Muldaur's last appearance as Dr. Pulaski was \"Shades of Gray\", the final episode of the second season. On 20 September 1988 Muldaur was interviewed and these interviews were later published on the TNG Season 2 DVD in the special features \"Mission Overview Year Two\" (\"Diana Muldaur\", \"Gene Roddenberry\") and \"Selected Crew Analysis Year Two\". In these interviews Muldaur told that she had moved into the high desert Sierra Nevada with her husband in 1988 when she got a call to work on The Next Generation and couldn't resist.\n\nAmong the props and costumes auctioned off on the It's A Wrap! sale and auction on eBay were a face mold and her costume from the episode \"Unnatural Selection\".",
    "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR0_0k3KobrW8zCZ4aArYJBzXn6N2EW2BMGuQ&s"
  },
  {
    "Actor Name": "Eric Pierpoint",
    "Star Trek Roles": "1993 - Voval - STTNG S7:E2 (Liaisons)\n1997 - Captain Sanders - ST:DS9 S5:E13 (For the Uniform)\n1999 - Kortar - ST:VOY S6:E3 (Barge of the Dead)\n2002 - Shiraht - ST:ENT S1:E18 (Rogue Planet)\n2005 - Harris - ST:ENT S4:E15 (Affliction)\n2005 - Harris - ST:ENT S4:E16 (Divergence)\n2005 - Harris - ST:ENT S4:E20 (Demons)\n2005 - Harris - ST:ENT S4:E21 (Terra Prime)",
    "Mini Bio": "Eric Pierpoint (born 18 November 1950; age 73) is an actor and author who had guest roles in the first four Star Trek spin-off television series Star Trek: The Next Generation, Star Trek: Deep Space Nine, Star Trek: Voyager and Star Trek: Enterprise. He is probably best known for his role as Detective George Francisco in Alien Nation (1989-1990) and its five spin-off television movies (1994-1997). He took over the role from Mandy Patinkin and starred with fellow Trek performers Gary Graham, Michele Scarabelli, and Ron Fassler.\n\nPierpoint was one of several future Star Trek actors who read for the role of William T. Riker, as well as for the lead roles on Deep Space Nine and Voyager, before it was decided to make those characters African-American and a woman, respectively. (citation needed • edit)\n\nOutside of Star Trek, he has appeared on Babylon 5, alongside Star Trek guest stars such as Andreas Katsulas and Patricia Tallman. He had a guest-starring role as US President Jefferson Williams on the fifth season of Sliders (starring Jerry O'Connell). Pierpoint also appeared in Liar Liar (1997, with Anne Haney, Mitchell Ryan, and Chip Mayer). Pierpoint has landed guest roles on CSI: Miami (with Jennifer Gatti) and on CSI: Crime Scene Investigation (starring Paul Guilfoyle, Wallace Langham and Liz Vassey, with Joseph Campanella).",
    "Image": "https://ntvb.tmsimg.com/assets/assets/19845_v9_bb.jpg"
  },
  {
    "Actor Name": "Erick Avari",
    "Star Trek Roles": "1991 - B'iJik - STTNG S5:E7 (Unification I)\n1995 - Vedek Yarka - ST:DS9 S3:E15 (Destiny)\n2001 - Jamin - ST:ENT S1:E6 (Terra Nova)",
    "Mini Bio": "Erick Avari (born 13 April 1952; age 72) is an actor who appeared as B'iJik in the Star Trek: The Next Generation fifth season episode \"Unification I\", Yarka in the Star Trek: Deep Space Nine third season episode \"Destiny\", and Jamin in the Star Trek: Enterprise first season episode \"Terra Nova\".\nAvari is probably known for his supporting roles in Independence Day (1996, with Brent Spiner), The Mummy (1999, with Oded Fehr), The 13th Warrior (1999, with Neil Maffin), Planet of the Apes (2001, with Cary-Hiroyuki, David Warner, Michael Clarke Duncan, Freda Foh Shen, Anne Elizabeth Ramsay, Michael Jace, Eileen Weisinger, Deep Roy, and Kevin Grevioux), Daredevil (2003, with Michael Clarke Duncan, Leland Orser, and Stan Lee). He also voiced Master Rahool in the video games Destiny (2014) and Destiny 2 (2017).\n\nHe is best known for the role of Kasuf in Stargate (1994, with Leon Rippy and Derek Webster) and reprised this role for three episodes of Stargate SG-1 (1998, 1999, and 2001, with Michael Shanks and Anthony Montgomery). He also played Mohinder's father Dr. Chandra Suresh in four episodes of the superhero series Heroes (2006, with Greg Grunberg, Cristine Rose, Tina Lifford, Thomas Dekker, Zachary Quinto, and Josh Clark).\n\nBorn as Nariman Eruch Avari in Darjeeling, West Bengal, India, he attended the North Point School in Darjeeling and later the College of Charleston in Charleston, South Carolina.",
    "Image": "https://ntvb.tmsimg.com/assets/assets/70392_v9_bc.jpg?w=270&h=360"
  },
  {
    "Actor Name": "Ethan Phillips",
    "Star Trek Roles": "1990 - Dr. Farek - STTNG S3:E24 (Ménage à Troi)\n1996 - Holodeck Nightclub Maitre d' - Star Trek: First Contact\n1995-2001 - Neelix - ST:VOY\n2002 - Ulis - ST:ENT S1:E19 (Acquisition)",
    "Mini Bio": "Ethan Phillips (born 8 February 1955; age 69) is the actor best known to Star Trek fans for playing the part of Neelix through all seven seasons of Star Trek: Voyager. He also played two different Ferengi characters, one on Star Trek: The Next Generation and another on Star Trek: Enterprise, and made an uncredited cameo as a holographic mâitre d' in Star Trek: First Contact.\n\nPhillips was born and raised in Long Island, New York. Phillips graduated with a degree in English Literature from Boston University and a Masters Degree in Fine Arts from Cornell University. He began his on-screen acting career playing Pete John Downey on the hit television series Benson. Although the series began airing in 1979, Phillips did not join the series until the following year. Also joining the series in that year was René Auberjonois.\n\nPhillips and Auberjonois co-starred together on Benson until 1985, when Phillips left the series. While still acting on the show, Phillips made his feature film debut with a small role in the acclaimed 1981 drama Ragtime. Starring in this film was Phillips' future Voyager co-star Brad Dourif (Lon Suder). Robert Joy also had a supporting role in the film.\n\nAfter leaving Benson, Phillips began to make a major transition towards films. He had a supporting role in Critters (1986, with Scott Grimes, and the following year, he appeared in Burglar, starring Whoopi Goldberg. He appeared in three films in 1989: Lean on Me (also featuring Tony Todd and Mike Starr), Bloodhounds of Broadway (co-starring Googy Gress, Stephen McHattie and Alan Ruck), and Glory (with Bob Gunton, Cliff DeYoung, Richard Riehle, and Mark Margolis).\n\nPhillips continued to appear on television, however. In 1987, he co-starred with Lance LeGault and Raphael Sbarge in the pilot episode of the short-lived series Werewolf. He also appeared on a number of other TV shows throughout the late 1980s, including an episode of The Twilight Zone with Christopher Carroll.",
    "Image": "https://www.timeshifterspodcast.com/interviews/wp-content/uploads/2016/07/wateropen16.jpg"
  }
]