[
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Andorian 2380s",
    "Affiliation": "Andoria",
    "Franchise": "Prodigy",
    "Reference": "S1:E15 - Masquerade",
    "Details": "The Andorians are mentioned as part of Dal's genetic enhancements, with their DNA contributing to his engineered abilities. While they don’t appear directly, their influence plays a role in Dal's internal struggle with his identity.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/bd00b13e175a575b179eeb3d4266c01cf9c2450b-1100x1100.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Andorian 3100s",
    "Affiliation": "Andoria",
    "Franchise": "Discovery",
    "Reference": "S4:E7 - ...But to Connect",
    "Details": "The Andorians play a minor role as part of the Emerald Chain, an alliance between Andorians and Orions. They serve as enforcers for the chain, and their presence adds to the tension as the crew of the Discovery faces the threat of the syndicate’s growing power and influence.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/f3bdecf5b9e3522c5d575f4069d9b8deec4a02fa-960x964.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Andorian 2150s",
    "Affiliation": "Andoria",
    "Franchise": "Enterprise",
    "Reference": "S3:E13 - Proving Ground",
    "Details": "The Andorians play a significant role by assisting Captain Archer and the crew of the Enterprise in their mission to recover a Xindi superweapon prototype. Commander Shran, representing the Andorians, offers tactical support, though his true motives involve gaining the weapon for the Andorian Imperial Guard. This adds a layer of intrigue and tension to the alliance.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/aa8e72e305d820edf2126f6127df0d6e1dc9a80e-707x643.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Bajoran",
    "Affiliation": "Bajor",
    "Franchise": "Deep Space Nine",
    "Reference": "S6:E7 - You Are Cordially Invited",
    "Details": "The Bajorans play a ceremonial role, with Kira Nerys helping Worf and Jadzia Dax prepare for their traditional Klingon wedding. Kira’s involvement highlights the strong bonds between the Bajorans and the station’s crew during this personal and cultural event.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/fa823fc12687bb5ec2ad0fc4296012584c614c46-735x769.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Borg Collective A",
    "Affiliation": "Borg",
    "Franchise": "The Next Generation",
    "Reference": "The Borg feature heavily in Star Trek: The Next Generation, Star Trek: Voyager,\n Star Trek: Enterprise and Star Trek: Picard and the film Star Trek: First Contact.",
    "Details": "The Borg were a pseudo-species of cybernetic humanoids, or cyborgs, from the Delta Quadrant known as drones, which formed the entire population of the Borg Collective. Their ultimate goal was the attainment of 'perfection' through the forcible assimilation of diverse sentient species, technologies, and knowledge which would be added and absorbed into the hive mind. As a result, the Borg were among the most powerful and feared entities in the galaxy, without really being a true species at all. (TNG: \"Q Who\", \"The Best of Both Worlds\"; Star Trek: First Contact)",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/5d8cfdb7d43c988b4682cae65c546aaa1759ac53-648x647.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Borg Collective B",
    "Affiliation": "Borg",
    "Franchise": "The Next Generation",
    "Reference": "S3:E26 - The Best of Both Worlds",
    "Details": "The Borg launch an invasion of the Federation, capturing and assimilating Captain Picard into their Collective as Locutus to aid in their conquest. The Enterprise crew must stop the Borg's plan to assimilate Earth while grappling with the emotional toll of losing their captain to the enemy.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/1d21a7ff6875348e78e95a7ce64b12e16411b2d2-648x647.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Cardiassia 3100s",
    "Affiliation": "Cardassia",
    "Franchise": "Discovery",
    "Reference": "S4:E7 - ...But to Connect",
    "Details": "The Cardassians are briefly referenced as part of a discussion about past conflicts and the challenges of building trust between former enemies. Though not directly involved in the events, their mention highlights the legacy of past tensions and serves as a reminder of the complex political landscape in the galaxy.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/1f5a99a436177f76fb43e7185ad4cbd19d47eda2-960x964.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Cardassian Union",
    "Affiliation": "Cardassia",
    "Franchise": "Deep Space Nine",
    "Reference": "S6:E19 - In the Pale Moonlight",
    "Details": "The Cardassians play a key role as the primary enemy in the Dominion War, with their alliance to the Dominion threatening the Federation. Sisko, desperate to change the course of the war, works to manipulate the Romulans into joining the fight against the Dominion and Cardassians. The Cardassians are central to the conflict, as Sisko’s covert actions aim to weaken their alliance and gain an advantage for the Federation.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/f16c58d4a6098594dd4b4540b42ea239c43d5c90-648x647.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Ferengi Alliance 3100s",
    "Affiliation": "Ferengi",
    "Franchise": "Discovery",
    "Reference": "S4:E7 - ...But to Connect",
    "Details": "The Ferengi are briefly mentioned during a discussion about the complexities of galactic politics and the importance of diverse perspectives. Their reference underscores the Federation’s interactions with different cultures and economic systems, emphasizing the challenges of uniting disparate factions in pursuit of a common goal.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/230df9f946b1bcb2919d70a194c9a3f003b971bd-960x964.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Ferengi Alliance",
    "Affiliation": "Ferengi",
    "Franchise": "The Next Generation",
    "Reference": "S1:E4 - Code of Honor",
    "Details": "The Ferengi are briefly mentioned as a comparison to the customs of the Ligonian people. This highlights the unfamiliar and sometimes challenging cultural practices the crew encounters during diplomatic interactions with alien species.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/8474060a23a3ea8197bf48c3b979014fb14fa2a5-709x667.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Kazon Order B",
    "Affiliation": "Kazon",
    "Franchise": "Voyager",
    "Reference": "S2:E2 - Initiations",
    "Details": "The Kazon play a central role as Chakotay is captured by a young Kazon trying to earn his warrior status through combat. The Kazon’s rigid societal structure and their focus on proving strength through violence are explored, highlighting the struggles of their factions and their desire for dominance in the region.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/537027b4c4a7081f01b9958621b9e3e2c7f20178-648x647.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Kazon Order A",
    "Affiliation": "Kazon",
    "Franchise": "Voyager",
    "Reference": "S2:E11 - Maneuvers",
    "Details": "The Kazon are central to the episode as they, led by Seska, steal a key piece of Federation technology from Voyager. The Kazon factions unite under Seska’s influence, using the stolen technology to gain an advantage in their ongoing conflicts. Their ambition to control advanced technology and rise in power drives the tension between them and the Voyager crew.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/ef53ee21189dfe045c313fb3e194abc3f77f75cd-648x647.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Kazon Order C",
    "Affiliation": "Kazon",
    "Franchise": "Voyager",
    "Reference": "No Information Available",
    "Details": "The Kazon were an aggressive warrior species from the Delta Quadrant, first encountered by the Federation starship USS Voyager in 2371. (VOY: \"Caretaker\")\nAs of 2372, they were divided into eighteen different sects. Each sect had possession of different natural resources over which the sects fought each other. (VOY: \"Caretaker\", \"Initiations\", \"Alliances\")",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/395f9c9cdd45bd8d0a222338400745d43ed7bb64-648x647.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2400s",
    "Affiliation": "Klingon",
    "Franchise": "Picard",
    "Reference": "S2:E1 - The Star Gazer",
    "Details": "The Klingons are briefly mentioned during discussions about past alliances and conflicts. While they don't play a direct role in the events, their mention highlights the complex history of interstellar politics and the significance of long-standing relationships between the Federation and former adversaries. Their legacy adds depth to the evolving diplomatic landscape.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/4515a196560a36cd0007162273889937b00d003a-990x1014.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2150s B",
    "Affiliation": "Klingon",
    "Franchise": "Enterprise",
    "Reference": "S2:E19 - Judgment",
    "Details": "The Klingons play a central role as Captain Archer is put on trial in a Klingon court, accused of aiding rebels. The episode explores Klingon justice, with Archer facing harsh consequences under their legal system. The trial highlights the Klingon Empire's strict honor code and their desire to assert dominance, while Archer's defense challenges their rigid interpretation of law and honor.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/6ce115d99c90f277fcb8956a90d7f1eb9d396ebf-960x964.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2150s C",
    "Affiliation": "Klingon",
    "Franchise": "Enterprise",
    "Reference": "S2:E19 - Judgment",
    "Details": "The Klingons play a central role as Captain Archer is put on trial in a Klingon court, accused of aiding rebels. The episode explores Klingon justice, with Archer facing harsh consequences under their legal system. The trial highlights the Klingon Empire's strict honor code and their desire to assert dominance, while Archer's defense challenges their rigid interpretation of law and honor.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/47a236f54c2892094eea67406868e3d668f46260-960x964.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Kahles the Unforgettable",
    "Affiliation": "Klingon",
    "Franchise": "Deep Space Nine",
    "Reference": "S8:E23 - Rightful Heir",
    "Details": "The Klingons play a key role as Worf experiences a spiritual crisis and seeks guidance from the legendary Klingon figure Kahless, who seemingly returns to lead the Empire. The episode explores Klingon culture, faith, and the complex relationship between tradition and political power. Worf and the Klingon leadership grapple with the implications of Kahless’s return, testing their beliefs and the unity of the Empire.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/2f4a271d1eb3f192b072521ce626384bf2586474-960x964.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2260s",
    "Affiliation": "Klingon",
    "Franchise": "The Original Series",
    "Reference": "S3:E2 - Elaan of Troyius",
    "Details": "The Klingons play an antagonistic role, attempting to disrupt a crucial diplomatic mission by attacking the Enterprise and trying to prevent the marriage between Elaan and the ruler of Troyius. Their goal is to destabilize the peace between the two planets and gain control of a valuable energy resource, intensifying the tension for Captain Kirk and his crew.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/e9e386911a883f7d6140e5bf2357aa74fd4ef49a-723x646.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2280s",
    "Affiliation": "Klingon",
    "Franchise": "Film",
    "Reference": "Star Trek IV: The Voyage Home",
    "Details": "The Klingons play a political role, seeking retribution for the destruction of a Klingon ship and the death of Commander Kruge at the hands of Captain Kirk. They demand Kirk's punishment, accusing him of unprovoked aggression, and use the situation to heighten tensions between the Federation and the Klingon Empire. While their demands create diplomatic pressure, their pursuit of justice is overshadowed by the larger threat facing Earth.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/1eceb07cc5ea73b7a25b19965f541d44a62f8ff0-723x787.png"
  },
  {
    "Catagory": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2150s A",
    "Affiliation": "Klingon",
    "Franchise": "Enterprise",
    "Reference": "S1:E1 - Broken Bow",
    "Details": "The Klingons play a pivotal role when a wounded Klingon warrior, Klaang, crash-lands on Earth, sparking the first direct encounter between humans and the Klingon Empire. This incident sets off a chain of events that leads Captain Archer and the crew of the Enterprise on a mission to return Klaang to his homeworld. The Klingons' involvement is crucial to the storyline, as tensions rise between the Empire and the newly launched Enterprise, marking the beginning of complex relations between humans and Klingons.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/b6767a812192009cbe0837e3bb3614d1f72fa134-709x784.png"
  }
]