[
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Andorian 2380s",
    "Affiliation": "Andoria",
    "Franchise": "Prodigy",
    "Reference": "S1:E15 - Masquerade",
    "Details": "The Andorians are mentioned as part of Dal's genetic enhancements, with their DNA contributing to his engineered abilities. While they don’t appear directly, their influence plays a role in Dal's internal struggle with his identity.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/bd00b13e175a575b179eeb3d4266c01cf9c2450b-1100x1100.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Andorian 3100s",
    "Affiliation": "Andoria",
    "Franchise": "Discovery",
    "Reference": "S4:E7 - ...But to Connect",
    "Details": "The Andorians play a minor role as part of the Emerald Chain, an alliance between Andorians and Orions. They serve as enforcers for the chain, and their presence adds to the tension as the crew of the Discovery faces the threat of the syndicate’s growing power and influence.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/f3bdecf5b9e3522c5d575f4069d9b8deec4a02fa-960x964.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Andorian 2150s",
    "Affiliation": "Andoria",
    "Franchise": "Enterprise",
    "Reference": "S3:E13 - Proving Ground",
    "Details": "The Andorians play a significant role by assisting Captain Archer and the crew of the Enterprise in their mission to recover a Xindi superweapon prototype. Commander Shran, representing the Andorians, offers tactical support, though his true motives involve gaining the weapon for the Andorian Imperial Guard. This adds a layer of intrigue and tension to the alliance.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/aa8e72e305d820edf2126f6127df0d6e1dc9a80e-707x643.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Bajoran",
    "Affiliation": "Bajor",
    "Franchise": "Deep Space Nine",
    "Reference": "S6:E7 - You Are Cordially Invited",
    "Details": "The Bajorans play a ceremonial role, with Kira Nerys helping Worf and Jadzia Dax prepare for their traditional Klingon wedding. Kira’s involvement highlights the strong bonds between the Bajorans and the station’s crew during this personal and cultural event.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/fa823fc12687bb5ec2ad0fc4296012584c614c46-735x769.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Borg Collective A",
    "Affiliation": "Borg",
    "Franchise": "The Next Generation",
    "Reference": "The Borg feature heavily in Star Trek: The Next Generation, Star Trek: Voyager,\n Star Trek: Enterprise and Star Trek: Picard and the film Star Trek: First Contact.",
    "Details": "The Borg were a pseudo-species of cybernetic humanoids, or cyborgs, from the Delta Quadrant known as drones, which formed the entire population of the Borg Collective. Their ultimate goal was the attainment of 'perfection' through the forcible assimilation of diverse sentient species, technologies, and knowledge which would be added and absorbed into the hive mind. As a result, the Borg were among the most powerful and feared entities in the galaxy, without really being a true species at all. (TNG: \"Q Who\", \"The Best of Both Worlds\"; Star Trek: First Contact)",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/5d8cfdb7d43c988b4682cae65c546aaa1759ac53-648x647.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Borg Collective B",
    "Affiliation": "Borg",
    "Franchise": "The Next Generation",
    "Reference": "S3:E26 - The Best of Both Worlds",
    "Details": "The Borg launch an invasion of the Federation, capturing and assimilating Captain Picard into their Collective as Locutus to aid in their conquest. The Enterprise crew must stop the Borg's plan to assimilate Earth while grappling with the emotional toll of losing their captain to the enemy.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/1d21a7ff6875348e78e95a7ce64b12e16411b2d2-648x647.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Cardiassia 3100s",
    "Affiliation": "Cardassia",
    "Franchise": "Discovery",
    "Reference": "S4:E7 - ...But to Connect",
    "Details": "The Cardassians are briefly referenced as part of a discussion about past conflicts and the challenges of building trust between former enemies. Though not directly involved in the events, their mention highlights the legacy of past tensions and serves as a reminder of the complex political landscape in the galaxy.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/1f5a99a436177f76fb43e7185ad4cbd19d47eda2-960x964.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Cardassian Union",
    "Affiliation": "Cardassia",
    "Franchise": "Deep Space Nine",
    "Reference": "S6:E19 - In the Pale Moonlight",
    "Details": "The Cardassians play a key role as the primary enemy in the Dominion War, with their alliance to the Dominion threatening the Federation. Sisko, desperate to change the course of the war, works to manipulate the Romulans into joining the fight against the Dominion and Cardassians. The Cardassians are central to the conflict, as Sisko’s covert actions aim to weaken their alliance and gain an advantage for the Federation.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/f16c58d4a6098594dd4b4540b42ea239c43d5c90-648x647.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Ferengi Alliance 3100s",
    "Affiliation": "Ferengi",
    "Franchise": "Discovery",
    "Reference": "S4:E7 - ...But to Connect",
    "Details": "The Ferengi are briefly mentioned during a discussion about the complexities of galactic politics and the importance of diverse perspectives. Their reference underscores the Federation’s interactions with different cultures and economic systems, emphasizing the challenges of uniting disparate factions in pursuit of a common goal.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/230df9f946b1bcb2919d70a194c9a3f003b971bd-960x964.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Ferengi Alliance",
    "Affiliation": "Ferengi",
    "Franchise": "The Next Generation",
    "Reference": "S1:E4 - Code of Honor",
    "Details": "The Ferengi are briefly mentioned as a comparison to the customs of the Ligonian people. This highlights the unfamiliar and sometimes challenging cultural practices the crew encounters during diplomatic interactions with alien species.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/8474060a23a3ea8197bf48c3b979014fb14fa2a5-709x667.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Kazon Order B",
    "Affiliation": "Kazon",
    "Franchise": "Voyager",
    "Reference": "S2:E2 - Initiations",
    "Details": "The Kazon play a central role as Chakotay is captured by a young Kazon trying to earn his warrior status through combat. The Kazon’s rigid societal structure and their focus on proving strength through violence are explored, highlighting the struggles of their factions and their desire for dominance in the region.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/537027b4c4a7081f01b9958621b9e3e2c7f20178-648x647.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Kazon Order A",
    "Affiliation": "Kazon",
    "Franchise": "Voyager",
    "Reference": "S2:E11 - Maneuvers",
    "Details": "The Kazon are central to the episode as they, led by Seska, steal a key piece of Federation technology from Voyager. The Kazon factions unite under Seska’s influence, using the stolen technology to gain an advantage in their ongoing conflicts. Their ambition to control advanced technology and rise in power drives the tension between them and the Voyager crew.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/ef53ee21189dfe045c313fb3e194abc3f77f75cd-648x647.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Kazon Order C",
    "Affiliation": "Kazon",
    "Franchise": "Voyager",
    "Reference": "No Information Available",
    "Details": "The Kazon were an aggressive warrior species from the Delta Quadrant, first encountered by the Federation starship USS Voyager in 2371. (VOY: \"Caretaker\")\nAs of 2372, they were divided into eighteen different sects. Each sect had possession of different natural resources over which the sects fought each other. (VOY: \"Caretaker\", \"Initiations\", \"Alliances\")",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/395f9c9cdd45bd8d0a222338400745d43ed7bb64-648x647.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2400s",
    "Affiliation": "Klingon",
    "Franchise": "Picard",
    "Reference": "S2:E1 - The Star Gazer",
    "Details": "The Klingons are briefly mentioned during discussions about past alliances and conflicts. While they don't play a direct role in the events, their mention highlights the complex history of interstellar politics and the significance of long-standing relationships between the Federation and former adversaries. Their legacy adds depth to the evolving diplomatic landscape.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/4515a196560a36cd0007162273889937b00d003a-990x1014.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2150s B",
    "Affiliation": "Klingon",
    "Franchise": "Enterprise",
    "Reference": "S2:E19 - Judgment",
    "Details": "The Klingons play a central role as Captain Archer is put on trial in a Klingon court, accused of aiding rebels. The episode explores Klingon justice, with Archer facing harsh consequences under their legal system. The trial highlights the Klingon Empire's strict honor code and their desire to assert dominance, while Archer's defense challenges their rigid interpretation of law and honor.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/6ce115d99c90f277fcb8956a90d7f1eb9d396ebf-960x964.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2150s C",
    "Affiliation": "Klingon",
    "Franchise": "Enterprise",
    "Reference": "S2:E19 - Judgment",
    "Details": "The Klingons play a central role as Captain Archer is put on trial in a Klingon court, accused of aiding rebels. The episode explores Klingon justice, with Archer facing harsh consequences under their legal system. The trial highlights the Klingon Empire's strict honor code and their desire to assert dominance, while Archer's defense challenges their rigid interpretation of law and honor.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/47a236f54c2892094eea67406868e3d668f46260-960x964.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Kahles the Unforgettable",
    "Affiliation": "Klingon",
    "Franchise": "Deep Space Nine",
    "Reference": "S8:E23 - Rightful Heir",
    "Details": "The Klingons play a key role as Worf experiences a spiritual crisis and seeks guidance from the legendary Klingon figure Kahless, who seemingly returns to lead the Empire. The episode explores Klingon culture, faith, and the complex relationship between tradition and political power. Worf and the Klingon leadership grapple with the implications of Kahless’s return, testing their beliefs and the unity of the Empire.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/2f4a271d1eb3f192b072521ce626384bf2586474-960x964.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2260s",
    "Affiliation": "Klingon",
    "Franchise": "The Original Series",
    "Reference": "S3:E2 - Elaan of Troyius",
    "Details": "The Klingons play an antagonistic role, attempting to disrupt a crucial diplomatic mission by attacking the Enterprise and trying to prevent the marriage between Elaan and the ruler of Troyius. Their goal is to destabilize the peace between the two planets and gain control of a valuable energy resource, intensifying the tension for Captain Kirk and his crew.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/e9e386911a883f7d6140e5bf2357aa74fd4ef49a-723x646.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2280s",
    "Affiliation": "Klingon",
    "Franchise": "Film",
    "Reference": "Star Trek IV: The Voyage Home",
    "Details": "The Klingons play a political role, seeking retribution for the destruction of a Klingon ship and the death of Commander Kruge at the hands of Captain Kirk. They demand Kirk's punishment, accusing him of unprovoked aggression, and use the situation to heighten tensions between the Federation and the Klingon Empire. While their demands create diplomatic pressure, their pursuit of justice is overshadowed by the larger threat facing Earth.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/1eceb07cc5ea73b7a25b19965f541d44a62f8ff0-723x787.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Klingon Empire 2150s A",
    "Affiliation": "Klingon",
    "Franchise": "Enterprise",
    "Reference": "S1:E1 - Broken Bow",
    "Details": "The Klingons play a pivotal role when a wounded Klingon warrior, Klaang, crash-lands on Earth, sparking the first direct encounter between humans and the Klingon Empire. This incident sets off a chain of events that leads Captain Archer and the crew of the Enterprise on a mission to return Klaang to his homeworld. The Klingons' involvement is crucial to the storyline, as tensions rise between the Empire and the newly launched Enterprise, marking the beginning of complex relations between humans and Klingons.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/b6767a812192009cbe0837e3bb3614d1f72fa134-709x784.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Orion Syndicate 2380s",
    "Affiliation": "Orion",
    "Franchise": "Prodigy",
    "Reference": "S1:E15 - Masquerade",
    "Details": "The Orions are represented through their connection to Okona, who is revealed to have ties with the notorious Orion Syndicate. This criminal organization demonstrates its far-reaching influence and power, adding tension and danger to the story. Their involvement underscores the darker, more illicit aspects of interstellar dealings, as the crew encounters the complex and perilous nature of alliances and underworld forces within the galaxy.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/399bde4ea0ce4e4ef4e60a3153bc48889b664795-1100x1100.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Orion 3100s",
    "Affiliation": "Orion",
    "Franchise": "Discovery",
    "Reference": "S4:E7 - ...But to Connect",
    "Details": "The Orions, through the Emerald Chain and their leader Osyraa, wield significant influence in the galaxy, blending piracy with diplomacy. Their role highlights a strategic challenge to the Federation, as they navigate power and control with ruthless ambition, positioning themselves as key players in interstellar politics.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/07828daf9fec4aacd57cfab973b592c7fff48e2a-960x964.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Orion Syndicate 2260s",
    "Affiliation": "Orion",
    "Franchise": "The Animated Series",
    "Reference": "S2:E1 - The Pirates of Orion",
    "Details": "The Orions are depicted as cunning and ruthless pirates, attempting to smuggle a deadly drug vital for Spock’s survival. Their actions highlight their willingness to engage in dangerous criminal activities for profit, presenting them as a persistent threat to Federation stability while showcasing their resourcefulness in evading capture and exploiting vulnerabilities.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/50c00a9bc1d89edd6441b3bdf99eb3de157b613c-1100x1099.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Ni'Var",
    "Affiliation": "Vulcan / Romulan",
    "Franchise": "Discovery",
    "Reference": "S4:E7 - ...But to Connect",
    "Details": "Ni'Var serves as a pivotal point of reconciliation between Vulcan and Romulan cultures, representing a new era of cooperation following centuries of division. The planet embodies the complex heritage of both species, emphasizing their shared history while navigating the challenges of rebuilding trust. As a center for diplomatic efforts, Ni'Var highlights the potential for unity and understanding amidst past conflicts, playing a crucial role in the ongoing evolution of interstellar relations.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/2990710ea85dd17e70823c2e1ecd476e7adafd16-960x964.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Romulan Empire 2380s",
    "Affiliation": "Romulan",
    "Franchise": "Prodigy",
    "Reference": "S1:E15 - Masquerade",
    "Details": "The Romulan Star Empire is depicted as a secretive and manipulative force, leveraging espionage and cunning strategies to advance its interests. Their presence underscores the tension within the narrative, as the crew navigates the challenges posed by Romulan intrigue and deception. The Empire’s involvement highlights its ongoing quest for control, emphasizing the complex political landscape that characters must maneuver through while facing potential threats from this formidable power.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/546eba5e0802fab052ff1a38563331b26f7bcf95-1100x1100.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Romulan Star Empire 2380s C",
    "Affiliation": "Romulan",
    "Franchise": "Lower Decks",
    "Reference": "S1:Ei - Veritas",
    "Details": "The Romulans are portrayed as cunning and secretive, embodying traits of manipulation and espionage. Their involvement adds an element of tension and intrigue, as the crew grapples with the repercussions of their clandestine actions. The Romulans’ presence serves to underscore the complexities of interstellar relations, revealing their readiness to engage in deception while challenging the ideals of honesty and transparency upheld by the Federation.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/3de3f77035b9ae9bc2f3a798eda597bb56b36e5d-990x1014.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Romujlan Star Empire 2360s",
    "Affiliation": "Romulan",
    "Franchise": "The Next Generation",
    "Reference": "Sw:E11 - Contagion",
    "Details": "I apologize for the oversight and appreciate your patience. Here’s a revised version without any reference to \"episode\":\n\nThe Romulans play a significant role in the crisis, utilizing their cunning and strategic prowess to manipulate the situation to their advantage. Their actions highlight their willingness to exploit vulnerabilities, particularly in their rivalry with the Federation. This dynamic underscores the tension between the Romulans and the Enterprise crew, revealing the dangers of their advanced technology and the lengths they will go to maintain their power and secrecy in a complex interstellar landscape.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/ed051e70e674a4802957c3783488a150136186ba-936x936.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Romulan Star Empire 2150s",
    "Affiliation": "Romulan",
    "Franchise": "Enterprise",
    "Reference": "S4:E12 - Babel One",
    "Details": "The Romulans exploit the tensions surrounding the conflict between the Andorians and the Tellarites, manipulating the situation to create distrust and further their own agenda. Their secretive actions contribute to the misunderstandings that escalate the crisis, showcasing their role as provocateurs. By orchestrating events from the shadows, the Romulans reveal their strategic cunning and desire to undermine the coalition among the Federation members, demonstrating how their influence can disrupt interstellar relations and instigate conflict.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/3a8b3fa9a72d18181884500aea2437e4068c30e2-1000x1000.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "Romulan Star Empire 2370s",
    "Affiliation": "Romulan",
    "Franchise": "Film",
    "Reference": "Star Trek: Nemesis",
    "Details": "Shinzon is a Romulan clone of Captain Picard, created as part of a secretive plot by the Romulan Empire. His existence reflects the darker side of Romulan ambition, as he embodies both the potential and the burdens of his lineage. Struggling with his identity, Shinzon grapples with feelings of isolation and a longing for connection, which drives his actions throughout the narrative. His complex character raises questions about nature versus nurture, showcasing the impact of his origins on his motivations and choices.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/347ffbd25dadba2cdc07f8fd5bc09b92ead11352-719x667.png"
  },
  {
    "Category": "Species",
    "Emblem / Insignia Name": "The Dominion",
    "Affiliation": "Dominion",
    "Franchise": "Deep Space Nine",
    "Reference": "No Information Available",
    "Details": "The Dominion is a powerful and authoritarian interstellar empire central to the narrative of *Deep Space Nine*. Led by the Founders, a shape-shifting species, the Dominion employs genetically engineered Jem'Hadar and manipulative Vorta to enforce its will. Their expansionist agenda poses a significant threat to the Alpha Quadrant, as they seek to impose control through military might and strategic alliances. The Dominion's ruthless methods challenge the Federation's principles of freedom and diplomacy, leading to a complex and intense conflict that influences the series' themes of war, loyalty, and power.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/dfa05355fcd6c8fe820afa292a676f6e3ab52518-707x726.png"
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "Starfleet Academy",
    "Affiliation": "Starfleet",
    "Franchise": "The Next Generation",
    "Reference": "S5:E19 - The First Duty",
    "Details": "Starfleet Academy is the prestigious training institution for future officers of Starfleet, emphasizing academic excellence, leadership, and exploration. In \"The First Duty,\" the story revolves around a group of cadets, including Wesley Crusher, who are involved in a fatal flying accident during a routine flight exercise. The episode explores themes of responsibility, integrity, and the pressure of competition, particularly as Wesley grapples with the truth about the incident and its implications for his future in Starfleet. It highlights the moral complexities faced by those aspiring to serve.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/e8555c008a9c84868687dd63865213df0c5f79aa-683x631.png"
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "MACO Deployment Patch",
    "Affiliation": "Federation",
    "Franchise": "Enterprise",
    "Reference": "S3:E15 - Harbinger",
    "Details": "A detachment of troops commanded by Major J. Hayes was assigned to the Starfleet vessel Enterprise NX-01 for a mission into the Delphic Expanse in 2153. Admiral Maxwell Forrest was surprised that Captain Jonathan Archer had requested military officers aboard his ship. (ENT: \"The Expanse\") When the MACOs first came aboard Enterprise, they certainly felt like outsiders, tasked to integrate with the ship's Starfleet contingent. (ENT: \"Countdown\") The MACOs saw their first action six weeks into the mission; in September, Hayes and a six-man team rescued Archer, Commander Tucker, and Kessick from the clutches of a trellium mining planet. (ENT: \"The Xindi\") By the end of their time in the Delphic Expanse, none of the MACOs aboard Enterprise felt like outsiders anymore. (ENT: \"Countdown\")",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/7c300430026056c5e43134d56dc17bcfdde628fe-747x733.png"
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "UFP Flag 2370s",
    "Affiliation": "Federation",
    "Franchise": "Deep Space Nine",
    "Reference": "S4:E11 - Homefront",
    "Details": "Flag/Banner of the United Federation of Planet in the 2370's.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/d263e01bc2c41517734138099874ec2c45ce92e9-648x647.png"
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "Starfleet Academy Red Squad",
    "Affiliation": "Federation",
    "Franchise": "Deep Space Nine",
    "Reference": "S6:E22 - Valiant",
    "Details": "Shortly before the outbreak of the Dominion War, Red Squad was assigned to crew the USS Valiant, on a training mission to circumnavigate the Federation. Following the outbreak of war, the Valiant found itself trapped behind enemy lines. When the ranking officers were killed, Cadet Tim Watters was given command of the Valiant by the late Captain Ramirez, and kept the ship behind enemy lines. For eight months, Red Squad carried out the missions assigned to the Valiant, until, on Stardate 51825, the Valiant engaged a Dominion battleship prototype. The ship was lost, with only three survivors – one Red Squad cadet among them, Dorian Collins. One of the other survivors, Ensign Nog, concluded that Red Squad was an overall good crew whose inexperience caused them to blindly follow an unqualified and incompetent commanding officer. (DS9: \"Valiant\")",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/0ff8d3403263b2526082805485fc0fdfa5138cdd-749x687.png"
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "Starfleet Academy Red Squad",
    "Affiliation": "Federation",
    "Franchise": "Deep Space Nine",
    "Reference": "S6:E22 - Valiant",
    "Details": "Nog and Jake Sisko find themselves aboard the Red Squad's ship after being rescued by the elite group during a Dominion attack. Nog is quickly accepted by the cadets due to his Starfleet rank, while Jake remains skeptical of the crew's overconfidence and mission objectives. As the cadets, led by an inexperienced acting captain, pursue their ambitious goal of destroying a Dominion battleship, the situation spirals out of control. Their arrogance and lack of real-world experience lead to disaster, as the mission ultimately fails, resulting in the destruction of the ship and the deaths of most of the crew.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/b2ec859b06724bb3f9a59d31f4528a01612e33b8-889x603.png"
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "Tal Shiar",
    "Affiliation": "Romulan",
    "Franchise": "Deep Space Nine",
    "Reference": "S3:E21 - The Die is Cast",
    "Details": "The Tal Shiar, the Romulan intelligence agency, collaborates with the Cardassian Obsidian Order in a joint mission to destroy the Founders of the Dominion. Their plan involves launching a surprise assault on the Founders' homeworld, believing that eliminating the shape-shifters will cripple the Dominion. The Tal Shiar’s ruthless nature and covert operations are on full display, as they are willing to undertake this extreme measure for Romulan security. However, the mission is revealed to be a Dominion trap, resulting in the destruction of the joint fleet and a significant blow to both the Tal Shiar and Obsidian Order. This failure marks a turning point, exposing the Tal Shiar's limitations in their overreach.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/76b65a95daa6b72c6cb2da2fe70a5e5ba31f5842-911x497.png"
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "Klingon-Cardassian Alliance",
    "Affiliation": "Klingon / Cardassian",
    "Franchise": "Deep Space Nine",
    "Reference": "S7:E12 - The Emperor's New Cloak",
    "Details": "The **Klingon-Cardassian Alliance** is an alternate universe faction within the *Star Trek* Mirror Universe, where the Klingon Empire and the Cardassian Union form a powerful alliance to dominate the Alpha Quadrant. This alliance is known for its brutal control over its territories, subjugating other species such as the Terrans (humans) who were once part of the fallen Terran Empire. In this universe, the Klingon-Cardassian Alliance exerts its power through a combination of military force and oppression, with both Klingon and Cardassian leaders working together to expand their control. The alliance represents a dangerous and authoritarian regime, standing in stark contrast to the freedom and ideals found in the Prime Universe's Federation. This alternate history of cooperation between the two typically adversarial species highlights the radically different dynamics present in the Mirror Universe.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/40336d69a37e4831c913a9293cfcc670af66ea43-911x757.png"
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "Obsidian Order",
    "Affiliation": "Cardassian",
    "Franchise": "Deep Space Nine",
    "Reference": "No Information Available",
    "Details": "The **Obsidian Order** is the Cardassian Union's elite and secretive intelligence agency, known for its ruthless efficiency and unparalleled surveillance capabilities. It operates outside the control of the Cardassian military, often working in the shadows to maintain strict control over Cardassian society and suppress any dissent. The Obsidian Order is feared not only by the Cardassian population but also by their enemies due to its covert operations, espionage, and ability to eliminate perceived threats with cold precision. Their collaboration with the Romulan Tal Shiar in a failed attempt to attack the Dominion demonstrated both their ambition and their vulnerability when outmaneuvered by a more powerful adversary.",
    "Image": "https://www.st-minutiae.com/resources/logos/Card_Obsidian-order.gif"
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "Vulcan V'Shar",
    "Affiliation": "Vulcan",
    "Franchise": "Enterprise",
    "Reference": "The **V’Shar** is the highly secretive and elite intelligence organization of Vulcan, tasked with maintaining the security of the planet and protecting its interests across the galaxy. Known for its efficiency and dedication to logic, the V’Shar operates covertly, employing agents who use their superior intellect and discipline to carry out missions of espionage, intelligence gathering, and counterintelligence. While most Vulcans value openness and diplomacy, the V'Shar reflects a more guarded and strategic side of Vulcan society, operating in the shadows to ensure stability and prevent external and internal threats. Despite their loyalty to Vulcan's ideals, the V'Shar's methods can be seen as morally complex, occasionally leading to tension between them and other Federation members who value transparency. The organization is rarely spoken of openly, adding to its mysterious reputation.",
    "Details": "https://cdn.sanity.io/images/tdiy7fer/production/8a9e2841727937808def7e902fc9eb3fe3cd33d5-707x725.png",
    "Image": ""
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "Vulcan Science Academy",
    "Affiliation": "Vulcan / Romulan",
    "Franchise": "Discovery",
    "Reference": "S2:E5 - Charades",
    "Details": "The **Vulcan Science Academy** is one of the most prestigious institutions of learning in the galaxy, known for its rigorous academic standards and focus on scientific discovery. Located on Vulcan, the academy is dedicated to advancing knowledge in fields such as astrophysics, biology, and logic-driven research. It has produced some of the most brilliant minds in the Federation, including Spock, and is renowned for its contributions to space exploration and scientific innovation. Despite its focus on logic and reason, the academy has occasionally been criticized for its rigid adherence to traditional Vulcan principles, particularly in matters related to emotional suppression and telepathy, which has led to some Vulcans, like Sybok, rejecting its teachings. Nonetheless, the Vulcan Science Academy remains a cornerstone of Vulcan society and an essential part of the Federation's scientific community.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/85564cef827ff6e1e538134ca07d985c311a955c-1000x1000.png"
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "Klingon Defense Force 2370s",
    "Affiliation": "Klingon",
    "Franchise": "Deep Space Nine",
    "Reference": "No Information Available",
    "Details": "The **Klingon Defense Force** (KDF) is the military arm of the Klingon Empire, tasked with protecting the empire's interests and expanding its territories through conquest. Known for their fierce warriors and battle-hardened fleet, the KDF operates under a strict code of honor, where bravery and personal combat prowess are highly valued. Klingon warriors serve aboard formidable warships like the Bird-of-Prey and Vor'cha-class attack cruisers, often seeking glory in battle. The KDF plays a significant role in galactic conflicts, frequently clashing with other major powers like the Federation, Romulans, and the Dominion, while maintaining a volatile but essential alliance with the United Federation of Planets during key moments in galactic history.",
    "Image": "https://www.st-minutiae.com/resources/logos/KDF_2374.gif"
  },
  {
    "Category": "Organization",
    "Emblem / Insignia Name": "Starfleet Medical 2280s",
    "Affiliation": "Federation",
    "Franchise": "Film",
    "Reference": "Star Trek: The Motion Picture",
    "Details": "Starfleet Medical plays a crucial role as the central medical authority within Starfleet, overseeing the health and well-being of Starfleet personnel across the fleet. Its expertise is vital in ensuring that starship crews are prepared for the rigors of space exploration, handling both routine medical care and complex health challenges. Starfleet Medical is responsible for the development of medical protocols, the training of medical officers, and the provision of advanced medical technology to treat injuries and illnesses encountered in space. Their work ensures that personnel remain fit and ready for any situation that may arise during Starfleet's deep-space missions.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/f4d29eec580b15d338ce893ac0a2bff7f00322dc-665x628.png"
  },
  {
    "Category": "Miscellaneous",
    "Emblem / Insignia Name": "Bajoran Gratitude Festival",
    "Affiliation": "Bajoran",
    "Franchise": "Deep Space Nine",
    "Reference": "S3:E10 - Fascination",
    "Details": "The **Bajoran Gratitude Festival** is a joyous and spiritually significant celebration observed by the Bajoran people. Held annually, it marks a time for individuals to release their emotional burdens, forgive past grievances, and express gratitude for their blessings. The festival is characterized by vibrant ceremonies, the burning of renewal scrolls that symbolically release negative emotions, and the wearing of colorful garb. The Bajoran Gratitude Festival promotes unity and spiritual renewal, embodying the deep religious and cultural traditions of the Bajoran people, who place great importance on their connection to the Prophets and the Celestial Temple.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/368b40f16dae11a7c8934af2cef0bc9df088f67e-757x728.png"
  },
  {
    "Category": "Miscellaneous",
    "Emblem / Insignia Name": "Quark's Bar",
    "Affiliation": "",
    "Franchise": "Deep Space Nine",
    "Reference": "S3:E15 - Destiny",
    "Details": "Quark's was the multi-level, vibrant and popular central attraction of Deep Space 9's Promenade, drawing crowds of travelers and station inhabitants with its offerings of drink, food, gossip, gaming and fantasy fulfillment. The proprietor of the establishment was Quark, a Ferengi entrepreneur and sometimes petty criminal who was the eternal thorn in the side of the station's Chief of Security, Odo. Despite his alliances on the wrong side of the law, Quark was a capable and amiable host, and the bar was usually one of the most popular places for recreation on the station.",
    "Image": "https://cdn.sanity.io/images/tdiy7fer/production/fa44fcd82810b201969342f3badbf9ecfa58ad38-641x609.png"
  },
  ]