[
  {
    "Affiliation": "Romulan",
    "Class": "No designation",
    "Ship": "Bird-of-Prey",
    "Propulsion": "Warp Drive",
    "Details": "The 22nd-century Romulan Bird-of-Prey is an early but formidable starship in the Romulan Star Empire’s fleet, first seen during the Earth-Romulan War (circa 2156–2160). Smaller and less technologically advanced than later Romulan vessels, it still posed a significant threat to its adversaries. This ship was primarily designed for stealth and surprise attacks, aligning with the Romulans' strategic focus on deception and ambush tactics.\n\nOne of its most distinctive features is its cloaking device, which made the Bird-of-Prey nearly invisible to enemy sensors. While cloaked, the ship could navigate undetected but was unable to fire its weapons without decloaking. The Bird-of-Prey was equipped with plasma torpedoes, highly destructive weapons that could cause severe damage to enemy vessels, making it dangerous despite its relatively small size.\n\nThe ship’s propulsion system featured warp drive, which allowed for faster-than-light travel, though it was not as advanced as the warp technologies used by Earth or Vulcan at the time. Its compact size and agility made it well-suited for rapid strikes and evasive maneuvers, relying heavily on its cloaking capabilities to evade detection.\n\nInternally, the Bird-of-Prey had a spartan design, with minimal creature comforts for the crew, reflecting the militaristic and secretive nature of Romulan society. The crew's primary mission was to serve the Empire, with little emphasis on personal comfort or luxury. Romulan ships of this era were often remotely operated or crewed with a minimal number of personnel, a testament to the Romulans’ efficiency in warfare.\n\nDuring its initial encounters with Earth Starfleet, the Bird-of-Prey was a fearsome opponent, utilizing its cloaking technology and powerful plasma weapons to strike quickly and disappear before retaliatory action could be taken. Its presence in the Neutral Zone would continue to be a symbol of Romulan aggression and secrecy for decades to come.",
    "Image": "https://lh3.googleusercontent.com/proxy/NSRHIr-sObfSQY-Oz1TiE-d20mTvd1BAMrka3zNOWVqpKM62_Uppkybg0BbG7eyeF9TXUH5_oZ7Wy6t6KLtEv5UbLK9jElUt7w3p64g-s3xhEBs"
  },
  {
    "Affiliation": "Romulan",
    "Class": "D7",
    "Ship": "Battlecruiser",
    "Propulsion": "Warp Drive",
    "Details": "The Romulan D7 Battlecruiser was a powerful warship used by the Romulan Star Empire in the 23rd century. It was a product of a technology-sharing agreement between the Romulans and the Klingon Empire, resulting in the Romulans adopting the Klingon D7 design for their fleet. The ship was primarily used for military engagements, reconnaissance, and enforcing the Romulan Empire's interests across the Neutral Zone.\n\nVisually, the Romulan D7 shares the same menacing and predatory silhouette as its Klingon counterpart, featuring a long neck and a forward-mounted command module. Its main hull is broad and wing-like, giving it a striking appearance and a sense of power. Despite its Klingon design, the Romulans modified the D7 to suit their strategic needs. The most significant modification was the integration of a cloaking device, allowing the ship to hide from enemy sensors and strike by surprise, a hallmark of Romulan tactics.\n\nArmed with disruptor cannons and photon torpedoes, the Romulan D7 was capable of engaging enemy vessels with devastating firepower. While the ship's armament was substantial, its real advantage lay in its ability to cloak, giving Romulan commanders the opportunity to attack with the element of surprise or retreat without fear of being followed. In battle, the Romulan D7 often employed hit-and-run tactics, emerging from cloak to unleash a deadly assault before disappearing again to avoid counterattacks.\n\nThe D7 was also equipped with a warp drive, allowing it to traverse large distances at high speeds, making it a versatile ship capable of rapid deployment in the Romulan fleet. Though not the most advanced Romulan vessel, the D7 Battlecruiser represented a significant leap in their naval capabilities due to the Klingon alliance, enhancing their military strength during a crucial period of galactic politics.\n\nThe Romulan D7 Battlecruiser played a key role in maintaining Romulan presence and enforcing territorial boundaries, particularly in skirmishes with the United Federation of Planets, where it served as a symbol of Romulan strength and cunning.",
    "Image": "https://lh6.googleusercontent.com/proxy/icTxBE6TzUkgoAfhsBqBiHOHw2hLBFyW7iXEnzalDJUWCGTOTtlhsxeiceg2MF97nj_yNWqTsXSC6oLRSLYd1q2p0jw8qIK6vH_hby9jSrHaY9HYFzFXeuyM9yM7HbpfeeGHZUD344irm_TtQ6Jg6FnbSjPV25rhzToJ39ilfQ"
  },
  {
    "Affiliation": "Romulan",
    "Class": "D'deridex",
    "Ship": "Warbird",
    "Propulsion": "Artificial Quantum\nSingularity",
    "Details": "The Romulan D'deridex-class Warbird is one of the most iconic and formidable starships in the Romulan Star Empire's fleet, introduced in the 24th century. This massive vessel became a symbol of Romulan power and intimidation, used extensively for both military operations and diplomacy. Its distinctive avian design, with its forward-swept wings and imposing green hull, mirrored the Romulan Bird-of-Prey aesthetic, but on a much grander scale.\n\nMeasuring over 1,300 meters in length, the D'deridex is significantly larger than most Federation and Klingon ships of its time. Its sheer size allows for an extensive crew and a wide range of tactical systems, including powerful disruptor arrays and plasma torpedo launchers. These weapons make the D'deridex a formidable opponent in direct combat, capable of overwhelming most adversaries with its firepower. Its strategic advantage, however, lies in its cloaking device, allowing the Warbird to remain invisible to enemy sensors until it is ready to strike. Romulan commanders frequently utilized this advantage to ambush or evade enemy forces.\n\nThe D'deridex-class Warbird is powered by an advanced artificial quantum singularity, a miniature black hole used as a power source, which provides an immense amount of energy to the ship’s systems, including its warp drive. This technology, unique to Romulan engineering, made the Warbird highly efficient in terms of energy output, allowing it to maintain long-term cloaking without depleting its resources.\n\nInternally, the Warbird was equipped with advanced sensor and communication systems, making it an effective tool for espionage, intelligence gathering, and strategic missions. Despite its militaristic design, the ship also functioned as a mobile command center for Romulan political and military leaders.\n\nThe D'deridex was frequently encountered by the Federation throughout the 24th century, particularly during periods of heightened tension between the two powers. Its combination of size, firepower, and cloaking technology made it a ship to be feared and respected, embodying the Romulan Empire’s values of strength, secrecy, and dominance in the Alpha and Beta Quadrants.",
    "Image": "https://swat-portal.com/forum/gallery/userImages/db/8723-dbcbf566.jpg"
  },
  {
    "Affiliation": "Romulan",
    "Class": "No designation",
    "Ship": "Valdore",
    "Propulsion": "Warp Drive",
    "Details": "The Romulan Valdore-class Warbird is a sleek and advanced starship introduced by the Romulan Star Empire in the late 24th century. Named after the famous Romulan military commander Valdore, this ship represents a departure from the bulkier D'deridex-class, favoring a more agile and streamlined design. First seen in action during the Romulan-Federation alliance against the Reman Warbird Scimitar in 2379, the Valdore-class symbolizes the Romulan Empire’s continual evolution in starship engineering and tactics.\n\nThe Valdore-class Warbird features a sleek, bird-like hull, with long, forward-swept wings that give it an elegant and predatory appearance. This design reflects the Romulan preference for ships that evoke power and stealth, and its construction emphasizes both offensive and defensive capabilities. The ship is slightly smaller than the D'deridex-class, which allows it to be more maneuverable in battle, yet it maintains the signature cloaking technology that makes Romulan vessels so dangerous. Its cloaking device allows it to remain invisible to enemy sensors, facilitating ambush tactics and surprise strikes.\n\nIn terms of armament, the Valdore-class is heavily equipped with disruptor banks and plasma torpedo launchers, delivering substantial firepower that can overwhelm opponents quickly. Its tactical systems are cutting-edge, designed for rapid and precise strikes against enemy ships. The Valdore-class also incorporates advanced shielding technology, making it highly resistant to enemy attacks once it decloaks to engage in combat.\n\nThe ship's propulsion is powered by a warp core, which allows it to travel at high warp speeds across vast distances, making it suitable for both rapid response and long-range reconnaissance missions. It also features enhanced sensor systems and tactical computers, enabling it to perform covert operations with precision.\n\nThe Valdore-class Warbird played a crucial role in Romulan military operations during the late 24th century, particularly in the growing tensions with the Federation and the Klingon Empire. Its sleek design, potent weaponry, and cutting-edge cloaking technology made it one of the most advanced ships in the Romulan fleet, capable of asserting Romulan dominance in space while maintaining the element of stealth that the Empire prized.",
    "Image": "https://cdn.thingiverse.com/renders/bf/34/91/6b/23/3cafd7ff6243c3a87b96e6bad8b946e8_display_large.jpg"
  },
  {
    "Affiliation": "Reman",
    "Class": "No designation",
    "Ship": "Scimitar",
    "Propulsion": "Warp Drive",
    "Details": "The Reman Scimitar is one of the most terrifying and powerful warships ever constructed, first appearing in the late 24th century. Built by the Remans, an oppressed species within the Romulan Star Empire, the Scimitar was designed as a tool of rebellion and destruction. It played a central role in the attempted coup against the Romulan government led by Shinzon, a clone of Captain Jean-Luc Picard, and served as the primary antagonist vessel in the events of Star Trek: Nemesis (2379).\n\nThe Scimitar is an enormous, imposing vessel, dwarfing even the Romulan D'deridex-class Warbird. Its design, unlike the graceful and avian aesthetic of Romulan ships, is more angular and predatory, with a dark, menacing appearance. The ship is incredibly well-armed, featuring a vast array of disruptor cannons and photon torpedo launchers, giving it unparalleled firepower. However, its most fearsome weapon is the thalaron radiation emitter, a devastating biogenic weapon capable of wiping out all organic life on a planetary scale. This weapon is considered one of the most dangerous in the galaxy, banned by most species due to its genocidal capabilities.\n\nDespite its massive size, the Scimitar is remarkably fast and maneuverable, outfitted with multiple warp cores, allowing for high-speed travel and impressive battlefield agility. Its hull is reinforced with heavy armor and powerful shields, making it highly resistant to enemy attacks. Moreover, the ship is equipped with an advanced cloaking device that is far more sophisticated than typical Romulan cloaking technology—it allows the Scimitar to remain cloaked even while firing its weapons, a significant tactical advantage that makes it almost invincible in combat situations.\n\nInternally, the Scimitar is crewed largely by Remans, and the ship’s systems are optimized for the cold, harsh environment of their homeworld. It is a warship designed for domination and destruction, reflecting the brutal history of the Reman people and their desire for revenge against their Romulan oppressors.\n\nThe Scimitar’s debut in 2379, during Shinzon’s coup attempt, marked a significant threat to both the Romulan Empire and the Federation. Its combination of overwhelming firepower, near-invulnerability, and the lethal thalaron radiation weapon made it one of the most dangerous ships ever encountered by the Federation.",
    "Image": "https://live.staticflickr.com/5800/23171023739_81c7a4bb88_b.jpg"
  },
  {
    "Affiliation": "Klingon",
    "Class": "None",
    "Ship": "Negh'Var",
    "Propulsion": "Warp Drive",
    "Details": "The Klingon Negh'Var-class Warship is the largest and most powerful vessel in the Klingon Defense Force, introduced in the late 24th century. As the flagship of the Klingon Empire, the Negh'Var is a symbol of Klingon strength and military prowess. It made its first appearance during the Klingon-Federation conflict in 2372, commanded by Chancellor Gowron, and has since played a crucial role in major Klingon military operations, including conflicts with the Federation, Cardassians, and the Dominion.\n\nThe Negh'Var is a massive vessel, considerably larger than the Klingon Vor'cha-class attack cruiser. Its design reflects the traditional Klingon warship aesthetic, with an aggressive, angular structure and forward-mounted weapons arrays. However, the Negh'Var takes this design to a new level, incorporating more advanced technology and greater firepower.\n\nArmed with a formidable array of disruptor cannons, photon torpedoes, and polaron beam weapons, the Negh'Var is capable of devastating enemy fleets. These weapons systems are arranged along the forward section and wings of the ship, allowing it to unleash concentrated volleys on adversaries. In addition, the Negh'Var's powerful shield generators and reinforced hull plating give it the durability needed to engage in prolonged battles with enemy ships, even those of similar or greater size.\n\nOne of the key features of the Negh'Var is its command and control capabilities. As the flagship of the Klingon Empire, it is often used as a mobile base of operations for the Chancellor or top military commanders. The ship is equipped with sophisticated communications and sensor arrays, allowing it to coordinate large fleets during major engagements or invasions. This makes the Negh'Var not only a formidable warship but also a critical asset in Klingon strategic operations.\n\nPowered by an advanced warp core, the Negh'Var is capable of high warp speeds, allowing it to rapidly deploy across vast distances to respond to threats or launch offensive strikes. Its combination of speed, firepower, and defensive strength make it one of the most feared vessels in the Alpha and Beta Quadrants.\n\nThe Negh'Var-class became a key player during the Dominion War, where its sheer power and command abilities proved instrumental in several pivotal battles. Its presence on the battlefield exemplifies the Klingon Empire’s relentless pursuit of honor through combat and dominance in space warfare.",
    "Image": "https://www.sharecg.com/get_image.php?type=WebPage&upload_image_id=156042"
  },
  {
    "Affiliation": "Klingon",
    "Class": "None",
    "Ship": "Vor'Cha",
    "Propulsion": "Warp Drive",
    "Details": "The Klingon Vor'cha-class attack cruiser is a powerful and versatile warship, introduced in the early 24th century and serving as the backbone of the Klingon Defense Force. It features the iconic aggressive Klingon design, with a forward-mounted command section connected to a broad winged hull, reflecting the warrior culture’s emphasis on power and dominance.\n\nAt around 500 meters, the Vor'cha is equipped with disruptor cannons, photon torpedoes, and plasma beam weapons, making it formidable in head-on combat. Its disruptors are positioned along the wings, allowing it to engage multiple targets simultaneously. With heavy shields and reinforced hull plating, the ship is highly durable, capable of withstanding significant damage.\n\nThe Vor'cha also boasts advanced warp drive and cloaking technology, giving it both speed and stealth, making it ideal for ambushes and surprise attacks. It can serve as a command vessel for Klingon fleets, thanks to its sophisticated sensor and communication systems. Its balance of firepower, speed, and defensive capabilities made it indispensable during the Dominion War, where it played a key role in various major battles.\n\nDespite the introduction of larger warships like the Negh'Var, the Vor'cha remains a critical asset in the Klingon fleet, showcasing the Klingon Empire’s relentless pursuit of honor through warfare.",
    "Image": "https://www.ex-astris-scientia.org/scans/factfiles/vorcha-model.jpg"
  },
  {
    "Affiliation": "Klingon",
    "Class": "D5",
    "Ship": "Battlecruiser",
    "Propulsion": "Warp Drive",
    "Details": "The Klingon D5-class battlecruiser was an early 22nd-century warship, serving as a mainstay of the Klingon Defense Force during this period. Introduced before the more advanced D7-class, the D5 was a versatile and powerful vessel, playing a critical role in the Klingon Empire’s expansion and conflicts during the era of early spacefaring species like Earth.\n\nThe D5-class features a sleek, angular design, similar to later Klingon ships, with a long neck connecting the forward command section to a wider aft section. Despite being smaller and less advanced than later models, the D5 is heavily armed with disruptor cannons and torpedo launchers, making it a formidable ship in battle. It also employs polarized hull plating for defense, an early form of armor used before Klingon ships adopted stronger energy shields in later centuries.\n\nThe D5-class has warp drive capabilities, allowing it to travel across vast distances and engage in both deep space operations and planetary assaults. It was commonly used for patrols, raids, and military campaigns during the 22nd century. Although it lacked the cloaking technology of later Klingon vessels, the D5 was highly maneuverable and fast, relying on its agility and firepower to outmatch enemies.\n\nThe D5-class played a key role in early Klingon conflicts with Earth’s Starfleet and the Vulcans, often serving as the front line of Klingon expansion during a time of rising tensions between the Klingon Empire and other spacefaring powers. While it was eventually replaced by more advanced ships like the D7-class, the D5 laid the groundwork for Klingon ship design and tactics in the centuries that followed.",
    "Image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/85b1dc10-47b7-4ce1-9c1d-fbaee5a7e108/ddzgqmj-5736376f-690d-4399-9d03-1694ff651305.png?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzg1YjFkYzEwLTQ3YjctNGNlMS05YzFkLWZiYWVlNWE3ZTEwOFwvZGR6Z3Ftai01NzM2Mzc2Zi02OTBkLTQzOTktOWQwMy0xNjk0ZmY2NTEzMDUucG5nIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.HSitlAbVRgNO5p1-PMOW8hJ5uYyZUXTfZCvz0Hnh7oQ"
  },
  {
    "Affiliation": "Klingon",
    "Class": "K'Vort",
    "Ship": "Bird-of-Prey",
    "Propulsion": "Warp Drive",
    "Details": "The Klingon Bird-of-Prey is one of the most versatile and iconic starships in the Klingon Defense Force, appearing in various configurations from the 22nd century through the 24th century. Known for its sleek, aggressive design, the Bird-of-Prey is a small, agile warship, often used for a range of missions, including reconnaissance, raiding, and stealth operations. Its distinctive, winged silhouette reflects the predatory nature of Klingon combat philosophy.\n\nThe Bird-of-Prey is equipped with disruptor cannons and photon torpedoes, giving it significant firepower despite its relatively small size. It is also notable for its cloaking device, which allows it to remain invisible to enemy sensors, a key tactical advantage in Klingon warfare. The ship often uses hit-and-run tactics, decloaking to attack and then retreating under the cover of invisibility. This ability made it especially dangerous in surprise engagements.\n\nThe ship’s wings are adjustable, typically seen in a \"down\" position during attack runs and raised in cruising mode. Despite its size, the Bird-of-Prey has considerable defensive capabilities, with shielding and hull plating that make it durable in combat. Its warp drive allows for high-speed travel, making it suitable for long-range missions.\n\nThe Bird-of-Prey is used in several classes, with variations in size and firepower. The most common types include the B'rel-class, designed for smaller operations, and the larger K'Vort-class, which is often used in fleet battles. These ships are crewed by small teams of dedicated Klingon warriors, reflecting the Klingon tradition of personal honor in battle.\n\nThe Bird-of-Prey played key roles in several important conflicts, including the Klingon-Federation War, the Dominion War, and countless smaller skirmishes. Its adaptability, combined with its cloaking technology and firepower, made it one of the most enduring designs in the Klingon fleet, embodying the Klingon spirit of fierce independence and combat prowess.",
    "Image": "https://www.ex-astris-scientia.org/scans/other/bop-studio-close.jpg"
  },
  {
    "Affiliation": "Klingon",
    "Class": "No designation",
    "Ship": "K't'inga",
    "Propulsion": "Warp Drive",
    "Details": "The Klingon K't'inga-class battlecruiser is one of the most iconic and enduring ships in the Klingon fleet, first introduced in the late 23rd century. A direct descendant of the earlier D7-class, the K't'inga improved upon its predecessor with enhanced weaponry, stronger defenses, and more advanced systems. It became a symbol of Klingon military strength and was widely used in battles and diplomatic missions well into the 24th century.\n\nThe design of the K't'inga is characterized by its sleek, aggressive lines, with a forward-mounted command section connected to a larger aft section by a long neck. This design reflects Klingon combat philosophy, favoring head-on engagements and overwhelming firepower. The ship’s hull is heavily armored and bristling with disruptor cannons, photon torpedoes, and powerful tractor beams, making it a formidable opponent in any space battle.\n\nIn addition to its offensive capabilities, the K't'inga is equipped with defensive shielding and reinforced hull plating, making it highly durable in prolonged combat. It also features warp drive, allowing it to travel at high speeds, making it suitable for long-range missions, from patrols to full-scale invasions.\n\nThe K't'inga-class is also notable for its cloaking device, giving it the ability to disappear from enemy sensors and launch surprise attacks, a key feature of Klingon tactical doctrine. This stealth capability made the ship especially dangerous, allowing it to strike and retreat with relative impunity.\n\nThe K't'inga-class was used in many key conflicts, including battles against the Federation, Romulans, and the Dominion. Its design proved so successful that it remained in active service for decades, with many variants and upgrades appearing over time. Whether serving as a command ship or a frontline warship, the K't'inga-class was a testament to the Klingon Empire’s dedication to martial prowess and honor in battle, solidifying its place as a legendary vessel in the annals of galactic warfare.",
    "Image": "https://www.ex-astris-scientia.org/scans/mechanics/ktinga-beauty1.jpg"
  },
  {
    "Affiliation": "Borg",
    "Class": "Class 4",
    "Ship": "Tactical Cube",
    "Propulsion": "Warp Drive \nTranswarp Drive",
    "Details": "The Borg Tactical Cube is a heavily reinforced variant of the standard Borg cube, designed for combat superiority. Introduced in the late 24th century, it represents a more armored and weaponized adaptation of the already formidable Borg cube. The Tactical Cube is similar in size to a regular Borg cube, measuring around 3,000 meters on each side. Its design features reinforced armor plating, making it more durable against enemy fire, with an exterior heavily segmented by additional layers of structural shielding. While the standard cube focuses on assimilation and adaptability, the Tactical Cube prioritizes combat efficiency and defense.\n\nArmed with heavy energy beam arrays, the Tactical Cube excels in ship-to-ship combat and planetary bombardment. It also carries plasma torpedoes, providing a high-yield weapon system. In addition to its offensive capabilities, it boasts advanced tractor beam technology, which is capable of immobilizing even large starships. Its defenses are equally impressive, with enhanced regenerative shielding that allows for rapid recovery from damage, and a hull lined with ablative armor, making it highly resistant to both energy and projectile-based attacks. A multiphasic shielding system further protects the Tactical Cube, rendering it nearly impervious to conventional weapons, forcing adversaries to adapt constantly.\n\nInternally, the Tactical Cube is operated by thousands of Borg drones, all interconnected through the hive mind. It possesses advanced transwarp capabilities, enabling it to travel vast distances almost instantly. The cube's adaptation systems are notoriously effective, ensuring that enemy weapons quickly become useless after initial contact. First encountered by Starfleet in the late 2370s, the Borg Tactical Cube proved to be a more significant threat than standard cubes due to its advanced defenses and lethal offensive capabilities. While still capable of assimilation, the Tactical Cube’s primary function is as an unstoppable force in battle.",
    "Image": "https://www.ex-astris-scientia.org/scans/shipcollection/borg-tactical-cube-cgi.jpg"
  },
  {
    "Affiliation": "Borg",
    "Class": "Class 1\nClass 2\nClass 3\nClass 4",
    "Ship": "Cube",
    "Propulsion": "Warp Drive\nTranswarp Drive",
    "Details": "The Borg Cube is one of the most imposing and dangerous vessels in the galaxy, serving as the primary warship and assimilation tool of the Borg Collective. Measuring over 3,000 meters per side, its massive, geometric structure is a symbol of the Borg’s cold efficiency. Unlike most starships, the Cube has no front, back, or discernible command section. This allows it to attack from any direction, reinforcing the Borg philosophy of pure adaptability and function over form.\n\nA key feature of the Borg Cube is its immense firepower. It is equipped with energy weapons, plasma torpedoes, and tractor beams, making it capable of destroying or assimilating most vessels with ease. Additionally, the Cube’s self-regeneration systems make it one of the hardest ships to defeat in battle. Its adaptive shielding can rapidly adjust to enemy weapons, rendering them ineffective after only a few hits.\n\nThe Cube’s modular design allows for constant repairs, even during combat. Every part of the ship can be replaced or repurposed quickly, and it can function even if significant sections are destroyed. This makes it nearly indestructible unless faced with overwhelming force or advanced technology capable of bypassing its defenses.\n\nInternally, the Borg Cube houses thousands of Borg drones, all connected through the hive mind. These drones serve various functions, from piloting the ship to repairing it, and they are all capable of rapidly assimilating technology and biological beings. Assimilation is the Cube's primary goal, adding new species and technologies to the Collective, thereby increasing its power and knowledge.\n\nThe Cube is powered by an advanced transwarp drive, allowing it to travel across the galaxy at speeds far exceeding conventional warp drives. This enables the Borg to conduct lightning-fast invasions, often catching civilizations off guard before they can mount a defense.\n\nThe Borg Cube’s combination of overwhelming firepower, adaptability, and regenerative capabilities makes it one of the most feared ships in the galaxy, an unstoppable force of assimilation and destruction.",
    "Image": "https://vignette3.wikia.nocookie.net/scifi/images/7/76/Borg_cube.jpg/revision/latest?cb=20130523191156"
  },
  {
    "Affiliation": "Borg",
    "Class": "Variant 1\nVariant 2",
    "Ship": "Sphere",
    "Propulsion": "Warp Drive\nTranswarp Drive",
    "Details": "The Borg Sphere is a smaller, more maneuverable starship used by the Borg Collective, often deployed alongside the massive Borg Cube. Though not as large or powerful as a Cube, the Sphere is still a formidable vessel, designed for rapid assaults, scouting, and assimilation missions. It typically measures around 600 meters in diameter and retains many of the key features that make Borg ships so dangerous.\n\nThe Sphere is armed with energy weapons, plasma torpedoes, and tractor beams, making it capable of holding its own in combat. However, its primary advantage is its maneuverability and speed, allowing it to evade attacks more effectively than the larger Cube. The Sphere also employs the Borg’s signature adaptive shielding, which adjusts to enemy weapons, making it increasingly difficult to damage over time.\n\nLike all Borg ships, the Sphere is equipped with self-repair systems, ensuring that any damage sustained in battle is quickly repaired. Inside, the ship is filled with Borg drones connected to the hive mind, allowing for efficient coordination during engagements. The drones can assimilate enemy ships and crews, adding their knowledge and technology to the Borg Collective.\n\nThe Sphere is also equipped with a transwarp drive, enabling it to travel across vast distances almost instantly. This makes it ideal for rapid-response missions, scouting, or follow-up attacks after larger ships like the Borg Cube initiate assaults. The Sphere often acts as a support vessel, emerging from a Cube during combat or assimilation operations to increase tactical flexibility.\n\nThough smaller than a Cube, the Borg Sphere maintains the terrifying efficiency of the Collective. Its speed, adaptability, and powerful weaponry make it a significant threat, especially in fleet actions or targeted assimilation missions, reflecting the relentless nature of Borg expansion across the galaxy.",
    "Image": "https://www.ex-astris-scientia.org/scans/mechanics/borg-sphere.jpg"
  },
  {
    "Affiliation": "Borg",
    "Class": "No designation",
    "Ship": "Queen's Ship",
    "Propulsion": "Warp Drive\nTranswarp Drive",
    "Details": "The Borg Queen’s Ship is a unique and highly specialized vessel designed to serve as the personal transport for the Borg Queen, the central figure of the Borg Collective. Unlike other Borg vessels such as the Cube or Sphere, the Queen's Ship has a more distinct and intricate design, reflecting the Queen’s elevated status within the Collective. The ship is smaller than a Borg Cube but still possesses considerable firepower and technological sophistication.\n\nThe Queen’s Ship is equipped with advanced weaponry, including disruptor beams, plasma torpedoes, and tractor beams, allowing it to defend itself against significant threats. Its adaptive shielding and self-repair systems ensure that it can withstand substantial damage while continuing to function effectively, much like other Borg vessels. However, the Queen’s Ship is more agile and designed for rapid movement and tactical flexibility rather than direct combat with large fleets.\n\nWhat sets the Borg Queen’s Ship apart is its role as a command center for the Collective. It is where the Borg Queen directly interfaces with the Collective’s hive mind, guiding and controlling millions of drones across countless vessels. The ship is outfitted with advanced communications systems, allowing the Queen to exert her influence across vast distances. This ship also serves as a hub for high-level assimilation strategies, where the most critical operations and decisions are made.\n\nThe Queen’s Ship is also equipped with a transwarp drive, giving it the ability to travel vast distances instantaneously. This enables the Queen to appear in critical locations quickly, whether to oversee large-scale assimilation efforts, make strategic decisions, or confront adversaries directly.\n\nThe Borg Queen’s Ship plays a crucial role in the Borg’s hierarchy, reflecting the importance of the Queen’s leadership in maintaining the Collective’s order and efficiency. Its combination of speed, advanced technology, and command functions make it a key vessel within the Borg fleet, supporting the Queen’s role in directing the relentless expansion of the Borg Collective across the galaxy.",
    "Image": "https://www.ex-astris-scientia.org/schematics/borg-queen-ship-darkfrontier.jpg"
  },
  {
    "Affiliation": "Vulcan",
    "Class": "Survey",
    "Ship": "T'Plana Hath",
    "Propulsion": "Warp Drive",
    "Details": "The T'Plana Hath is a small survey ship of unknown class with a threefold structure from the 21st century. It is capable of landing on a planet.\n\nOn the morning of April 5th, 2063, it was passing through the outskirts of the Sol system, when it detected Dr. Zefram Cochrane's warp signature during a test flight of the Phoenix from the vicinity of Earth, a planet which the Vulcan High Command had been monitoring for decades. As per Vulcan first contact protocols, they decided to land on Earth, to meet the person who flew the first warp ship of their world. They landed in Bozeman, Montana. (Star Trek: First Contact; ENT: \"Desert Crossing\", \"Carbon Creek\")\n\nThe commanding officer of its three-person crew exited the vehicle first, and offered the Vulcan salute, \"Live long, and prosper.\" Dr. Cochrane tried and failed to perform the same hand gesture, so he shook the Vulcan's hand and thanked him. The Vulcans and Dr. Cochrane then went into the local establishment for beverages, and a presentation of the local music, with an invitation to dance along to \"Ooby Dooby\" by Roy Orbison. (Star Trek: First Contact)",
    "Image": "https://1.bp.blogspot.com/-KOaSBywaMHQ/X0F3RgurxjI/AAAAAAAAy4E/_izXuj_FHh4_9bwrjkUwebjMU_Agi2teQCLcBGAsYHQ/s1600/2020-08-02%2B19.22.47.jpg"
  },
  {
    "Affiliation": "Vulcan",
    "Class": "Combat",
    "Ship": "Sh'Ran type",
    "Propulsion": "Warp Drive",
    "Details": "The Sh'Ran is a Vulcan combat ship type around 2151. The ring around the needle-shaped hull holds the warp drive. The ship is equipped with much more powerful weapons than on Enterprise NX-01.\n\nIn February 2152, the Sh'Raan was sent to rendezvous with Enterprise NX-01 to transport Ambassador V'Lar back to Vulcan to offer testimony against the Mazarite High Council. However, the Mazarites tried to kill V'Lar before she could get to the Sh'Raan, and Enterprise had to send an emergency message for them to come to their assistance.\n\nWhen the Sh'Raan arrived, Enterprise had been jamming the Mazarites' sensors, so they were easily disabled by the Sh'Raan's weapons. The Sh'Raan's captain hailed Enterprise, asking if they required assistance, and told the Mazarites to stand down or be destroyed.\n\nOnce the situation was resolved, a shuttle was sent over from the Sh'Raan to retrieve V'Lar. (ENT: \"Fallen Hero\")",
    "Image": "https://live.cdn.renderosity.com/gallery/items/2917009/images/1892693/c1310c5147e91030bdd4c3e28da321b3_original.jpg"
  },
  {
    "Affiliation": "Vulcan",
    "Class": "Unknown",
    "Ship": "Surak",
    "Propulsion": "Warp Drive",
    "Details": "Although the class or type is not provided, the Surak is assumed to be a ship of exploration and combat.\n\nThe Surak class is a Vulcan ship type around 2151. The ring around the needle-shaped hull holds the warp drive. The ship is equipped with a tractor beam and with more powerful beam weapons than on Enterprise NX-01.",
    "Image": "https://www.ex-astris-scientia.org/schematics/surak-shran-screen.jpg"
  },
  {
    "Affiliation": "Ferengi",
    "Class": "Marauder",
    "Ship": "D'Kora",
    "Propulsion": "Warp Drive",
    "Details": "The Ferengi Marauder is a combination of a freighter and a warship. As the latter, it is nearly a match to a Federation Galaxy class.\n\nThe D'Kora-class Marauder was equipped with a variety of directed energy weapons, possessing placements for weapon ports at the \"claws\", positioned on the port and starboard sides, and a torpedo launcher located at the peak of the ship's primary hull. (TNG: \"The Last Outpost\", \"Peak Performance\", \"Force of Nature\") This class of vessel was also equipped with a forward missile launcher. (TNG: \"The Price\")",
    "Image": "https://www.ex-astris-scientia.org/scans/shipcollection/marauder-photo2.jpg"
  },
  {
    "Affiliation": "Cardassian",
    "Class": "Combat",
    "Ship": "Galor",
    "Propulsion": "Warp Drive",
    "Details": "The Galor-class destroyer is the most common design of Cardassian warship. It is imminently versatile and an omnipresent feature of life in Cardassian space, serving as a patrol vessel, military transport, and even as a flagship. The Galor has been in service since the 2340s, and though it is no longer the largest vessel in Cardassian service, it remains in production and is an integral component of the Cardassian military.\n\nA Galor-class starship is likely to be the first vessel you encounter upon entering Cardassian space, as they are used extensively for customs and border enforcement duties. As such, they are the defacto first point of diplomatic contact for many races with the Cardassian Union. In addition, they often conduct negotiations with neutral parties for commercial deals, and so they do have visitor's quarters and a conference facility which is designed to project the strength and power of the Cardassian Union. The presence of a Galor-class vessel indicates that the Union has mild to moderate interest in the discussion or question at hand—but it also signifies that they're not yet bothered enough by a possible threat to send in a larger starship.",
    "Image": "https://www.ex-astris-scientia.org/scans/factfiles/galor-model.jpg"
  },
  {
    "Affiliation": "Cardassian",
    "Class": "Combat",
    "Ship": "Keldon",
    "Propulsion": "Warp Drive",
    "Details": "The Keldon-class cruiser is the standard Cardassian medium-duty warship, serving in combat, patrol, and utility duties across the Union. It is nearly identical to the slightly smaller Galor-class, with extensions on the stern and to the dorsal superstructure that allows for a higher crew complement and for barracks space to transport up to a thousand troops. An older design, they are relatively common, but not nearly as common as the Galor.\n\nKeldon-class starships have a standard VIP suite available for a legate or government official, as well as a suite in the dorsal superstructure that is capable of hosting larger delegations in relative comfort. This makes this class a superior diplomatic platform compared to the Galor but it is less capable than the larger and more modern post-Dominion War designs currently in service. Its long-range communications abilities allow it to effectively execute the will of decision-makers back at headquarters.",
    "Image": "https://www.ex-astris-scientia.org/scans/shipcollection/galor-model1.jpg"
  },
  {
    "Affiliation": "Dominion",
    "Class": "Jem'Hadar",
    "Ship": "Attack",
    "Propulsion": "Warp Drive",
    "Details": "The Jem'Hadar attack ship is an agile and powerful small warship. It is equipped with polaron beam weapons. When the ship was first encountered by the Federation, its shields and transporter technology was superior. Little else is known about this capable ship.",
    "Image": "https://www.ex-astris-scientia.org/schematics/jemhadar-attack-1-thesearch.jpg"
  },
  {
    "Affiliation": "Dominion",
    "Class": "Jem'Hadar",
    "Ship": "Battlecruiser",
    "Propulsion": "Warp Drive",
    "Details": "The Dominion battlecruiser is a powerful warship of the size of a Federation Galaxy class.\n\nThe battlecruiser first appeared in DS9: \"Ties of Blood and Water\", a preliminary version (see below) already in DS9: \"In Purgatory's Shadow\". An official class or type designation for this ship was never given. It is referred to as \"warship\" in the Encyclopedia II (and depicted upside down there :-o) and as \"battle cruiser\" in the DS9TM.\nMost visual evidence indicates that the battlecruiser is about as long as a Federation Galaxy class, as suggested in the Encyclopedia II, the DS9TM and the Fact Files.",
    "Image": "https://www.ex-astris-scientia.org/articles/dominion-battlecruiser/u-phy-ties3.jpg"
  },
  {
    "Affiliation": "Dominion",
    "Class": "Jem'Hadar",
    "Ship": "Battleship",
    "Propulsion": "Warp Drive",
    "Details": "The Dominion battleship is an extremely powerful warship of twice the length of a Federation Galaxy class.\n\nThe battleship prototype could be seen in DS9: \"Valiant\" where its size was explicitly mentioned. The battleship reappeared in the battle in DS9: \"What You Leave Behind\", where its length was about 1500m again. However, the same episode also showed the same model as something much larger in orbit around Cardassia. Although we must assume that the upscaling was intentional, I suggest we ignore the huge ship.",
    "Image": "https://www.ex-astris-scientia.org/articles/dominion-battlecruiser/u-phy-v-cgi-arms3.jpg"
  },
  {
    "Affiliation": "Andorian",
    "Class": "Battleship",
    "Ship": "Kumari",
    "Propulsion": "Warp Drive",
    "Details": "The Andorian warships are apparently a match for Vulcan combat cruisers. They are equipped with tractor beams and have a cargo hold or shuttlebay on the underside which may be shielded to hold radiating cargo.\n\nThe Andorian battle cruiser was considerably more rugged than the designs utilized by contemporary United Earth Starfleet vessels. (ENT: \"Proving Ground\") Like all Andorian combat vessels, the Andorian battle cruiser was constructed using a \"significant quantity\" of duranium alloy. (ENT: \"Babel One\") Despite the vessel's fairly large size, it was crewed by a complement of only eighty-six. (ENT: \"United\") In comparison, Starfleet's smaller NX-class had a standard complement of eighty-three.",
    "Image": "https://www.ex-astris-scientia.org/scans/caps/andorian-ships2-kirshara.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "NX Class",
    "Ship": "USS Enterprise NX-01",
    "Propulsion": "Warp Drive",
    "Details": "The USS Enterprise (NX-01) was Earth's first Warp 5-capable starship, launched in 2151 under the command of Captain Jonathan Archer. This historic vessel was the pioneer of deep space exploration for humanity, long before the establishment of the United Federation of Planets. Its primary mission was to seek out new life and new civilizations, traveling further than any Earth ship had before.\n\nThe NX-01 Enterprise played a critical role in the early interspecies diplomatic efforts that eventually led to the founding of the Federation. Along the way, it encountered key alien species such as the Klingons, Vulcans, Andorians, and Xindi. Its most notable mission was its involvement in the Temporal Cold War and the Xindi conflict, where the Enterprise and its crew helped prevent the destruction of Earth.\n\nThough the NX-class was primitive compared to later Federation designs, the NX-01 was equipped with early phase cannons, spatial torpedoes, and polarized hull plating. The ship's Warp 5 engine allowed it to reach speeds previously unattainable by humanity, pushing the boundaries of known space. The crew's resourcefulness often compensated for the vessel's limitations, making the Enterprise NX-01 a legend in Starfleet history.",
    "Image": "https://www.ex-astris-scientia.org/scans/other/nx-01-front.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "Constitution",
    "Ship": "USS Enterprise NCC-1701",
    "Propulsion": "Warp Drive",
    "Details": "The USS Enterprise (NCC-1701), under the command of Captain James T. Kirk, became one of the most iconic starships in the Star Trek universe. Launched in the 23rd century, this Constitution-class vessel was renowned for its five-year mission to explore strange new worlds, seek out new life and new civilizations, and boldly go where no one had gone before.\n\nThe NCC-1701 was involved in numerous key events in Federation history, from first contact with powerful alien species like the Romulans and Klingons to the discovery of new planets and star systems. Its adventures are chronicled in Star Trek: The Original Series, where it faced challenges such as the enigmatic Q Continuum, the malevolent Nomad probe, and the complex Khan Noonien Singh conflict.\n\nEquipped with powerful phaser banks, photon torpedoes, and deflector shields, the Enterprise also featured advanced warp capabilities for its time. Its influence in Starfleet was immense, and many captains, including Kirk, Spock, and Pike, considered it one of the best ships in the fleet. Its iconic design and legacy lived on long after its decommissioning.",
    "Image": "https://www.ex-astris-scientia.org/scans/other/ncc-1701-renovated1.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "Constitution (Refit)",
    "Ship": "USS Enterprise NCC-1701-A",
    "Propulsion": "Warp Drive",
    "Details": "After the destruction of the original Enterprise during the battle against Klingon Commander Kruge, Starfleet commissioned a new ship with the same name: the USS Enterprise (NCC-1701-A). Launched in 2286 under Captain Kirk's command, this ship resumed the exploration and defense duties of its predecessor. Its debut followed the events surrounding the Cetacean Probe, where the ship and crew saved Earth from an environmental disaster.\n\nThe NCC-1701-A was largely identical to its predecessor but benefitted from the latest upgrades in Starfleet technology, enhancing its warp drive, weapons systems, and shielding. The ship was prominently featured in Star Trek V: The Final Frontier and Star Trek VI: The Undiscovered Country, playing a pivotal role in the latter film by helping to bring about peace between the Federation and the Klingon Empire.\n\nThough it had a relatively short service life, the Enterprise-A cemented its place in Federation history. It was ultimately decommissioned following its mission to escort the Khitomer Peace Conference, marking the end of the adventures of Kirk's Enterprise, though its legacy continued with future ships bearing the same name.",
    "Image": "https://blog.trekcore.com/wp-content/uploads/2018/06/ent-a-launch.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "Excelsior",
    "Ship": "USS Enterprise NCC-1701-B",
    "Propulsion": "Warp Drive",
    "Details": "The USS Enterprise (NCC-1701-B) was an Excelsior-class starship launched in 2293 under the command of Captain John Harriman. This ship was designed with improved warp capabilities, advanced weaponry, and greater endurance for long-range exploration missions, reflecting the technological advancements of the 24th century.\n\nThe Enterprise-B is best known for its role in the movie Star Trek: Generations, where it participated in the rescue of two El-Aurian transport ships trapped in the Nexus. During the mission, Captain Kirk was presumed dead after being swept into the Nexus himself, though he was later found alive within it. The ship itself suffered some initial issues due to incomplete outfitting, but its overall service life continued beyond this incident.\n\nAs an Excelsior-class vessel, the NCC-1701-B was considerably larger and more advanced than its Constitution-class predecessors. While its operational history was not explored in great detail in on-screen canon, it nonetheless carried the Enterprise name forward into the 24th century and set the stage for the next iteration of the famous ship.",
    "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ19Yxp0DoTMQ48SrA6wBx5SrtwdbPZ-4PXrg&s"
  },
  {
    "Affiliation": "Federation",
    "Class": "Ambassador",
    "Ship": "USS Enterprise NCC-1701-C",
    "Propulsion": "Warp Drive",
    "Details": "The USS Enterprise (NCC-1701-C), an Ambassador-class vessel, is remembered for its pivotal role in Star Trek: The Next Generation episode \"Yesterday's Enterprise\". Under the command of Captain Rachel Garrett, the Enterprise-C was involved in a heroic last stand against the Romulans during the Battle of Narendra III, where it defended a Klingon colony from attack.\n\nThis act of bravery and sacrifice became a crucial point in Federation-Klingon relations, helping to solidify the peace between the two powers. However, during the battle, the Enterprise-C disappeared into a temporal rift, leading to an alternate timeline where the Federation was at war with the Klingon Empire. When the ship eventually returned through the rift, it was heavily damaged, and many of its crew had perished, including Captain Garrett.\n\nThe Ambassador-class ship featured enhanced warp drive capabilities, advanced shields, and powerful phasers and photon torpedoes. The design was a step forward from the Excelsior-class, with a sleeker and more powerful frame. Though its operational life was tragically cut short, the Enterprise-C's sacrifice ensured peace between the Federation and the Klingons, cementing its legacy.",
    "Image": "https://www.ex-astris-scientia.org/observations/yesterdaysenterprise/05-yesterdaysenterprise-1-r.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "Galaxy",
    "Ship": "USS Enterprise NCC-1701-D",
    "Propulsion": "Warp Drive",
    "Details": "The USS Enterprise (NCC-1701-D), commanded by Captain Jean-Luc Picard, was one of the most advanced ships in Starfleet during its time. The Galaxy-class starship, launched in the mid-24th century, was a symbol of peace, exploration, and diplomacy. Its mission, like its predecessors, was to seek out new life and new civilizations, while also serving as a formidable defense vessel when necessary.\n\nThe Enterprise-D was home to over 1,000 crew members, including civilians and families, making it a unique, multi-generational vessel. It was the flagship of the Federation, and Picard's leadership led the ship through some of the most challenging and significant events in Starfleet history, such as first contact with the Borg, the discovery of the Q Continuum, and the formation of key diplomatic relations with species such as the Cardassians and Romulans.\n\nUnfortunately, the ship met its demise during the events of Star Trek: Generations, when it was destroyed by a Klingon attack. The saucer section crash-landed on the planet Veridian III, marking the end of the Enterprise-D's service. However, its legacy endured through the crew’s actions and the introduction of the next iteration of the Enterprise.",
    "Image": "https://www.ex-astris-scientia.org/scans/caps/galaxy-1-whentheboughbreaks.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "Sovereign",
    "Ship": "USS Enterprise  NCC-1701-E",
    "Propulsion": "Warp Drive",
    "Details": "The USS Enterprise (NCC-1701-E) was launched after the destruction of its predecessor in Star Trek: Generations. Under the continued command of Captain Jean-Luc Picard, this Sovereign-class starship represented a massive technological leap forward for Starfleet. Equipped with advanced weaponry, upgraded warp capabilities, and enhanced defensive systems, the Enterprise-E was a cutting-edge ship designed for both exploration and combat.\n\nThe Enterprise-E featured prominently in several key events, including the battle against the Borg in Star Trek: First Contact, where the ship and its crew traveled back in time to prevent the assimilation of Earth. It also participated in conflicts involving the Son'a and Reman species, showcasing its versatility in diplomacy and warfare.\n\nOne of the most advanced ships of its time, the Sovereign-class Enterprise was designed to tackle threats in a more dangerous galaxy, with advanced phasers, quantum torpedoes, and regenerative shields. It served as the Federation flagship well into the late 24th century, continuing the proud legacy of the starships that bore the name Enterprise.",
    "Image": "https://www.ex-astris-scientia.org/scans/other/ee-fc3.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "Intrepid",
    "Ship": "USS Voyager NCC-74656",
    "Propulsion": "Warp Drive",
    "Details": "The USS Voyager (NCC-74656) was launched in 2371 under the command of Captain Kathryn Janeway. Designed for long-range exploration, the Intrepid-class starship featured advanced technologies, including bio-neural circuitry, making its systems faster and more responsive. Voyager was also one of the fastest ships in Starfleet, capable of sustaining Warp 9.975. Its smaller size compared to ships like the Galaxy-class meant it was more maneuverable and could operate with a smaller crew, which was necessary for deep space missions.\n\nVoyager's most significant mission began when it was pulled 70,000 light-years across the galaxy to the Delta Quadrant by the Caretaker, stranding it far from Federation space. The crew, consisting of both Starfleet officers and members of the Maquis, worked together over the course of seven years to find their way home, encountering numerous alien species such as the Borg, Kazon, and Hirogen. Janeway’s leadership was key in maintaining morale and ensuring the survival of the ship and crew in unknown territory.\n\nEquipped with advanced deflector shields, phaser arrays, and photon torpedoes, Voyager was a versatile ship capable of both scientific research and combat operations. Notable innovations included the Emergency Medical Hologram (EMH) and astrometric labs, which played crucial roles in many of the ship’s adventures. Voyager's return to the Alpha Quadrant after its harrowing journey became one of the most legendary stories in Starfleet history.",
    "Image": "https://www.ex-astris-scientia.org/scans/shipcollection/voyager-scene1.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "Defiant",
    "Ship": "USS Defiant NX-74205",
    "Propulsion": "Warp Drive",
    "Details": "The USS Defiant was a Defiant-class warship developed in response to the growing threat posed by the Borg and other hostile species. Though compact, this starship was heavily armed, featuring advanced ablative armor, quantum torpedoes, and pulse phaser cannons. It was one of the few ships in Starfleet designed specifically for combat, reflecting the increasing need for defense against powerful enemies. Despite its warship design, the Defiant still carried scientific and exploration capabilities.\n\nThe Defiant was stationed at Deep Space Nine under the command of Captain Benjamin Sisko during the Dominion War. The ship played a pivotal role in numerous battles against the Dominion, the Klingons, and the Cardassians. Its cloaking device, provided by the Romulans, allowed it to operate stealthily in enemy territory, which was essential in covert missions behind Dominion lines. Though small, the Defiant's firepower rivaled much larger vessels, making it a formidable opponent in both offensive and defensive operations.\n\nAlthough the Defiant was destroyed in battle against the Breen during the Dominion War, a replacement ship (also named Defiant) was later commissioned, allowing the ship's legacy to continue. Its importance during the war, as well as its role in the defense of the Alpha Quadrant, solidified the Defiant as one of the most respected and battle-tested vessels in Starfleet.",
    "Image": "https://www.ex-astris-scientia.org/scans/other/defiant-publicity.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "Excelsior",
    "Ship": "USS Excelsior NCC-2000",
    "Propulsion": "Warp Drive",
    "Details": "The USS Excelsior (NCC-2000) was one of the first ships of the Excelsior-class, originally launched as a prototype vessel under the command of Captain Styles. Its early mission was to test the experimental transwarp drive, which ultimately failed to meet expectations. However, the Excelsior-class was later refined and became a workhorse of the fleet, serving the Federation for many decades.\n\nThe most famous captain of the USS Excelsior was Captain Hikaru Sulu, formerly the helmsman of the USS Enterprise under Captain Kirk. Under Sulu’s command, the Excelsior became a key player in Starfleet’s operations, notably during the Khitomer Crisis, where it played a vital role in the peace talks between the Federation and the Klingon Empire. The ship's advanced warp drive and upgraded weapon systems allowed it to conduct long-range exploratory missions and engage in defensive actions when necessary.\n\nThe Excelsior’s design was highly influential, with many future starships incorporating elements of its layout and technology. Its longevity and versatility made it one of the most recognizable ships in the fleet, earning a distinguished service record across numerous conflicts and peacekeeping missions. It remains a symbol of Starfleet’s commitment to exploration, diplomacy, and defense.",
    "Image": "https://www.ex-astris-scientia.org/scans/caps/excelsior-2-stiii.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "Miranda",
    "Ship": "USS Reliant NCC-1864",
    "Propulsion": "Warp Drive",
    "Details": "The USS Reliant (NCC-1864) was a Miranda-class starship that played a critical role in one of Starfleet’s most significant confrontations—the battle against Khan Noonien Singh in Star Trek II: The Wrath of Khan. Initially under the command of Captain Clark Terrell, the Reliant was tasked with surveying planets for the Genesis project, a scientific initiative designed to terraform barren worlds. However, the ship was commandeered by Khan, a genetically engineered superhuman who sought revenge on Admiral James T. Kirk.\n\nDuring the ensuing battle in the Mutara Nebula, the Reliant faced off against Kirk’s USS Enterprise (NCC-1701). Though Khan used the ship to his advantage, his lack of experience in three-dimensional starship combat led to his defeat. The Reliant was heavily damaged and ultimately destroyed when Khan activated the Genesis Device in a last-ditch effort to destroy the Enterprise and its crew.\n\nThe Miranda-class itself was a versatile and durable design, with multiple ships of this class serving throughout Starfleet for many decades. Though not as heavily armed as some larger starships, the Miranda-class proved to be effective in a variety of roles, from exploration to defense. The Reliant's role in the battle against Khan made it one of the most famous ships of its class.",
    "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTIrs2Q5juqgYOZSBpaPBJKCoUPI4rseg0GaQ&s"
  },
  {
    "Affiliation": "Federation",
    "Class": "NX Class",
    "Ship": "USS Columbia NX-02",
    "Propulsion": "Warp Drive",
    "Details": "The USS Columbia (NX-02) was the second starship of the NX-class, following the USS Enterprise (NX-01). Launched in 2154 under the command of Captain Erika Hernandez, the Columbia was equipped with similar technology to its sister ship, including polarized hull plating, phase cannons, and a Warp 5 engine, making it one of the fastest and most advanced Earth vessels of the time. Columbia's mission focused on deep space exploration and defense of Earth's interests in space.\n\nThe Columbia played a key role in the Romulan War, the conflict that eventually led to the foundation of the United Federation of Planets. It also assisted the Enterprise in critical situations, including a mission to recover Commander Charles \"Trip\" Tucker III after he was stranded during a dangerous covert operation. The two ships shared a close operational bond during their joint missions in the early days of Starfleet.\n\nThough the NX-class was eventually rendered obsolete by more advanced vessels, the Columbia's contributions to early interstellar exploration and its role in protecting humanity in space were significant. The experiences and data collected during its missions helped shape the design of future Starfleet vessels, contributing to humanity’s eventual rise as a major interstellar power.",
    "Image": "https://www.ex-astris-scientia.org/scans/caps/columbia-affliction.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "Luna",
    "Ship": "USS Titan NCC-80102",
    "Propulsion": "Warp Drive",
    "Details": "The USS Titan (NCC-80102) was a Luna-class starship commanded by Captain William T. Riker, previously the first officer of the USS Enterprise-D and Enterprise-E. Launched in the late 24th century, the Titan was designed for deep space exploration, specifically focusing on research and discovery in uncharted regions of space. The ship was named after the moon Titan, which orbits Saturn, signifying its mission of venturing into the unknown.\n\nUnder Riker's command, the Titan participated in numerous diplomatic and exploratory missions. One of its first major assignments was to assist with the Romulan-Federation negotiations following the defeat of Shinzon, a Romulan clone who had attempted to destroy the Federation using a deadly Thalaron weapon. The Titan became a symbol of Starfleet's commitment to diplomacy and peace in the galaxy, while also undertaking scientific research and exploration.\n\nAs a Luna-class vessel, the Titan was equipped with cutting-edge technology, including advanced warp drives, defensive systems, and scientific research facilities. Its emphasis on exploration, coupled with a skilled and experienced crew, made it one of the premier ships in Starfleet for venturing into unknown territories. The Titan's mission of discovery continued the legacy of ships like the Enterprise, forging a new path for Starfleet in the post-Dominion War era.",
    "Image": "https://www.ex-astris-scientia.org/episodes/pic/thenextgeneration.jpg"
  },
  {
    "Affiliation": "Federation",
    "Class": "Crossfield",
    "Ship": "USS Discovery NCC-1031",
    "Propulsion": "Warp Drive\nSpore Drive",
    "Details": "The USS Discovery (NCC-1031) is the titular starship of Star Trek: Discovery and plays a critical role in the events of the 23rd and 32nd centuries. Designed as a Crossfield-class vessel, Discovery was originally equipped for scientific research but became an important asset due to its experimental spore drive, a unique propulsion system allowing instantaneous travel across vast distances using the mycelial network. This drive system, developed by Lieutenant Paul Stamets, set the ship apart from any other in Starfleet.\n\nThe Discovery's mission evolved from scientific exploration to active combat during the Klingon-Federation War in 2256-2257. Under the command of Captain Gabriel Lorca, and later Captain Saru and Michael Burnham, the ship took on a more strategic role, using its spore drive to give the Federation a significant tactical advantage. Throughout this period, the crew encountered numerous threats, including the Klingons, Section 31, and the Mirror Universe's Terran Empire.\n\nIn the 32nd century, after traveling over 900 years into the future, the USS Discovery played a crucial part in restoring the Federation following the catastrophic event known as \"The Burn.\" The ship was retrofitted with 32nd-century technology, including detached nacelles and programmable matter interfaces, making it even more advanced than before. With Captain Burnham in command, Discovery continued its mission of exploration while helping to rebuild the fractured Federation.",
    "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTHd3ujFjgyeS_dPTQtVC6qifd6St5y3n-Rdg&s"
  },
  {
    "Affiliation": "Federation",
    "Class": "Walker",
    "Ship": "USS Shenzhou NCC-1227",
    "Propulsion": "Warp Drive",
    "Details": "The USS Shenzhou (NCC-1227) was a Walker-class starship serving in Starfleet during the mid-23rd century. Commanded by Captain Philippa Georgiou, the Shenzhou was designed for missions of exploration and diplomacy, though it was also equipped for combat if necessary. The Shenzhou was known for its impressive maneuverability, which made it particularly effective in reconnaissance and patrol missions.\n\nThe Shenzhou's most notable involvement was in the early stages of the Klingon-Federation War. It was at the Battle of the Binary Stars, where the Shenzhou first encountered the Klingon vessel Sarcophagus, commanded by T’Kuvma. The ensuing battle resulted in significant damage to the Shenzhou, and the death of Captain Georgiou had a profound impact on her first officer, Michael Burnham. Burnham's subsequent actions, including mutiny, led to her being court-martialed, a key event that shaped the course of the war.\n\nThough the Shenzhou was heavily damaged and ultimately abandoned, its legacy continued through its crew, particularly Burnham and Saru. The ship’s involvement in the war marked the beginning of Burnham’s long journey toward redemption, making the Shenzhou’s story central to the narrative of Star Trek: Discovery.",
    "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTmBKIloBEXqX17-3Ko76xpqIkFqz-2MGIJDQ&s"
  },
  {
    "Affiliation": "Federation",
    "Class": "Dreadnought",
    "Ship": "USS Vengeance",
    "Propulsion": "Warp Drive",
    "Details": "Khan calls the Vengeance a ship of the Dreadnought class, which would only make sense if the first ship of the class were named USS Dreadnought, rather than USS Vengeance. But he may actually mean \"Dreadnought type\", which could stand for a new type of heavily armed vessel, much like the HMS Dreadnought was one in real life.\n\nThe Vengeance can be seen next to the Enterprise, and the visual comparison confirms Khan's statement that the new ship is twice as long. The max. speed of Warp 11.5 (old scale, of course) results from Khan's statement that the Dreadnought class is three times as fast as the Enterprise.\n\nThe ship was designed, built and launched in just one year, by an organization that is known for covert operations and not for shipbuilding, in a secret installation that likely didn't previously exist, and in the Sol system with its heavy space traffic that would make keeping the secret extremely hard. Uhm, yes.\n\nSeeing that the people in charge have lost perspective of ship sizes, we may decide that it all doesn't matter any longer and put up with whatever they decide, or we settle on a more reasonable size for the Enterprise, so we are dealing with a Vengeance of \"only\" some 750m, and not one mile.",
    "Image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/f2e0f812-760e-426d-8792-fe53817ccbd3/dgfzjps-dc730507-9671-4250-9758-435eac2e530d.png/v1/fill/w_1280,h_600,q_80,strp/uss_vengeance_by_jetfreak_7_dgfzjps-fullview.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9NjAwIiwicGF0aCI6IlwvZlwvZjJlMGY4MTItNzYwZS00MjZkLTg3OTItZmU1MzgxN2NjYmQzXC9kZ2Z6anBzLWRjNzMwNTA3LTk2NzEtNDI1MC05NzU4LTQzNWVhYzJlNTMwZC5wbmciLCJ3aWR0aCI6Ijw9MTI4MCJ9XV0sImF1ZCI6WyJ1cm46c2VydmljZTppbWFnZS5vcGVyYXRpb25zIl19.ZHiVx5qmCicpFDowVu8TfFrpGHQ9Zk-nb8jh8W08VXg"
  }
]