[
  {
    "Actor Name": "Andreas Katsulas",
    "Details": "1989 - Commander Tomalak - STTNG S3:E7 (The Enemy)\n1990 - Commander Tomalak - STTNG S3:E10 (The Defector)\n1990 - Commander Tomalak - STTNG S4:E8 (Future Imperfect)\n1994 - Commander Tomalak - STTNG S7:E25 (All Good Things...)\n2003 - Vissian Captain Drennik - ST:ENT S2:E22 (Cogenitor)",
    "Mini Bio": "Born in St. Louis, Missouri, Andreas from a working-class Greek-American family. Attracted from early childhood to being on stage when at 4 his mother took him to see a community theater performance, he took theatre as an extra-curricular activity in high school. He then majored in it at St. Louis University, where he worked his way through school doing things like waiting on tables. Next, after earning a drama fellowship, Katsulas received a Master's Degree in Theater Arts from one of the nation's top schools for the genre, Indiana University in Bloomington, Indiana.\n\nWith never a doubt or hesitation, Andreas jumped right into the professional theater world, performing in plays in his native St. Louis with the Loretto-Hilton Repertory Theater. This was followed by work with the Theatre Company of Boston. After that, Katsulas moved to New York to some challenging off-off-Broadway theater at La Mama. This was followed by a fifteen-year heart and soul involvement with Peter Brook's International Theatre Company in Paris, performing around the world with a challenging combination of improvisational theater in every imaginable circumstance and space, and \"prepared\" theater pieces in traditional, as well as unconventional, theatrical spaces. Katsulas trod the boards from Lincoln Center in New York and The Kennedy Center in Washington, D.C., to the \"mean streets\" of Brooklyn and marketplaces in remote African Villages. There were performances from elite Theater Festivals in Iran, Avignon and Belgrade: in prisons & mental institutions; at rock quarries in Australia; on barrios in Venezuela; in sewage plants in Switzerland; winding through the streets of Venice, Italy; in the fields with farm workers in California, near the lakes of Minnesota with Native Americans, in sometimes extreme conditions like snow, rain, and intensive heat.\n\nDuring a hiatus from the stage, a part in Michael Cimino's The Sicilian (1987) brought Andreas to Los Angeles, after which he was immediately cast as Joey Venza in Ridley Scott's Someone to Watch Over Me (1987), then as Arthur, the chauffeur, in Blake Edwards's Sunset (1988).\n\nIn early 2005, Andreas was diagnosed with inoperable lung cancer; he passed away a year later, in Los Angeles. He had lived there since 1986, and had hoped to return to working in the theater before his far-too-early death, just over three months shy of his 60th birthday.",
    "Image": "https://www.andreaskatsulas.com/gallery/pics/andr34..jpg"
  },
  {
    "Actor Name": "Ann Gillespie",
    "Details": "1989 - Ensign Hildebrant - STTNG S2:E15 (Pen Pals)\n1993 - Nurse Jabara - ST:DS9 S1:E4 (Babel)\n1994 - Nurse Jabara - ST:DS9 S2:E22 (The Wire)\n1995 - Nurse Jabara - ST:DS9 S3:E13 (Life Support)\n1995 - Nurse Jabara - ST:DS9 S3:E18 (Distant Voices)",
    "Mini Bio": "Ann Gillespie is known for Star Trek: Deep Space Nine (1993), Ryan's Hope (1975) and Beverly Hills, 90210 (1990). She has been married to Jeff Allin since 1984. They have two children.",
    "Image": "https://img.seriebox.com/people/47/47458/ann-gillespie_min225.jpg"
  },
  {
    "Actor Name": "Anne Haney",
    "Details": "1989 - Rishon Uxbridge - STTNG S3:E3 (The Survivors)\n1993 - Renora - ST:DS9 S1:E7 (Dax)",
    "Mini Bio": "Anne Haney held prominent roles acting on stage, on the screen, and on TV. All these achievements came in her mid-40s, after she had raised a daughter and buried a husband. It wasn't until after she had packed her daughter off to college and \"the maid quit\", as she said, that she decided to try her hand at acting. She was born in Memphis, Tennessee and studied drama, radio and TV at the University of North Carolina, where she met her husband, John Haney. She did apply her schooling briefly at a Memphis television station, but soon settled down with her husband and devoted herself to family life. \"I was a lovely faculty wife. We made ambrosia salad. We did good works. We played a lot of bridge\", she said of those times. By the 1970s, however, Haney began seeking work in local theatre productions and television commercials. Soon, she was traveling with a touring company performing as the maid in Noël Coward's \"Fallen Angels\". She toured for two years. Eventually, she joined the Screen Actors Guild and the American Federation of T.V. and Radio Artists. She and her husband had, in fact, planned to move to Southern California after his retirement. She was eager to experience and, she hoped, benefit from the variety and prestige available only in Hollywood. Those plans changed when Mr. Haney died of kidney disease in 1980; Anne Haney made the trek to California, alone. Not long after arriving, she had an agent and a part in the Walter Matthau vehicle Hopscotch (1980). As her career took off, she also secured roles on stage, notably the role of Margaret Fielding in the Theatre West production of \"Verdigris\". When asked whether she ever dwelled on the prospect that had she begun her career too late, she replied that \"this is gravy to me. It's a wonderful way to spend the last third of my life\".",
    "Image": "https://imgcdn.stablediffusionweb.com/2024/4/19/b291b32e-c0c6-4ad4-b18b-15fc2f6ae8de.jpg"
  },
  {
    "Actor Name": "Annette Helde",
    "Details": "1995 - Karina - STTNG S3:E17 (Visionary)\n1996 - Guard - Star Trek: First Contact\n1997 - Takar - ST:VOY S4:E7 (Scientific Method)\n1998 - Lt. Nadia Larkin - ST:DS9 S7:E8 (The Siege of AR-558)",
    "Mini Bio": "Annette Helde is known for Nixon (1995), Magnolia (1999) and Star Trek: First Contact (1996).",
    "Image": "https://fwcdn.pl/ppo/19/46/91946/222753.1.jpg"
  },
  {
    "Actor Name": "Armin Shimerman",
    "Details": "1987 - Letek - STTNG S1:E4 (The Last Outpost)\n1987 - Gift-Box Face - STTNG S1:E10 (Haven)\n1989 - DaiMon Bractor - STTNG S2:E21 (Peak Performance)\n1993-1999 - Quark - ST:DS9\n1994 - Quark - STTNG S7:E21 (Firstborn)\n1995 - Quark - ST:VOY S1:E1 (Caretaker)\n1998 - Quark - Star Trek: Insurrection",
    "Mini Bio": "A constant presence on network television, Armin Shimerman might not be recognized by the average viewer given the fact that his best-known role as Ferengi bar owner Quark on the science fiction series \"Star Trek: Deep Space Nine\" had him operating from beneath a load of prosthetic makeup. Shimerman didn't start acting until he moved to Los Angeles with his family while still in high school. After graduating from UCLA, then moving to New York City to look for theater roles, he returned to the West Coast when he started making random appearances in \"Hill Street Blues\" and \"Cagney and Lacey.\" Shimerman's resume of one-off guest spots on numerous series includes \"Remington Steele,\" \"The Facts of Life,\" and a memorable stint as Kramer's caddy on \"Seinfeld.\" While regular work included playing Pascal on \"Beauty and the Beast\" and Principal Snyder on \"Buffy the Vampire Slayer,\" his big break came getting cast as a Ferengi alien on \"Star Trek: The Next Generation.\" Shimerman was asked to be Quark in the spinoff, \"Star Trek: Deep Space Nine\" and after playing the same character in \"Star Trek: Voyager,\" become one of only three other regulars to appear in three different \"Star Trek\" series. A multi-episode role playing Judge Brian Hooper on \"Boston Public\" allowed Shimerman to be part of a mini-\"Star Trek\" reunion alongside William Shatner, René Auberjonois, and Ethan Phillips, all alums of shows connected to the vaunted sci-fi franchise.",
    "Image": "https://workingactorsjourney.com/wp-content/uploads/2018/01/Armin-Shimerman.png"
  },
  {
    "Actor Name": "Aron Eisenberg",
    "Details": "1993-1999 - Nog - ST:DS9\n1995 - Young Kazon - ST:VOY S1:E10 (State of Flux)\n1995 - Kar - ST:VOY S2:E2 (Initiations)",
    "Mini Bio": "Actor Aron Eisenberg worked in television and film but was best known to audiences as Nog, a character from \"Star Trek: Deep Space Nine\" (1993-99). Eisenberg was born in Los Angeles where he was adopted and was raised. Eisenberg was born with only one kidney, a fact of biology which limited his height. After studying theatre at Moorpark College Eisenberg made his small screen debut in 1988 in the Canadian series \"Straight Up.\" The next year he appeared in \"Amityville 4: The Evil Escapes\" (1989), a television movie, and \"Caddie Woodlawn\" (1989), another made for TV movie based on the book by Carol Ryrie Brink. In 1989 Eisenberg made his transition to the small screen, playing Simon in \"Beverly Hills Brats,\" and the role of Scott McCarthy in the movie \"The Horror Show.\" As the 90s progressed, Eisenberg found himself cast in more and more projects in the horror and sci-fi genres. In 1990 he appeared in \"Playroom\" and \"Prayer of the Rollerboys,\" starring Corey Haim and Patricia Arquette. In 1991 he appeared in \"Puppet Master III: Toulon's Revenge\" and \"Tales from the Crypt\" ( HBO, 1989-1996). In 1993 he was cast in \"Star Trek: Deep Space Nine\" as Nog. He stayed on the series for its duration while also continuing to make guest appearance on television series and appear in various film projects. Additionally, Eisenberg worked as a photographer. He was the father of two children, and married Melissa Longo in 2018. In September 2019, Eisenberg died of heart failure at the age of 50.",
    "Image": "https://ew.com/thmb/792MhJhlQkYzuL--tz9P2Rd5SFA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/aron-eisenberg-2000-06a180d9049d4929aa699dc304177144.jpg"
  }
]