[
  {
    "e.": "Andoria",
    "Star System": "The Andoria system, also known as the Procyon system, is located relatively close to Earth. The planet Andoria itself is an icy moon orbiting a gas giant in the system. The harsh conditions of the planet, characterized by extreme cold and ice storms, have influenced the development of the Andorian species, fostering a strong, warrior-like culture. The system’s proximity to key regions of space made it an essential part of the founding of the United Federation of Planets.",
    "Description": "Andoria is a frozen, ice-covered moon with extreme weather conditions. The terrain consists largely of glaciers, snow-covered mountains, and frigid oceans. Despite the hostile environment, the Andorians developed an advanced civilization. Their cities, often subterranean or within protective domes, are marvels of engineering. Andoria's military tradition and defensive capabilities were significant during its involvement in the Federation's formation. The harsh environment also led to the development of the antennae-based sensitivity of its inhabitants.",
    "Inhabitants": "The Andorians are a humanoid species with distinctive blue skin and cranial antennae. They are known for their warrior culture, valuing honor, duty, and combat readiness. Andorians also have a long-standing rivalry with the Vulcans. Their society is hierarchical and clan-based, with family and blood ties being central. A subspecies, the Aenar, are blind, pale-skinned telepaths who live in the icy northern regions of Andoria. The Aenar maintain a peaceful and pacifist lifestyle, contrasting with their Andorian cousins.",
    "Image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/227aa84a-3013-4dd4-a697-9417df6a1b86/d5hyp6m-b13d9cb5-30ca-4de0-99b9-0ad7b39d0528.jpg/v1/fill/w_1280,h_720,q_75,strp/andoria_by_nethskie_d5hyp6m-fullview.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9NzIwIiwicGF0aCI6IlwvZlwvMjI3YWE4NGEtMzAxMy00ZGQ0LWE2OTctOTQxN2RmNmExYjg2XC9kNWh5cDZtLWIxM2Q5Y2I1LTMwY2EtNGRlMC05OWI5LTBhZDdiMzlkMDUyOC5qcGciLCJ3aWR0aCI6Ijw9MTI4MCJ9XV0sImF1ZCI6WyJ1cm46c2VydmljZTppbWFnZS5vcGVyYXRpb25zIl19.C8DQkupJgAhK-aRuHXIYavgPmDSzQ0FQ13BmIJPud-w"
  },
  {
    "e.": "Bajor",
    "Star System": "Bajor is situated in the Bajoran system, close to the strategic Bajoran wormhole, which connects the Alpha and Gamma Quadrants. This makes it a significant location for interstellar travel and trade.",
    "Description": "Bajor is a beautiful and fertile planet, with rolling hills, green oceans, and a temperate climate. It is known for its agricultural productivity, which has sustained its people through difficult times, including the harsh Cardassian occupation.",
    "Inhabitants": "The inhabitants of Bajor, called Bajorans, are deeply spiritual, with their faith centered around the Prophets, who reside in the Celestial Temple (the Bajoran wormhole). Their religious and cultural traditions play a vital role in their society and governance.",
    "Image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/dced930e-6a65-4b21-aa16-fb26128d0dae/d2d7ka9-1a07d735-a504-4565-8f5e-f2d667e56d31.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcL2RjZWQ5MzBlLTZhNjUtNGIyMS1hYTE2LWZiMjYxMjhkMGRhZVwvZDJkN2thOS0xYTA3ZDczNS1hNTA0LTQ1NjUtOGY1ZS1mMmQ2NjdlNTZkMzEuanBnIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.WntYK6Br-6Jx_qYflfmL3O-jkI9JlE1hSZx8qW8-2L4"
  },
  {
    "e.": "Betazed",
    "Star System": "Betazed is located in the Beta Zeta system. The system is characterized by a stable star that allows the planet Betazed to maintain its temperate and lush environment. Betazed's strategic location near key trade routes and important star systems makes it an essential member of the Federation.",
    "Description": "Betazed is a beautiful, temperate planet with lush greenery, rolling hills, and a warm climate. The surface is largely dominated by forests, lakes, and rivers, making it an idyllic world. The planet is also known for its unique flora and fauna. Betazed is a peaceful planet, known for its open society that encourages empathy and emotional openness, influenced by the telepathic abilities of its inhabitants. The planet is home to magnificent cities, blending nature and architecture seamlessly.",
    "Inhabitants": "The Betazoids are a humanoid species known for their telepathic abilities, which allow them to sense thoughts and emotions. These powers shape their culture, which is based on openness, trust, and emotional connection. Betazoids are typically peaceful and diplomatic, making them invaluable members of the Federation. Their telepathic skills are especially valued in diplomacy and counseling. They are also known for their honesty and directness, as their culture disdains deceit due to the transparency of their minds.",
    "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTYqbAaLc4KFEdRKu0FMhQa72xgfG307MTWGQ&s"
  },
  {
    "e.": "Cardassia Prime",
    "Star System": "Cardassia Prime is located in the Cardassia system in the Alpha Quadrant. It orbits its star alongside three moons and serves as the political and cultural center of the Cardassian Union.",
    "Description": "Once a lush, arboreal planet, Cardassia Prime was devastated by overexploitation of its natural resources, turning it into a dry and arid world. The planet suffered even further destruction during the Dominion War, which left much of the surface in ruins.",
    "Inhabitants": "Cardassia Prime is home to the Cardassians, a proud, militaristic species known for their authoritarian government and expansionist policies. The Cardassians have often been in conflict with the United Federation of Planets and the Bajorans.",
    "Image": "https://stowiki.net/w/images/Wiki_Images/sto_images/4/4e/Cardassia_Prime_S9.png"
  },
  {
    "e.": "Ceti Alpha V",
    "Star System": "Ceti Alpha V is located in the Ceti Alpha star system, a relatively isolated system in the Alpha Quadrant. The system is primarily known for its harsh, uninhabitable planets. Ceti Alpha V orbits a yellow star and is part of a multi-planet system. The Ceti Alpha system gained infamy due to the events surrounding the marooning of Khan Noonien Singh and his followers on Ceti Alpha V.",
    "Description": "Ceti Alpha V was once a relatively habitable, desert-like planet. However, after the explosion of its neighboring planet, Ceti Alpha VI, the environmental conditions on Ceti Alpha V deteriorated drastically. The planet became almost entirely barren, with violent storms and extreme temperatures. Life on the planet became harsh, and most indigenous lifeforms were wiped out. The planet is infamous for its dangerous native creatures, such as the Ceti Eels, parasitic organisms capable of controlling their hosts.",
    "Inhabitants": "Ceti Alpha V is most famous for being the planet where Khan Noonien Singh and his followers were exiled by Captain James T. Kirk in the 23rd century. After the environmental catastrophe caused by Ceti Alpha VI’s destruction, Khan and his people struggled to survive in the now desolate landscape. Their plight is one of endurance, hardship, and, ultimately, vengeance. Before Khan’s arrival, the planet had native creatures, like the deadly Ceti Eels, which became infamous for their parasitic behavior.",
    "Image": "https://lh3.googleusercontent.com/proxy/1-3cqOwBW9jJZsAUNm26caZdGcCZd88H0bE8ehTUXuCZh6dM-hepX9P7M3ea6sc8J-BWh8g66E06tpD9KOixBn7u0QAeZOjCwXbrz-XoIezV1uR0CRz6ky6r"
  },
  {
    "e.": "Denobula",
    "Star System": "Denobula, also referred to as Denobula Triaxa, is located in the Denobula Triaxa star system. It is a crucial part of the Denobulan civilization’s expansion into space. The system is well-integrated with surrounding systems and maintains active interstellar trade and travel routes. The Denobulans have a long history of space exploration, and the Denobula Triaxa system is one of the central hubs for their culture and economy.",
    "Description": "Denobula is a temperate planet with a diverse ecosystem and several large continents. The planet features beautiful natural landscapes, ranging from vast forests to expansive plains and rivers. Denobula's cities are known for their advanced architecture and blend harmoniously with the environment. The Denobulans have developed a sustainable society that thrives on balancing technological advancement with environmental stewardship. The planet is home to a variety of native flora and fauna, and Denobulans are known for their deep connection to nature.",
    "Inhabitants": "The Denobulans are a humanoid species known for their distinctive ridged foreheads and wide smiles. They are a highly social species with complex family structures, including polyandrous and polygamous relationships. Denobulans are known for their resilience and long lifespans, often living well over two centuries. Their culture emphasizes scientific and medical advancement, and they are known for their pacifist nature and deep commitment to exploration and knowledge. They played a vital role during the early years of Starfleet, particularly in the fields of medicine.",
    "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTk3MgRza8ZiSQbtMh2wUHg2JyGEeuX68CSqtL0veqZkEgmTKolLuvlx-onxNjtb3I9Ifc&usqp=CAU"
  },
  {
    "e.": "Ferenginar",
    "Star System": "Ferenginar is part of the Ferenginar system, and its capital city features the Tower of Commerce, which houses the seat of power for the Grand Nagus, the leader of the Ferengi Alliance. The planet plays a central role in Ferengi commerce and governance.",
    "Description": "The planet's climate is perpetually humid, with rain being a constant feature. This creates a muddy and damp landscape, filled with swamps and decaying vegetation. Despite the inhospitable conditions, Ferenginar thrives economically as the center of the Ferengi’s capitalist-driven society.",
    "Inhabitants": "The Ferengi, the primary inhabitants of Ferenginar, are known for their devotion to commerce and profit, guided by the \"Rules of Acquisition.\" Their society is patriarchal, though reforms under Grand Nagus Rom have granted more freedoms to women, allowing them to participate in commerce and wear clothing.",
    "Image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSUBIs-vHjNoCMCE5-T7ChQYZoy676JxpsFUw&s"
  },
  {
    "e.": "Kaminar",
    "Star System": "Kaminar is located outside of Federation space, in an uncharted region of the galaxy. Its system includes at least two moons and is characterized by a delicate balance between the species that inhabit the planet.",
    "Description": "The planet’s surface is dominated by oceans and fertile farmland. Kaminar’s unique predator-prey dynamic between the Ba'ul and Kelpiens once defined the ecosystem, with the Ba'ul technologically dominating the Kelpiens, who were subjected to regular \"cullings\" until they evolved to challenge their position.",
    "Inhabitants": "The planet is inhabited by the Kelpiens, a formerly oppressed species, and the Ba'ul, an isolationist and technologically advanced race. The Kelpiens have become more integrated into the galactic community following the events depicted in *Star Trek: Discovery*.",
    "Image": "https://blog.trekcore.com/wp-content/uploads/2019/02/signal.jpg"
  },
  {
    "e.": "Qo'noS (Kronos)",
    "Star System": "The planet is located in the Qo'noS system within the Beta Quadrant, relatively close to Federation space. This proximity has led to frequent interactions, both diplomatic and hostile, between the Klingon Empire and the United Federation of Planets. Its strategic location makes it a key player in interstellar politics.",
    "Description": "Qo'noS, also spelled Kronos, is the homeworld of the Klingon species. It is one of the most important planets in the Star Trek universe and serves as the central hub of the Klingon Empire’s political and military power.",
    "Inhabitants": "The Klingons, a proud and militaristic species, inhabit Qo'noS. Known for their warrior culture, the Klingons place a high emphasis on honor and battle. The planet's capital, the First City, is the seat of the Klingon High Council, which governs the empire and directs its military and political affairs.",
    "Image": "https://uss-theurgy.com/w/images/thumb/4/40/Qo%27nos_the_Klingon_Homeworld.png/450px-Qo%27nos_the_Klingon_Homeworld.png"
  },
  {
    "e.": "Remus",
    "Star System": "Remus is the third planet in the Romulus system, serving as the home of the Reman species. It is known for its tidally locked orbit, leaving one side perpetually facing the sun and the other in permanent darkness.",
    "Description": "Remus is rich in dilithium and has vast mining operations on its surface. The planet's dark side is habitable, while the sunlit side is too harsh for life. The Remans live on the dark side.",
    "Inhabitants": "The inhabitants of Remus, known as Remans, have adapted to the dark side of the planet and are often used as laborers in the planet's dilithium mines. They have historically been treated as a slave class by the Romulans.",
    "Image": "https://i.pinimg.com/736x/62/66/8a/62668ab712487c98c7cee2af521fc536.jpg"
  },
  {
    "e.": "Risa",
    "Star System": "Located in the Risa system within the Alpha Quadrant, the planet is approximately 90 light-years from Earth. It is a member of the United Federation of Planets.",
    "Description": "Risa, known as the \"pleasure planet,\" is a renowned vacation destination in the Star Trek universe. It is famous for its warm climate, beaches, and luxurious resorts, offering visitors the ultimate experience in relaxation and leisure.",
    "Inhabitants": "The inhabitants of Risa, called Risians, are known for their open and free-spirited nature, especially regarding sexuality. The symbol of their culture is the *horga'hn*, a totem representing fertility, which is often associated with the planet's hedonistic traditions.",
    "Image": "https://www.stf-wiki.com/images/thumb/b/b0/Risa.jpg/450px-Risa.jpg"
  },
  {
    "e.": "Romulus",
    "Star System": "Located in the Romulus system, Romulus was the second of two sister planets, with Remus being the other. Both orbited the star Eisn, making the system vital to the Romulan Empire's infrastructure and governance.",
    "Description": "Romulus was a lush, Earth-like planet with a wide variety of ecosystems, including forests, oceans, and urbanized cities. Its society was highly militaristic, with a rigid class structure and an emphasis on secrecy, reflected in its political dealings.",
    "Inhabitants": "The Romulans, biological cousins to the Vulcans, were the primary inhabitants of Romulus. Their society was defined by political intrigue, military dominance, and a strong sense of superiority, which led to many conflicts with the United Federation of Planets and other major powers.",
    "Image": "https://www.startrekdb.se/astronomi/bilder/romulus-planet.jpg"
  },
  {
    "e.": "Talos IV",
    "Star System": "Talos IV is located in the Talos star system, within the Alpha Quadrant. This system lies beyond most Federation-controlled space and is isolated from major space routes. The system’s remoteness contributes to its mysterious reputation and the decision by the Federation to restrict access to the planet. Its placement in a relatively desolate region of space makes it difficult to reach, adding to the enigma surrounding the Talosians and their world.",
    "Description": "Talos IV is a barren, desolate planet with a surface that has been largely devastated by a series of cataclysms. The planet's ecosystem was severely damaged in an ancient war, leaving much of the surface inhospitable. Most of the remaining life exists below ground, in caves and tunnels. The Talosians have created elaborate underground cities, where they use their psychic powers to control their environment and simulate illusions. The surface is dominated by rocky formations, dead vegetation, and craters.",
    "Inhabitants": "The Talosians are a humanoid species with large, bulbous heads and advanced telepathic abilities. They can create powerful illusions, which can deceive even the most advanced species. The Talosians once had a thriving civilization but became dependent on their mental powers and neglected physical development. They now live reclusively underground and seek to manipulate other species for their entertainment or survival. The Federation has classified contact with the Talosians as highly restricted, leading to the infamous General Order 7.",
    "Image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/3b1e590e-737e-4ec8-83f2-9091fe30d596/d8t03gn-154c9eb1-0c3a-4499-94dc-26f3fd793d01.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzNiMWU1OTBlLTczN2UtNGVjOC04M2YyLTkwOTFmZTMwZDU5NlwvZDh0MDNnbi0xNTRjOWViMS0wYzNhLTQ0OTktOTRkYy0yNmYzZmQ3OTNkMDEuanBnIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.ky1Sz-f8dmLL7vCLkMLHUcKgIYi5vUgeuVBeX-Rl6yU"
  },
  {
    "e.": "Trill",
    "Star System": "Coming SoonTrill is the homeworld of the Trill species, a planet in the Trill system within the Alpha Quadrant. The planet is notable for its symbiotic species: humanoid Trill and the non-humanoid Trill symbionts, which live together in a unique partnership.",
    "Description": "Trill is an M-class planet with temperate conditions, known for its green forests and blue seas. The capital city, Mak'ala, is a major hub of activity, including medical facilities that perform the crucial symbiont-joining processes.",
    "Inhabitants": "The inhabitants of Trill include two species: the humanoid Trill and the symbionts. Only a small percentage of humanoid Trill are selected to host a symbiont, making the \"joined\" Trill unique in their ability to access memories and experiences from multiple lifetimes.",
    "Image": "https://www.trekzone-rs.de/wcf/attachment/4030-trill-png/"
  },
  {
    "e.": "Vulcan",
    "Star System": "Vulcan's star, 40 Eridani A, is a real star identified by Star Trek creator Gene Roddenberry and scientists as the likely location of Vulcan. In 2018, astronomers discovered a super-Earth orbiting this star, closely matching Vulcan's characteristics, though it is larger and would have stronger gravity than Earth. This real planet orbits 40 Eridani A every 42 days, which could make it quite hot..",
    "Description": "Vulcan, the homeworld of the Vulcan species, is a Class M desert planet located in the 40 Eridani A star system, about 16 light-years from Earth. The planet has an arid, hot climate with vast deserts, high mountain ranges, and sparse vegetation. Due to its high gravity (1.4 times that of Earth), Vulcans are physically stronger and faster than humans, with greater resistance to environmental stressors such as heat and dehydration. However, Vulcans are more susceptible to cold temperatures.",
    "Inhabitants": "The Vulcan people are renowned for their commitment to logic and emotional suppression, a philosophy introduced by the Vulcan philosopher Surak around the 4th century BC. This shift was crucial in ending the violent, war-torn era of Vulcan's history. Vulcans who rejected Surak's teachings left the planet and became the Romulans.",
    "Image": "https://wordpress-assets.futurism.com/2013/02/200635_414242988662116_1691606020_n.jpg"
  }
]